import uuid
from flask import Flask, request, jsonify
from flask_cors import CORS
import os
import bcrypt
import jwt
from datetime import datetime, timedelta, UTC
import sqlite3
import requests
import re
import smtplib
from email.mime.text import MIMEText
from email.mime.multipart import MIMEMultipart
from dotenv import load_dotenv
from fuzzywuzzy import process, fuzz
from openai import OpenAI


# Load environment variables
load_dotenv()

app = Flask(__name__)
CORS(app)

# Configuration
JWT_SECRET = os.getenv(
    "JWT_SECRET", "16f60d1f73509325d9476d3477ab63b93c6ce19738d3cc002acea57e56596173"
)
EMAIL_ADDRESS = os.getenv("EMAIL_ADDRESS")
EMAIL_PASSWORD = os.getenv("EMAIL_PASSWORD")
GEMINI_API_KEY = os.getenv("VITE_GEMINI_API_KEY", "")

client = OpenAI(
    base_url="https://openrouter.ai/api/v1",
    api_key="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",
)


def convert_to_arabic(text):
    completion = client.chat.completions.create(
        extra_headers={
            "HTTP-Referer": "<YOUR_SITE_URL>",  # Optional. Site URL for rankings on openrouter.ai.
            "X-Title": "<YOUR_SITE_NAME>",  # Optional. Site title for rankings on openrouter.ai.
        },
        extra_body={},
        model="google/gemini-2.0-flash-exp:free",
        messages=[
            {
                "role": "user",
                "content": [
                    {
                        "type": "text",
                        "text": text
                        + "translate this into arabic and choose the answer from the provided arabic questions list  (give me the answer only without any additionl details and make answer short and select the most related answer from the following data: * ماهي رؤية القسم؟ * ماهو قسم تقنية المعلومات و المكتبات؟ * ماهي رسالة القسم؟ * ماهي اهداف القسم؟ * لينك النتيجة؟ * لينك القسم؟ * شروط القسم؟ * دكاترة القسم؟ * من انت ؟ * لائحة القسم؟ * المواد الاجبارية؟ * المواد الاختيارية؟ * لينك الاستبيان * ماهي التدريبات المتوافرة؟ * لينك تسجيل المقررات؟ * لينك جامعة طنطا؟ * ازاي اعرف ارقام الجلوس؟ * ازاي اعرف اماكن اللجان؟ * ايه هي اجراءات الكشف الطبي؟ * لينك الكشف الطبي؟ * ايه هي متطلبات التقديم للطلاب ؟ * مصاريف القسم؟ * لينك التربية العسكرية؟ * لينك تحميل صورة الكارنية ؟ * لينك تقديم المدينة الجامعية؟ * لينك التشعيب ؟ * ازاي اتعامل مع لينك التشعيب؟ * لينك منصة التحصيل الالكتروني؟ * ازاي اتعامل مع منصة التحصيل الالكتروني؟ * لينك منصة الكتاب الالكتروني ؟ * ازاي اتعامل مع منصة الكتاب الالكتروني؟ * رقم دكتور ثروت الغلبان؟ * ايميل دكتور ثروت الغلبان؟ * ماهي وظيفة الدكتور ثروت الغلبان ؟ * دكتور ثروت الغلبان؟ * ايميل دكتور احمد العربي؟ * ماهي وظيفة الدكتوراحمد العربي؟ * دكتور احمد العربي؟ * ايميل دكتور بدوية البسيوني؟ * ماهي وظيفة الدكتور بدوية البسيوني ؟ * دكتور بدوية البسيوني؟ * رقم دكتور نادية سعد؟ * ايميل دكتور نادية سعد؟ * ماهي وظيفة الدكتور نادية سعد * دكتور نادية سعد ؟ * رقم دكتور هبه دنيا؟ * ايميل دكتور هبه دنيا؟ * ماهي وظيفة دكتور هبه دنيا؟ * دكتور هبه دنيا؟ * رقم دكتور هبه المتبولي؟ * ايميل دكتور هبه المتبولي؟ * ماهي وظيفة الدكتور هبه المتبولي؟ * دكتور هبه المتبولي؟ * رقم دكتور احمد شاهين؟ * ايميل دكتور احمد شاهين؟ * دكتور احمد شاهين؟ * رقم دكتور عواطف المكاوي؟ * ايميل دكتور عواطف المكاوي؟ * دكتور عواطف المكاوي؟ * رقم دكتور ميرفت فؤاد؟ * ايميل دكتور ميرفت فؤاد؟ * دكتور ميرفت فؤاد؟ * رقم دكتور هبه النموري؟ * ايميل دكتور هبه النموري؟ * دكتور هبه النموري؟ * رقم دكتور رضوى النوساني؟ * ايميل دكتور رضوى النوساني؟ * دكتور رضوى النوساني؟ * ايميل دكتور عبدالله فراج؟ * دكتور عبدالله فراج؟ * ايميل دكتور غاده ابو زويد؟ * دكتور غادة ابو زويد * رقم دكتور منى مصطفى؟ * ايميل دكتور منى مصطفى؟ * دكتور منى مصطفى؟ * رقم دكتور منى فاروق؟ * ايميل دكتور منى فاروق؟ * دكتور منى فاروق؟ * رقم دكتور هند السمدوني؟ * ايميل دكتور هند السمدوني؟ * دكتور هند السمدوني؟ * دكتور يمنى محمد؟ * ايه هي مقررات سنه اولى ترم اول؟ * ايه هي مقررات سنه الاولى ترم ثاني؟ * ايه هي مقررات سنه تانيه الترم الاول؟ * ايه هي مقررات سنه تانيه الترم الثاني؟ * ايه هي مقررات سنه تالته الترم الاول؟ * ايه هي مقررات سنه تالته الترم الثاني؟ * ايه هي مقررات سنه رابعه الترم الاول * ايه هي مقررات سنه رابعه ترم ثاني؟ * مادة المدخل الى علم المعلومات؟ * مادة مرافق المعلومات؟ * مادة الانترنت في المكتبات؟ * مادة مصادر المعلومات الرقمية؟ * مادة اخلاقيات المعلومات؟ * مادة دراسات المستفيدين؟ * مادة مقدمة في تقنية المعلومات؟ * مادة خدمات المعلومات الرقمية؟ * مادة تجهيز ومعالجة المعلومات؟ * مادة المصادر المرجعية الرقمية؟ * مادة المكتبات و المستودعات الرقمية؟ * مادة شبكات المعلومات؟ * مادة ادارة المكتبات و مراكز المعلومات؟ * مادة الاحصاء الببليوجرافي؟ * مادة الفهرسة الالية؟ * مادة النشر الالكتروني؟ * مادة قواعد البيانات الببليوجرافية؟ * مادة التصنيف في البيئة الرقمية؟ * مادة النظم الالية المتكاملة؟ * مادة الكلمات المفتاحية؟ * مادة امن المعلومات؟ * مادة البرامج التعاونية في مؤسسات المعلومات؟ * مادة الوعي المعلوماتي؟ * مادة الميتاداتا؟ * مادة نظم التكشيف الالية؟ * مادة التطبيقات الذكية في المكتبات؟ * مادة رقمنة مصادر المعلومات؟ * مادة برمجة الويب؟ * مادة المعلوماتيه الصحية؟ * مادة نظم المعلومات المتخصصة؟ * مادة تطبيقات النظم الخبيرة في المكتبات؟ * مادة اللغة الاجنبية الاولى؟ * مادة تسويق خدمات المعلومات؟ * مادة معمارية المعلومات؟ * مادة الترتيب و الوصف الارشيفي؟ * مادة سياسات المعلومات؟ * مادة تطبيقات الحوسبه السحابيه في المكتبات؟ * مادة تطبيقات الويب الدلالي في المكتبات؟ * مادة المعوماتية الصحية؟ * مادة بناء و ادارة المواقع و المكتبات؟ * مادة الارشفة الالكترونية؟ * مادة قياسات الويب؟ * مادة نصوص متخصصة باللغة الانجليزية؟ * مادة ادارة المجموعات الرقمية؟ * مادة ادارة مشروعات تقنية المعلومات؟ * مادة الارشيفات المتخصصة؟ * مادة التراخيص الرقمية لمصادر المعلومات؟ * مادة الجودة الشامله في المكتبات؟ * مادة عمارة المكتبات في الاثار المصرية؟ * مادة اثار مصر عبر العصور؟ * مادة مشروع التخرج؟ * مادة التدريب الميداني؟ * امتحان مادة بناء وادارة المواقع؟ * امتحان مادة الانترنت في المكتبات؟ * امتحان ميدتيرم لمادة تجهيز ومعالجة المعلومات؟ * امتحان لمادة المعلوماتية الصحية؟ * امتحان ميدتيرم لمادة الميتاداتا؟ * امتحان لمادة الميتاداتا * امتحان ميدتيرم لمادة نظم المعلومات المتخصصة؟ * امتحان مادة امن المعلومات؟ * امتحان لمادة تسويق خدمات المعلومات؟ * امتحان مادة معمارية المعلومات؟ * امتحان مادة اللغة الاجنبية الاولى؟ * امتحان ميدتيرم لمادة تطبيقات النظم الخبيرة؟ * امتحان مادة تطبيقات النظم الخبيرة؟ * امتحان ميدتيرم لمادة تجهيز ومعالجة المعلومات؟ * امتحان مادة شبكات المعلومات؟ * امتحان مادة المصادر المرجعية الرقمية؟ * امتحان مادة الفهرسة الالية؟ * امتحان مادة اخلاقيات المعلومات؟ * امتحان مادة تهيئة المواقع لمحركات البحث؟): ",
                    }
                ],
            }
        ],
    )
    return completion.choices[0].message.content


def translate_into_english(text):
    completion = client.chat.completions.create(
        extra_headers={
            "HTTP-Referer": "<YOUR_SITE_URL>",  # Optional. Site URL for rankings on openrouter.ai.
            "X-Title": "<YOUR_SITE_NAME>",  # Optional. Site title for rankings on openrouter.ai.
        },
        extra_body={},
        model="google/gemini-2.0-flash-exp:free",
        messages=[
            {
                "role": "user",
                "content": [
                    {
                        "type": "text",
                        "text": text
                        + "translate this into English (give the answer only without any additional text in the beginning and without Asterisk)",
                    }
                ],
            }
        ],
    )
    return completion.choices[0].message.content


# Predefined prompts and answers
PREDEFINED_QA = [
    (
        "ماهي رؤية القسم؟",
        "تقديم برنامج أكاديميى مميز فى مجال تكنولوجيا المعلومات وتطبيقاتها فى مجال المكتبات والمعلومات",
    ),
    (
        "ماهو قسم تقنية المعلومات و المكتبات؟",
        "برنامج تقنية المعلومات و المكتبات برنامج اكاديمي متميز يهدف الى :- تأهيل كوادر مهنية في مجال تكنولوجيا المكتبات و المعلومات والتي تلبى احتياجات ومتطلبات سوق العمل - مواكبة التطورات و التحديثات المتسارعه في مجال تكنولوجيا المعلومات وتقييم وتبني المفيد منها مما يسهم في تطور مرافق المعلومات - اكساب الطلاب مهارات التعامل مع الميتاداتا وشبكات المعلومات وتصميم وانشاء مواقع على الانترنت وامن المعلومات وتجهيز ومعالجة المعلومات وتصميم وتحليل النظم الالية ......الخ - تمكين الطلاب من بناء وادارة وتنظيم المحتوى المعلوماتي الرقمي في مرافق المعلومات - اكساب الطلاب مهارات التعامل مع البيئة الرقمية واستخدامها في تنظيم وادارة المعلومات - الدرجة العلمية : يمنح البرنامج درجة الليسانس في تقنية المعلومات و المكتبات بنظام الساعات المعتمده - القيد و القبول : يستهدف البرنامج الطلاب الحاصلين على الثانوية العامة او ما يعادلها والذين تنطبق عليهم شروط الالتحاق بكلية الاداب - نظام الدراسة : للحصول على درجة الليسانس في تقنية المعلومات و المكتبات بنظام الساعات المعتمده يجب ان يجتاز الطالب 139 ساعة معتمده شاملة لمتطلبات الجامعة ومتطلبات الكلية ومتطلبات التخصص وفقا لنظام الفصول الدراسية - الفرص الوظيفية للخريجين : يمكن لخريجي البرنامج العمل في القطاع الحكومي و الخاص في الكثير من المجالات ومنها ادارة وتصميم و تحليل النظم الالية والتعامل مع شبكات المعلومات وتصميم وانشاء مواقع على الانترنت وامن المعلومات وتجهيز ومعالجة المعلومات و الميتاداتا ......الخ",
    ),
    (
        "ماهي رسالة القسم؟",
        "تأهيل كوادر مهنية في مجال المعلومات و تكنولوجياتها والتي تلبى احتياجات السوق",
    ),
    (
        "ماهي اهداف القسم؟",
        "يهدف برنامج تقنية المعلومات والمكتبات الى : - تحقيق المعرفة العلمية في مجال نظم المعلومات و تكنولوجياتها التي تمكن الطلاب من المشاركة في التعلم مدى الحياة - تمكين الطلاب من التصرف كمهنيين محترفين مسؤولين ومواطنين مدركين للمسؤوليات الاخلاقية و المشكلات المجتمعية وآلية حلها - مواكبة التطورات و التحديثات المتسارعة في مجال تكنولوجيا المعلومات وتقييم وتبني المفيد منها مما يسهم في تطور مرافق المعلومات - تمكين الطلاب من بناء وادارة وتنظيم المحتوى المعلوماتي الرقمي في انظمة تكنولوجيا المعلومات المتوافرة في مرافق المعلومات - اكساب الطلاب المهارات اللازمة للتواصل مع الاخرين علي مستوى العلاقات الشخصية, او العامة, او المهنية",
    ),
    (
        "لينك النتيجة؟ ",
        "https://tdb.tanta.edu.eg/regart",
    ),
    (
        "لينك القسم؟",
        "https://prog.tanat.edu.eg/ar/prog/infolib",
    ),
    # (
    (
        " شروط القسم؟",
        "يقبل البرنامج طلاب الثانوية العامة العلمي والادبي : - البرنامج ليس له شروط سوى ان يكون مجموع الطالب يقبل الالتحاق بكلية الاداب  - المصروفات :حوالي 7 الاف في السنة قابله للدفع على قسطين ترم اول و ترم ثاني  - طبيعة الدراة : 4 سنوات دراسية بنظام الساعات المعتمدة  - الدرجة العلمية : يحصل الطلاب على درجة الليسانس في تقنية المعلومات و المكتبات بنظام الساعات المعتمدة",
    ),
    (
        "  دكاترة القسم؟ ",
        "ثروت يوسف الغلبان   - احمد عباده جدوع العربي   - بدوية محمد البسيوني محمد البسيوني  - نادية سعد مرسي على  - هبه فتحي بسيوني دنيا  - هبه احمد محمد احمد المتبولي  - احمد رجب احمد شاهين  - عواطف علي علي المكاوي  - ميرفت فؤاد جرجس غبريال  - هبه صلاح الدين النمورى  - رضوى محمد جلال زكريا النوساني  - عبدالله فراج عبدالمجيد عامر  - غادة عزت محمود ابو زويد  - منى مصطفى ابراهيم مرسى  - منى فاروق عباس شهوان  - هند عبدالحفيظ عبدالله صالح السمدونى  عمرو الخولي  - السيد سلام  - تهاني علام  - هاني الغايش  - امنية البربري  - رضا البسيوني  - شيماء خاطر  - مصطفى العشري    - ابراهيم عبد العال    - رافت عبد الرزاق",
    ),
    (
        "من انت ؟",
        "FOA CHAT اول شات بوت خاص بكلية الاداب جامعة طنطا صنع على يد طلاب من قسم تقنية المعلومات و المكتبات لمساعدة الطلاب الجدد والاجابة على اسئلتهم فورا وبدون تعقيد",
    ),
    (
        " لائحة القسم؟",
        " من خلال زيارة الرابط: https://prog.tanta.edu.eg/ar/spage/29/1675/%D9%84%D8%A7%D8%A6%D8%AD%D8%A9%20%D8%A7%D9%84%D8%A8%D8%B1%D9%86%D8%A7%D9%85%D8%AC",
    ),
    (
        " المواد الاجبارية؟",
        "المدخل الى علم المعلومات  - مرافق المعلومات  - الانترنت في المكتبات  - مصادر المعلومات الرقمية  - اخلاقيات الملومات  - دراسات المستفيدين  - مقدمة في تقنية المعلومات  - خدمات المعلومات الرقمية  - تجهيز ومعالجة المعلومات  - المصادر المرجعية الرقمية  - المكتبات و المستودعات الرقمية  - شبكات المعلومات  - ادارة المكتبات و مراكز المعلومات  - الاحصاء الببليوجرافي  - الفهرسة الالية - النشر الالكتروني  - نصوص متخصصه باللغة الانجليزية  - قواعد البيانات الببليوجرافية  - التصنيف في البيئة الرقمية  -النظم الالية المتكاملة  - الكلمات المفتاحية  - تطبيقات الحوسبه السحابيه في المكتبات  - امن المعلومات  - الميتاداتا - نظم التكشيف الالية  - التطبيقات الذكية في المكتبات  - رقمنة مصادر المعلومات  - برمجة الويب  - الترتيب و الوصف الارشيفي  - تطبيقات الويب الدلالي في المكتبات  - سياسات المعلومات  - تطبيقات النظم الخبيرة في المكتبات -  اللغة الاجنبية الاولى  - بناء و ادارة مواقع المكتبات  - الارشفة الالكترونية  - قياسات الويب  - علم المكتبات المقارن  - الجود الشاملة في المكتبات  - مشروع التخرج  - التدريب الميداني ",
    ),
    (
        " المواد الاختيارية؟",
        "البرامج التعاونية في مؤسسات المعلومات  - الوعي المعلوماتي  - المعلوماتيه الصحية  - نظم المعلومات المتخصصة  - تسويق خدمات المعلومات  - معمارية المعلومات  - ادارة المجموعات الرقمية  - ادارة مشروعات تقنية المعلومات  - الارشيفات المتخصصة  - التراخيص الرقمية لمصادر المعلومات  - عمارة المكتبات في الاثار المصرية  - اثار مصر عبر العصور",
    ),
    (
        " لينك الاستبيان",
        "https://prog.tanta.edu.eg/ar/spage/29/1677/%D8%A7%D8%B3%D8%AA%D8%A8%D9%8A%D8%A7%D9%86%D8%A7%D8%AA",
    ),
    (
        "ماهي التدريبات المتوافرة؟",
        "توافر للقسم معمل آلي مخصص لتدريس مقررات القسم العلمية ويتوافر به 40 جهازا كما يمكن للطلاب الافادة من نادي تكنولوجياالمعلومات التابع للجامعة و الموجود بالكلية",
    ),
    (
        "لينك تسجيل المقررات؟ ",
        "https://tdb.tanta.edu.eg",
    ),
    (
        " لينك جامعة طنطا؟",
        "https://tanta.edu.eg/",
    ),
    (
        "لينك ارقام الجلوس؟  ",
        "https://art.tanta.edu.eg/stu-sitting-num.aspx",
    ),
    (
        "لينك  اماكن اللجان؟",
        "https://art.tanta.edu.eg/stu-sitting-num.aspx",
    ),
    (
        "ايه هي اجراءات الكشف الطبي؟",
        "التعليمات المنظمة للكشف الطبي في بداية العام الدراسي تشمل: 1- سداد المصروفات الدراسية من الطلاب الجدد. 2- تحديد أيام الكشف الطبي من إدارة الجامعة بناءً على تعليمات وزارة التعليم العالي للكشف على حوالي 20 ألف طالب وطالبة خلال شهر. 3- تقسيم الكليات حسب جدول معتمد، مع تخصيص أيام للبنين والبنات والكشف في تخصصات (الباطنة – الأنف والأذن – الجراحة العامة – الرمد – الأسنان – العظام). 4- تسليم استمارة الكشف الطبي لرعاية الشباب بعد اكتمال الإجراءات. 5- فحوصات خاصة لطلبة كلية التربية الرياضية تشمل تحليل المخدرات وفحص القلب. 6- توقيع الكشف الطبي الخاص بالمدن الجامعية شرط أساسي للالتحاق مع إحضار بطاقة تطعيم فيروس كورونا",
    ),
    (
        " لينك الكشف الطبي؟",
        " https://tanta.edu.eg/stu/new-student.aspx",
    ),
    (
        "ايه هي متطلبات التقديم للطلاب  ؟ ",
        "١- أصل شهادة الثانوية العامة ٢- شهادة ميلاد كمبيوتر مدون بها الرقم الثلاثى للطلاب الذكور ٣- صورة البطاقة الشخصية ٤- أصل إيصال سداد الرسوم وصورة منه ٥- استمارة الرغبات وعليها طوابع فئة ٥٠ جنيه من خزينة الكلية ٦- طلب الالتحاق وعليه طوابع فئة ٤٠ جنيه من خزينة الكلية ٧- عدد ٤ صور شخصية ٨- استمارة ٢ جند للطلاب الذكور ملحوظة: علي الطالب تصوير نسختين من شهادة الثانوية العامة وشهادة الميلاد والبطاقة الشخصية والاحتفاظ بنسخة من أوراقه قبل تسليم الملف.",
    ),
    (
        "مصاريف القسم؟",
        "برنامج تقنية المعلومات والمكتبات: - المستوى الأول (الترم الأول 3600 جنيه) (الترم الثاني 3600 جنيه) - المستوى الثاني (الترم الأول 3600 جنيه) (الترم الثاني 3600 جنيه) - المستوى الثالث (الترم الأول 3150 جنيه) (الترم الثاني 2975 جنيه) - المستوى الرابع (الترم الأول 2975 جنيه) (الترم الثاني 2625 جنيه)",
    ),
    (
        " لينك التربية العسكرية؟",
        "https://militaryedu.tanta.edu.eg/",
    ),
    (
        "لينك تحميل صورة الكارنية ؟ ",
        "http://tdb.tanta.edu.eg/regart",
    ),
    (
        " لينك تقديم المدينة الجامعية؟",
        "https://tdb.tanta.edu.eg/univhostel/",
    ),
    (
        "لينك التشعيب ؟",
        "https://tdb2.tanta.edu.eg/branching_system/login.aspx?id=5",
    ),
    (
        "  ازاي اتعامل مع لينك التشعيب؟",
        "https://www.facebook.com/share/v/1JgXCiTaBs/?mibextid=wwXIfr",
    ),
    (
        "ازيك",
        "الحمدلله انت عامل اي؟",
    ),
    (
        "لينك منصة التحصيل الالكتروني؟",
        "https://tdb2.tanta.edu.eg/paymentgateway/e_payment/",
    ),
    (
        " ازاي اتعامل مع منصة التحصيل الالكتروني؟",
        "https://www.facebook.com/share/v/1EBLtxrusm/?mibextid=wwXIfr",
    ),
    (
        "لينك منصة الكتاب الالكتروني ؟",
        "https://tdb.tanta.edu.eg/ebooks/",
    ),
    (
        " ازاي اتعامل مع منصة الكتاب الالكتروني؟",
        "https://tdb.tanta.edu.eg/ebooks/",
    ),
    (
        "رقم دكتور ثروت الغلبان؟",
        "01227315841",
    ),
    (
        "ايميل دكتور ثروت الغلبان؟",
        " tharout.elghalban@art.tanta.edu.eg",
    ),
    (
        "ماهي وظيفة الدكتور ثروت الغلبان ؟",
        "استاذ جامعي",
    ),
    (
        "دكتور ثروت الغلبان؟",
        "الدكتوراه (مكتبات) - (جامعة طنطا) - عام 2000 - الماجستير (مكتبات) - (جامعة طنطا) - عام 1995 - الليسانس (مكتبات) - (جامعة طنطا) - بتقدير جيد جدًا - عام 1990 - أستاذ بقرار بتاريخ 01/10/2012 اعتبارًا من 01/10/2012 - أستاذ مساعد بقرار بتاريخ 06/07/2008 اعتبارًا من 30/06/2008 - مدرس بقرار بتاريخ 02/05/2000 اعتبارًا من 29/04/2000 - مدرس مساعد بقرار بتاريخ 21/01/1996 اعتبارًا من 21/01/1996 - معيد بقرار بتاريخ 07/08/1990 اعتبارًا من 07/08/1990 - رئيس قسم بتاريخ 13/08/2013 - رئيس قسم بتاريخ 21/07/2008",
    ),
    (
        "ايميل دكتور احمد العربي؟",
        " ahmed.ebada@art.tanta.edu.eg ",
    ),
    (
        "ماهي وظيفة الدكتوراحمد العربي؟",
        "استاذ جامعي",
    ),
    (
        "دكتور احمد العربي؟",
        "الدكتوراه (مكتبات) - (جامعة طنطا) - عام 2001; الماجستير (مكتبات) - (جامعة طنطا) - عام 1999; الليسانس (مكتبات) - (جامعة طنطا) - بتقدير امتياز - عام 1992; استاذ بقرار بتاريخ 02/09/2015 اعتبارا من 31/08/2015; استاذ مساعد بقرار بتاريخ 04/04/2010 اعتبارا من 30/03/2010; مدرس بقرار بتاريخ 14/02/2002 اعتبارا من 29/01/2002; مدرس مساعد بقرار بتاريخ 24/02/1999 اعتبارا من 24/02/1999; معيد بقرار بتاريخ 30/12/1992 اعتبارا من 02/01/1993; معيد بقرار بتاريخ 30/12/1992 اعتبارا من 30/12/1992; وكيل الكلية لشئون خدمة المجتمع وتنمية البيئة بتاريخ 01/06/2016; رئيس قسم بتاريخ 16/09/2015",
    ),
    (
        "ايميل دكتور بدوية البسيوني؟",
        "badawia.elbasuni@art.tanta.edu.eg",
    ),
    (
        "ماهي وظيفة الدكتور بدوية البسيوني ؟",
        "استاذ جامعي",
    ),
    (
        "دكتور بدوية البسيوني؟",
        "الدكتوراه (مكتبات) - (جامعة طنطا) - عام 2005; الماجستير (مكتبات) - (جامعة طنطا) - عام 2002; الليسانس (مكتبات) - (جامعة طنطا) - بتقدير جيد جدا مع مرتبة الشرف - عام 1996; استاذ بقرار بتاريخ 06/12/2015 اعتبارا من 30/11/2015; استاذ مساعد بقرار بتاريخ 31/07/2010 اعتبارا من 27/07/2010; مدرس بقرار بتاريخ 03/04/2005 اعتبارا من 29/03/2005; مدرس مساعد بقرار بتاريخ 04/03/2002 اعتبارا من 04/03/2002; معيد بقرار بتاريخ 16/02/1997 اعتبارا من 18/02/1997; معيد بقرار بتاريخ 16/02/1997 اعتبارا من 16/02/1997; قائم باعمال رئاسة القسم بتاريخ 27/07/2016",
    ),
    (
        "رقم دكتور نادية سعد؟",
        "01231231231",
    ),
    ("ايميل دكتور نادية سعد؟", " nadia.ali@art.tanta.edu.eg"),
    (
        "ماهي وظيفة الدكتور نادية سعد ",
        "استاذ مساعد",
    ),
    (
        "دكتور نادية سعد ؟",
        "الدكتوراه (مكتبات) - (جامعة طنطا) - عام 2005; الماجستير (مكتبات) - (جامعة طنطا) - عام 2002; الليسانس (مكتبات) - (جامعة طنطا) - بتقدير جيد جدا - عام 1996; استاذ مساعد بقرار بتاريخ 01/04/2019 اعتبارا من 30/03/2019; مدرس بقرار بتاريخ 02/10/2005 اعتبارا من 27/09/2005; مدرس مساعد بقرار بتاريخ 02/12/2002 اعتبارا من 02/12/2002; معيد بقرار بتاريخ 25/07/1996 اعتبارا من 25/07/1996; معيد بقرار بتاريخ 30/12/1992 اعتبارا من 02/01/1993",
    ),
    (
        "رقم دكتور هبه دنيا؟",
        "01004485934",
    ),
    (
        "ايميل دكتور هبه دنيا؟",
        " heba.basuni@art.tanta.edu.eg",
    ),
    (
        "ماهي وظيفة دكتور هبه دنيا؟",
        "استاذ مساعد",
    ),
    (
        "دكتور هبه دنيا؟",
        "الدكتوراه (مكتبات) - (جامعة طنطا) - عام 2008; الماجستير (مكتبات) - (جامعة طنطا) - عام 2004; الليسانس (مكتبات) - (جامعة طنطا) - بتقدير جيد جدا مع مرتبة الشرف - عام 1998; استاذ مساعد بقرار بتاريخ 06/01/2021 اعتبارا من 30/12/2020; مدرس بقرار بتاريخ 06/08/2008 اعتبارا من 31/07/2008; مدرس مساعد بقرار بتاريخ 31/10/2004 اعتبارا من 31/10/2004; معيد بقرار بتاريخ 26/11/2000 اعتبارا من 10/12/2000; معيد بقرار بتاريخ 26/11/2000 اعتبارا من 26/11/2000",
    ),
    (
        "رقم دكتور هبه المتبولي؟",
        "01065129397",
    ),
    ("ايميل دكتور هبه المتبولي؟", " heba.elmatboley@art.tanta.edu.eg"),
    (
        "ماهي وظيفة الدكتور هبه المتبولي؟",
        "استاذ مساعد",
    ),
    (
        "دكتور هبه المتبولي؟",
        "الدكتوراه (مكتبات) - (جامعة طنطا) - عام 2015; الماجستير (مكتبات) - (جامعة طنطا) - عام 2011; الليسانس (مكتبات) - (جامعة طنطا) - بتقدير جيد جدا مع مرتبة الشرف - عام 2005; استاذ مساعد بقرار بتاريخ 07/05/2022 اعتبارا من 27/04/2022; مدرس بقرار بتاريخ 08/12/2015 اعتبارا من 31/08/2015; مدرس مساعد بقرار بتاريخ 08/08/2011 اعتبارا من 08/08/2011; معيد بقرار بتاريخ 18/07/2006 اعتبارا من 12/08/2006; معيد بقرار بتاريخ 18/07/2006 اعتبارا من 18/07/2006",
    ),
    (
        "رقم دكتور احمد شاهين؟",
        "01228990897",
    ),
    (
        "ايميل دكتور احمد شاهين؟",
        "ahmed.shahin@art.tanta.edu.eg",
    ),
    (
        "دكتور احمد شاهين؟",
        "الدكتوراه (مكتبات) - (جامعة طنطا) - عام 2006، الماجستير (مكتبات) - (جامعة طنطا) - عام 2003، الليسانس (مكتبات) - (جامعة طنطا) - بتقدير جيد جدا - عام 1999، أستاذ مساعد بقرار بتاريخ 03/08/2024 اعتبارا من 30/07/2024، مدرس بقرار بتاريخ 02/10/2006 اعتبارا من 19/09/2006، مدرس مساعد بقرار بتاريخ 16/08/2003 اعتبارا من 16/08/2003، معيد بقرار بتاريخ 26/11/2000 اعتبارا من 28/11/2000، معيد بقرار بتاريخ 26/11/2000 اعتبارا من 26/11/2000.",
    ),
    (
        "رقم دكتور عواطف المكاوي؟",
        "01114765959",
    ),
    (
        "ايميل دكتور عواطف المكاوي؟",
        "awatef.elmakawi@art.tanta.edu.eg",
    ),
    (
        "دكتور عواطف المكاوي؟",
        "الدكتوراه (مكتبات) - (جامعة طنطا) - عام 2001، الماجستير (مكتبات) - (جامعة طنطا) - عام 1997، الليسانس (المكتبات والمعلومات) - (جامعة طنطا) - بتقدير جيد جدا - عام 1991، مدرس بقرار بتاريخ 09/07/2001 اعتبارا من 30/06/2001، مدرس مساعد بقرار بتاريخ 20/03/1997 اعتبارا من 20/03/1997، معيد بقرار بتاريخ 10/02/1992 اعتبارا من 13/02/1992، معيد بقرار بتاريخ 10/02/1992 اعتبارا من 10/02/1992.",
    ),
    (
        "رقم دكتور ميرفت فؤاد؟",
        "01002400992",
    ),
    (
        "ايميل دكتور ميرفت فؤاد؟",
        "mervat.gergues@art.tanta.edu.eg",
    ),
    (
        "دكتور ميرفت فؤاد؟",
        "الدكتوراه (مكتبات) - (جامعة طنطا) - عام 2011، الماجستير (مكتبات) - (جامعة طنطا) - عام 2005، الليسانس (مكتبات) - (جامعة طنطا) - بتقدير جيد جدا - عام 1998، مدرس بقرار بتاريخ 14/12/2011 اعتبارا من 08/12/2011، مدرس مساعد بقرار بتاريخ 22/08/2005 اعتبارا من 22/08/2005، معيد بقرار بتاريخ 26/11/2000 اعتبارا من 03/12/2000، معيد بقرار بتاريخ 26/11/2000 اعتبارا من 26/11/2000.",
    ),
    (
        "رقم دكتور هبه النموري؟",
        "01008318280",
    ),
    (
        "ايميل دكتور هبه النموري؟",
        "heba.mohmed3@art.tanta.edu.eg",
    ),
    (
        "دكتور هبه النموري؟",
        "الماجستير (مكتبات) - (جامعة طنطا) - عام 2006، الليسانس (مكتبات) - (جامعة طنطا) - بتقدير جيد جدا مع مرتبة الشرف - عام 2001، مدرس بقرار بتاريخ 18/07/2012 اعتبارا من 11/07/2012، مدرس مساعد بقرار بتاريخ 08/04/2006 اعتبارا من 08/04/2006، معيد بقرار بتاريخ 10/07/2002 اعتبارا من 15/07/2002، معيد بقرار بتاريخ 10/07/2002 اعتبارا من 10/07/2002.",
    ),
    (
        "رقم دكتور رضوى النوساني؟",
        "01226843062",
    ),
    (
        "ايميل دكتور رضوى النوساني؟",
        "Dr Radwa Elnawasany@art.tanta,edu.eg",
    ),
    (
        "دكتور رضوى النوساني؟",
        "الماجستير (مكتبات) - (جامعة طنطا) - عام 2006، الليسانس (مكتبات) - (جامعة طنطا) - بتقدير جيد جدا مع مرتبة الشرف - عام 2000، مدرس بقرار بتاريخ 03/07/2013 اعتبارا من 27/06/2013، مدرس مساعد بقرار بتاريخ 08/04/2006 اعتبارا من 08/04/2006، معيد بقرار بتاريخ 30/06/2001 اعتبارا من 02/07/2001، معيد بقرار بتاريخ 30/06/2001 اعتبارا من 30/06/2001.",
    ),
    (
        "ايميل دكتور عبدالله فراج؟",
        "abdallah.abdelmageed@art.tanta.edu.eg",
    ),
    (
        "دكتور عبدالله فراج؟",
        "الماجستير (مكتبات) - (جامعة طنطا) - عام 2004، الليسانس (المكتبات والمعلومات) - (جامعة طنطا) - بتقدير جيد جدا - عام 1994، مدرس بقرار بتاريخ 09/10/2014 اعتبارا من 30/09/2014، مدرس مساعد بقرار بتاريخ 31/10/2004 اعتبارا من 31/10/2004، معيد بقرار بتاريخ 25/12/1994 اعتبارا من 25/12/1994، معيد بقرار بتاريخ 25/12/1994 اعتبارا من 25/12/1994.",
    ),
    (
        "ايميل دكتور غاده ابو زويد؟",
        "ghada ezat@art.tanta.edu.eg",
    ),
    (
        "دكتور غادة ابو زويد",
        "الليسانس (المكتبات والمعلومات) - (جامعة طنطا) - بتقدير جيد جدا - عام 2008، مدرس بقرار بتاريخ 02/02/2016 اعتبارا من 30/01/2016، مدرس مساعد بقرار بتاريخ 23/03/2013 اعتبارا من 23/03/2013، معيد بقرار بتاريخ 29/06/2009 اعتبارا من 26/08/2009، معيد بقرار بتاريخ 29/06/2009 اعتبارا من 29/06/2009.",
    ),
    (
        "رقم دكتور منى مصطفى؟",
        "01229746451",
    ),
    (
        "ايميل دكتور منى مصطفى؟",
        "dr.mona.mostafa90@art.tanta.edu.eg",
    ),
    (
        "دكتور منى مصطفى؟",
        "الدكتوراه (الوثائق والمكتبات) - (جامعة طنطا) - عام 2018، الماجستير (الوثائق والمكتبات) - (جامعة طنطا) - عام 2012، الليسانس (مكتبات) - (جامعة طنطا) - بتقدير جيد جدا مع مرتبة الشرف - عام 2001، مدرس بقرار بتاريخ 02/06/2018 اعتبارا من 30/05/2018، مدرس مساعد بقرار بتاريخ 24/07/2012 اعتبارا من 24/07/2012، معيد بقرار بتاريخ 20/10/2003 اعتبارا من 23/10/2003، معيد بقرار بتاريخ 15/10/2003 اعتبارا من 15/10/2003.",
    ),
    (
        "رقم دكتور منى فاروق؟",
        "01231231231",
    ),
    (
        "ايميل دكتور منى فاروق؟",
        "mona.shahwan@art.tanta.edu.eg",
    ),
    (
        "دكتور منى فاروق؟",
        "الماجستير (مكتبات) - (جامعة طنطا) - عام 2008، بكالوريوس (إعلام) - (جامعة القاهرة) - بتقدير جيد جدا - عام 1995، مدرس بقرار بتاريخ 01/08/2018 اعتبارا من 30/07/2018، مدرس مساعد بقرار بتاريخ 21/04/2008 اعتبارا من 21/04/2008، معيد بقرار بتاريخ 06/09/1987 اعتبارا من 15/09/1987، معيد بقرار بتاريخ 06/09/1987 اعتبارا من 06/09/1987.",
    ),
    (
        "رقم دكتور هند السمدوني؟",
        "01231231231",
    ),
    (
        "ايميل دكتور هند السمدوني؟",
        "hend.elsamadoni@art.tanta.edu.eg",
    ),
    (
        "دكتور هند السمدوني؟",
        "الوظيفة الحالية: مدرس، تاريخ الميلاد: Sep 28, 1985،  العنوان: آخر ش سعيد - برج الزراعيين - الدور الخامس - شقة 31، الليسانس (مكتبات) - (جامعة طنطا) - بتقدير جيد جدا - عام 2006، مدرس بقرار بتاريخ 05/01/2019 اعتبارا من 30/12/2018، مدرس مساعد بقرار بتاريخ 05/08/2013 اعتبارا من 05/08/2013، معيد بقرار بتاريخ 01/02/2007 اعتبارا من 12/02/2007، معيد بقرار بتاريخ 01/02/2007 اعتبارا من 01/02/2007.",
    ),
    (
        "دكتور يمنى محمد؟",
        "معيد - الليسانس (علم المكتبات والمعلومات) - (جامعة طنطا) - بتقدير ممتاز مع مرتبة الشرف - عام 2023، معيد بقرار بتاريخ 10/07/2024 اعتبارا من 10/07/2024 ",
    ),
    (
        " مقررات سنه اولى ترم اول؟",
        "مقررات الفرقه الاولى الترم الاول هي : المدخل الى علم المعلومات  -  مرافق المعلومات  - الانترنت في المكتبات  - مصادر المعلومات الرقمية  - اخلاقيات المعلومات  - دراسات المستفيدين ",
    ),
    (
        " مقررات سنه اولى ترم تاني؟",
        "مقررات الفرقه الاولى ترم ثاني هي : مقدمة في تقنية المعلومات  - خدمات المعلومات الرقمية  - تجهيز ومعالجة المعلومات  - المصادر المرجعية الرقمية  - المكتبات و المستودعات الرقمية  - شبكات المعلومات",
    ),
    (
        " ايه هي مقررات سنه تانيه الترم الاول؟",
        "مقررات الفرقه الثانية ترم اول : ادارة المكتبات ومراكز المعلومات  - الاحصاء الببليوجرافي  - الفهرسة الالية  - النشر الالكتروني  - نصوص متخصصه باللغه الانجليزية  - قواعد البيانات الببليوجرافية",
    ),
    (
        "ايه هي مقررات سنه تانيه الترم الثاني؟",
        "مقررات الفرقه الثانيه ترم ثاني : التصنيف في البيئة الرقمية  - النظم الالية المتكامله  - الكلمات المفتاحية  - تطبيقات الحوسبه السحابيه في المكتبات  - امن المعلومات  - هناك اثنين من المواد الاختياريه وهي : البرامج التعاونية في مؤسسات المعلومات  - الوعي المعلوماتي",
    ),
    (
        "ايه هي مقررات سنه تالته الترم الاول؟",
        "مقررات الفرقه الثالثه ترم اول : الميتاداتا  - نظم التكشيف الالية  - التطبيقات الذكية في المكتبات  - رقمنة مصادر المعلومات  - برمجة الويب  هناك اثنين من المواد الاحتيارية وهي : المعلوماتية الصحية  - نظم المعلومات المتخصصة",
    ),
    (
        "ايه هي مقررات سنه تالته الترم الثاني؟",
        "مقررات الفرقه الثالثه ترم ثاني : الترتيب و الوصف الارشيفي  - تطبيقات الويب الدلالي في المكتبات  - سياسات المعلومات  - تطبيقات النظم الخبيرة في المكتبات  - اللغه الاجنبية الاولى  هناك اثنين من المقررات الاختيايرة وهي : تسويق خدمات المعلومات  - معمارية المعلومات",
    ),
    (
        "ايه هي مقررات سنه رابعه الترم الاول",
        "مقررات الفرقه الرابعة ترم اول : بناء و ادارة مواقع المكتبات  - الارشفة الالكترونية  - قياسات الويب  - علم المكتبات المقارن  هناك اثنين من المواد الاختيارية وهي : ادارة المجموعات الرقمية  - ادارة مشروعات تقنية المعلومات  هناك اثنين ايضا من المواد الاختيارية وهي : الارشيفات المتخصصة  - التراخيص الرقمية لمصادر المعلومات ",
    ),
    (
        "ايه هي مقررات سنه رابعه ترم ثاني؟",
        "الجودة الشامله في المكتبات  - مشروع التخرج  -  التدريب الميداني  - هناك اثنين من المواد الاختيارية وهي : عمارة المكتبات في الاثار المصرية  - اثار مصر عبر العصور",
    ),
    (
        "مادة المدخل الى علم المعلومات؟",
        "أهداف المقرر: مساعدة الطالب في التعرف على علم المكتبات والمعلومات وعلاقاته بالعلوم الأخرى، إكساب الطالب مهارة التعرف على أوعية المعلومات وأشكالها وتنظيمها، مساعدة الطالب في التعرف على أنواع المكتبات وخدماتها والمؤسسات المهنية في المجال. المهارات المكتسبة : اكتساب مهارات الحاسب الآلي في المكتبات ومراكز المعلومات، اكتساب مهارات الاتصال مع الآخرين في المؤسسات المهنية في تخصص المكتبات، القدرة على التعبير عن الأفكار بوضوح في مهنة المكتبات ويحتوي المقرر على عدد وحدات دراسية : 3 وحدات نظري - 3 وحدات عملي وتوزيع درجات المقرر هي : 100 درجة 40 درجة تكليفات و نصفي 60 درجة تحريري نهائي",
    ),
    (
        "مادة مرافق المعلومات؟",
        "أهداف المقرر: تعريف الطلاب بأهداف ووظائف مرافق المعلومات المختلفة، العمليات الفنية والخدمات، وأساليب تقديم الخدمات المختلفة في مرافق المعلومات. المهارات المكتسبة: استخدام الحاسب الآلي وبرامجه في التعامل مع مصادر المعلومات، استخدام التقنيات الحديثة في الاتصال والتواصل، واكتساب مهارة العمل التعاوني في بيئة العمل الجماعي يحتوي المقرر على عدد وحدات دراسية 3 وحدات نظري  - 3 وحدات عملي  وتوزيع درجات المقرر هي : 100 درجة 40 درجة تكليفات ونصفي 60 تحريري نهائي",
    ),
    (
        "مادة الانترنت في المكتبات؟",
        " أهداف المقرر: إكساب الطلاب المعرفة في مجالات تعريف الإنترنت وكيفية عملها، ومقوماتها. شرح أجيال الويب، وتطبيقات الويب 2.0 في المكتبات. تطبيق خدمات الإنترنت في إدارة المقتنيات، وتنظيم وخدمات المعلومات. تقييم مواقع الإنترنت بكافة أنواعها. المهارات العامة: استخدام الحاسبات الآلية والإنترنت والشبكات الإلكترونية وتكنولوجيا المعلومات. مهارات التحليل والاتصال. مهارات التعبير عن الأفكار ويحتوي المقرر على عدد وحدات دراسية : 2 نظري - 2 عملي و توزيع درجات المقرر هي : 100 درجة 20درجة تكليفي ونصفي - 20درجة شفوي و عملي 60 درجة تحرير نهائي",
    ),
    (
        "مادة مصادر المعلومات الرقمية؟",
        "أهداف المقرر: التعريف بمفهوم مصادر المعلومات الإلكترونية ومراحل تطورها، تعريف الطلاب بخصائص وأنواع وأشكال مصادر المعلومات الإلكترونية، إكساب الطلاب مهارات استخدام مصادر المعلومات الإلكترونية. المهارات المكتسبة: استخدام الحاسب الآلي وبرامجه في التعامل مع مصادر المعلومات، استخدام التقنيات الحديثة في الاتصال والتواصل، مهارة العمل التعاوني في بيئة العمل الجماعي ويحتوي المقرر على عدد وحدات دراسية : 2 نظري - 2 عملي و توزيع درجات المقرر هي :100 درجة 20 درجة تكليفات ونصفي 20 درجة شفوي وعملي 60 درجة تحريري ونهائي ",
    ),
    (
        "مادة مقدمة في تقنية المعلومات؟",
        "أهداف المقرر: يعرف الطالب أهمية الوعي المعلوماتي للمجتمع. يحدد الطالب تأثير الثورة التقنية والحاسوب والشبكات على معالجة المعلومات وخدماتها. يستخدم الطالب سياسات واستراتيجيات البحث عن المعلومات. يشرح الطالب أدوات البحث في شبكة الإنترنت. يقيم مصادر المعلومات المتاحة على الإنترنت. المهارات المكتسبة: يستخدم الحاسب الآلي وبرامجه في التعامل مع مصادر المعلومات. يستخدم التقنيات الحديثة في الاتصال والتواصل. يكتسب مهارة العمل التعاوني في بيئة العمل الجماعي ويحتوي المقرر على عدد وحدات دراسية : 2 نظري - 2 عملي وتوزيع درجات المقرر هي : 100 درجة 20درجة تكليفات ونصفي 20 درجة شفوي وعملي 60درجة تحريري نهائي ",
    ),
    (
        "مادة خدمات المعلومات الرقمية؟",
        "أهداف المقرر: * إمداد الطلاب بالمعرفة حول أنواع خدمات المعلومات الرقمية. * تزويد الطلاب بالمعرفة حول تنظيم وإدارة خدمات المعلومات الرقمية. * إكساب الطلاب بالمعرفة حول تقييم وتطوير خدمات المعلومات الرقمية. المهارات المكتسبة: * إكساب الطلاب مهارات العمل الجماعي في مهنة المكتبات. * إكساب الطلاب مهارات تكنولوجيا المعلومات والاتصال ويحتوي المقرر على عدد وحدات دراسية : 2 نظري - 2 2عملي و توزيع درجات المقرر هي : 100 درجة 20درجة تكليفات ونصفي 20 درجة شفوي وعملي 60درجة تحريري نهائي",
    ),
    (
        "مادة تجهيز ومعالجة المعلومات؟",
        "أهداف المقرر: * يعرف تجهيز ومعالجة المعلومات. * يشرح أهمية تجهيز ومعالجة المعلومات. * يكتسب مهارة تنظيم المعلومات على الإنترنت (التصنيف الاجتماعي الفولكسونومي). * يمارس تنظيم المعلومات على الإنترنت (الفهرسة المجتمعية). المهارات المكتسبة: * يستخدم الحاسب الآلي وبرامجه في التعامل مع مصادر المعلومات. * يستخدم التقنيات الحديثة في الاتصال والتواصل. * يكتسب مهارة العمل التعاوني في بيئة العمل الجماعي و يحتوي المقرر على عدد وحدات دراسية : 3 نظري - 3 عملي و توزيع درجات المقرر هي : 100 درجة 40 درجة تكليفات ونصفي 60 درجة تحريري نهائي",
    ),
    (
        "مادة المصادر المرجعية الرقمية؟",
        "أهداف المقرر: تزويد الطالب بالمعرفة النظرية والمهارات العلمية حول تعريف وأنواع المصادر المرجعية الرقمية، وتنظيم وإدارة الخدمة المرجعية، وأشكال وأنواع المصادر المرجعية الرقمية والخدمة المرجعية الرقمية. المهارات المكتسبة: إكساب البحث عن المعلومات في المكتبات ومؤسسات المعلومات، التعبير عن الأفكار في تخصص المكتبات والمعلومات، العمل مع فريق داخل المكتبات ومؤسسات المعلومات و يحتوي المقرر على عدد وحدات دراسية 2 نظري - 2 عملي و توزيع درجات المادة هي : 100 درجة 20درجة تكليفات ونصفي 20 درجة شفوي وعملي 60درجة تحريري نهائي",
    ),
    (
        "مادة ادارة المكتبات و مراكز المعلومات ",
        "أهداف المقرر: تزويد الطلاب بالمعرفة في مبادئ الإدارة العلمية ووظائفها وتطبيقاتها في المكتبات. إكساب الطلاب المعرفة بالتمويل والميزانية العاملون والموقع والمبنى وتجهيزاته. شرح سياسات وتشريعات المكتبات. المهارات المكتسبة: اكتساب القدرة على التعامل في جماعة في تخصص المكتبات. القدرة على استخدام المنهج العلمي في التفكير وحل المشكلات في المكتبات. اكتساب مهارات الاتصال في مهنة المكتبات والمعلومات. القدرة على التعبير عن الأفكار بوضوح في المكتبات و يحتوي المقرر على عدد وحدات دراسية 3 نظري 3 علمي و توزيع درجات المقرر :100 درجة 40درجة تكليفات ونصفي 60 تحريري نهائي",
    ),
    (
        "مادة الاحصاء الببليوجرافي؟",
        "أهداف المقرر: يتعرف الطالب على قوانين القياسات الببليومترية. يتعرف الطالب على أهمية ووظائف الإحصاء. يشرح الطالب أساليب جمع البيانات. يستخدم الطالب أدوات جمع البيانات. يحلل الطالب مقاييس النزعة المركزية. يشرح الطالب مقاييس التشتت. يستخدم الطالب الحاسب الآلي في العمليات الإحصائية. المهارات المكتسبة: مهارات الاستعداد لسوق العمل في تخصص المكتبات. مهارات العمل الجماعي في المكتبات ومراكز المعلومات. مهارات التعامل مع الوسائل التكنولوجية الحديثة داخل المكتبات ومراكز المعلومات و يحتوي المقرر على عدد وحدات دراسية 2 نظري - 2 عملي و توزيع درجات المقرر هي : 100 درجة 20 درجة تكليفات ونصفي 20 درجة شفوي وعملي و 60 درجة تحريري نهائي ",
    ),
    (
        "مادة الفهرسة الالية؟",
        "أهداف المقرر: اكتساب مهارة الفهرسة الآلية باستخدام شكل مارك 21 للبيانات الببليوجرافية والإطار الببليوجرافي  المهارات المكتسبة: مهارات العمل الجماعي في فريق في مؤسسات المعلومات. مهارات استخدام تكنولوجيا المعلومات والحاسبات في المكتبات و يحتوي المقرر على عدد وحدات دراسية 2 نظي - 2 عملي و توزيع درجات المقرر هي :100 درجة 20 درجة تكليفات ونصفي 20 درجة شفوي وعملي و 60 درجة تحريري نهائي ",
    ),
    (
        "مادة النشر الالكتروني؟",
        "أهداف المقرر: الإلمام بثقافة النشر الإلكتروني ومجالات تطبيقه بصفة عامة وفي بيئة عمل مؤسسات المعلومات خاصة. المهارات المكتسبة: مهارات العمل الجماعي في فريق في مؤسسات المعلومات. مهارات استخدام تكنولوجيا المعلومات والحاسبات في المكتبات ومراكز المعلومات و يحتوي المقرر على عدد وحدات دراسية 2 نظري - 2 عملي و توزيع درجات المقرر هي : 100 درجة 20 درجة تكليفات ونصفي 20 درجة شفوي وعملي و 60 درجة تحريري نهائي ",
    ),
    (
        "مادة التنصيف في البيئة الرقمية؟",
        "أهداف المقرر: * يعرف الطالب نظم خطط التصنيف وطريقة بناءها واستخدامها. * يقارن الطالب بين نظم التصنيف الحصرية وشبه الحصرية والتحليلية التركيبية. * يصنف الطالب مصادر المعلومات اعتماداً على الأدوات المتاحة بالإنترنت. المهارات المكتسبة: * يستخدم الوسائل التكنولوجية الحديثة. * يتواصل مع الآخرين والتعبير عن نفسه في المواقف الحياتية المختلفة. * يقدر على العمل في فريق واحد ويحتوي المقرر على عدد وحدات دراسية 2 نظري - 2 عملي و توزيع درجات المقرر هي :100 درجة 20 درجة تكليفات ونصفي 20 درجة شفوي وعملي و 60 درجة تحريري نهائي ",
    ),
    (
        "مادة النظم الالية المتكاملة",
        "أهداف المقرر: * التعرف على مكونات النظم المتكاملة، ومعايير ومواصفات النظم الآلية المتكاملة للمكتبات، ودراسة نماذج من النظم المتكاملة المتاحة مجاناً وعلى أساس تجاري. * تقييم النظم المتكاملة. * اكتساب مهارات استخدام النظم المتكاملة عملياً. المهارات المكتسبة: * إكساب القدرة على استخدام تكنولوجيا المعلومات في مجال المكتبات والمعلومات. * إعدادهم لتكوين فريق للعمل في تخصص المكتبات والمعلومات ويحتوي المقرر على عدد وحدات دراسية 2 نظري - 2 عملي و توزيع درجات المقرر هي :100 درجة 20 درجة تكليفات ونصفي 20 درجة شفوي وعملي و 60 درجة تحريري نهائي ",
    ),
    (
        "مادة الكلمات المفتاحية؟",
        "أهداف المقرر: إمداد الطالب بمفاهيم الفهرسة الموضوعية والتحليل الموضوعي، مساعدة الطالب على فهم مبادئ التحليل الموضوعي وقواعد اختيار الكلمات المفتاحية وأشكالها، إكساب الطالب القدرة على استخدام برمجيات الكلمات المفتاحية. المهارات المكتسبة: إكساب الطلاب مهارة العمل في فريق، إكساب الطلاب مهارة استخدام الحاسب الآلي في تخصص المكتبات، إكساب الطلاب مهارة الاتصال في مؤسسات المكتبات ومراكز المعلومات و يحتوي المقرر على عدد وحدات دراسية 2 نظري - 2 عملي و توزيع درجات المقرر هي : 100 درجة 20 درجة تكليفات ونصفي 20 درجة شفوي وعملي و 60 درجة تحريري نهائي ",
    ),
    (
        "مادةاخلاقيات المعلومات؟",
        "أهداف المقرر: يُعرف المفاهيم الأساسية لأخلاقيات المعلومات، يستنبط السياسات المنظمة لاستخدام المعلومات، يشرح ماهية خصوصية المستفيدين، يشرح الأبعاد القانونية لخدمات المعلومات المقدمة للمستفيدين. المهارات المكتسبة: يستخدم الحاسب الآلي وبرامجه في التعامل مع مصادر المعلومات، يستخدم التقنيات الحديثة في الاتصال والتواصل، يكتسب مهارة العمل التعاوني في بيئة العمل الجماعي و يحتوي المقرر على عدد وحدات دراسية 3 نظري - 3 عملي و توزيع درجات المقرر هي : 100 درجة 20 درجة تكليفات ونصفي 20 درجة شفوي وعملي و 60 درجة تحريري نهائي ",
    ),
    (
        "مادةالبرامج التعاونية في مؤسسات المعلومات؟",
        "أهداف المقرر: التعريف بمفهوم البرامج التعاونية وأهميتها وصعوبات تطبيقها بمؤسسات المعلومات، تعريف الطلاب بأنواع ومستويات البرامج التعاونية في مؤسسات المعلومات، تعريف الطلاب بمجالات التعاون بين مؤسسات المعلومات. المهارات العامة: يستخدم الحاسب الآلي وبرامجه في التعامل مع البرامج التعاونية، يستخدم التقنيات الحديثة في الاتصال والتواصل، يكتسب مهارة العمل التعاوني في بيئة العمل الجماعي و يحتوي المقرر على عدد وحدات دراسية 3 نظري و توزيع درجات المقرر هي : 100 درجة 40 درجة تكليفات و نصفي 60 درجة تحريري نهائي ",
    ),
    (
        "مادة الوعي المعلوماتي؟",
        "أهداف المقرر: اكتساب المهارات المعلوماتية والوصول إلى المعلومات واستخدامها بطريقة فاعلة. المهارات المكتسبة: يستخدم الحاسب الآلي وبرامجه في التعامل مع مصادر المعلومات، يستخدم التقنيات الحديثة في الاتصال والتواصل، يكتسب مهارة العمل التعاوني في بيئة العمل الجماعي ويحتوي المقرر على عدد وحدات دراسية 3 نظري - 3 عملي و توزيع درجات المقرر هي : 100 درجة 40 درجة تكليفات ونصفي 60 درجة تحريري نهائي",
    ),
    (
        "مادة نظم التكشيف الالية؟",
        "أهداف المقرر: أهداف معرفية (المعلومات والمفاهيم): 11- يتعرف على مفهوم نظم التكشيف الآلي ودوافع الاستخدام، 21- يعرف أساليب وتقنيات التكشيف الآلي، 31- يتعرف على برامج التكثيف الآلي، 41- يتعرف على أسس ومعايير اختيار برامج التكشيف الآلي. أهداف مهارات ذهنية: ب 1 - يحدد أساليب وتقنيات التكشيف الآلي، ب 2 - يقارن بين برامج التكشيف الآلي. المهارات المكتسبة: دا 1 - يستخدم الحاسب الآلي في التعامل مع برامج التكشيف، دا 2 - يستخدم التقنيات الحديثة في الاتصال والتواصل، 35- يكتسب مهارة العمل التعاوني في بيئة العمل الجماعي و يحتوي المقرر على عدد وحدات دراسية 2 نظري - 2 عملي و توزيع درجات المقرر هي : 100 درجة 20 درجة تكليفات ونصفي 20 درجة شفوي وعملي و 60 درجة تحريري نهائي ",
    ),
    (
        "المكتبات و المستودعات الرقمية؟",
        "أهداف المقرر: أهداف معرفية (المعلومات والمفاهيم): 11- يُعرف ماهية المكتبات الرقمية، 21- يوضح مفهوم المكتبات الرقمية الدلالية، 31- يعدد احتياجات المكتبة الرقمية. أهداف مهارات ذهنية: ب 1 - يحلل المكونات الأساسية للمكتبات الرقمية، ب 2 - يقارن بين المكتبات الرقمية والمستودعات الرقمية. المهارات المكتسبة :دا 1 - يستخدم الحاسب الآلي في التعامل مع برامج التكشيف، دا 2 - يستخدم التقنيات الحديثة في الاتصال والتواصل، 35- يكتسب مهارة العمل التعاوني في بيئة العمل الجماعي و يحتوي المقرر على عدد وحدات دراسية 2 نظري - 2 عملي و توزيعدرجات المقرر هي :100 درجة 20 درجة تكليفات ونصفي 20 درجة شفوي وعملي و 60 درجة تحريري نهائي ",
    ),
    (
        "مادة رقمنة مصادر المعلومات؟",
        "أهداف المقرر: أهداف معرفية (المعلومات والمفاهيم): 11- يتعرف على مفهوم رقمنة مصادر المعلومات ومبرراتها، 21- يعرف المتطلبات الأساسية المشروعات الرقمنة ومعوقاتها، 31- يتعرف على المراحل الإجرائية لعملية الرقمنة، 41- يتعرف على التكنولوجيات والأجهزة والبرمجيات المستخدمة في عملية الرقمنة، اهـ - يتعرف على أساليب تسويق مخرجات مشروعات الرقمنة. أهداف مهارات ذهنية: ب 1 - يحدد مبررات الاتجاه نحو رقمنة مصادر المعلومات، ب 2 - يقيم التجارب العربية المبذولة لرقمنة مصادر المعلومات. المهارات العامة: دا - يستخدم الحاسب الآلي وبرامجه في التعامل مع رقمنة مصادر المعلومات و يحتوي المقرر على عدد وحدات دراسية 3 عملي و توزيع درجات المقرر هي : 100 درجة 20 درجة تكليفات ونصفي 20 درجة شفوي وعملي و 60 درجة تحريري نهائي ",
    ),
    (
        "مادة الميتاداتا؟",
        "أهداف المقرر: التعريف بمفهوم الميتاداتا وأهميتها، تعريف الطلاب بآليات إنشاء الميتاداتا، إكساب الطلاب مهارات التعامل مع برمجيات الميتاداتا. المهارات العامة: استخدام الحاسب الآلي في التعامل مع برامج التكثيف، استخدام التقنيات الحديثة في الاتصال والتواصل، اكتساب مهارة العمل التعاوني في بيئة العمل الجماعي ويحتوي المقرر على عدد وحدات دراسية 2 نظري - 2 عملي و توزيع درجات المقرر هي : 100 درجة 20 درجة تكليفات ونصفي 20 درجة شفوي وعملي و 60 درجة تحريري نهائي ",
    ),
    (
        "مادة تسويق خدمات المعلومات؟",
        "أهداف المقرر: التعريف بمفهوم تسويق خدمات المعلومات، تعريف الطلاب بخطوات تصميم الاستراتيجية التسويقية للخدمات بالتطبيق على خدمات المعلومات، تمكين الطلاب من تسويق خدمات المعلومات إلكترونياً. المهارات العامة: استخدام الحاسب الآلي في تصميم المواقع وفقاً للمعمارية، استخدام التقنيات الحديثة في الاتصال والتواصل، اكتساب مهارة العمل التعاوني في بيئة العمل الجماعي و يحتوي المقرر على عدد وحدات دراسية 2 نظري - 2 عملي و توزيع درجات المقرر هي : 100 درجة 20 درجة تكليفات ونصفي 20 درجة شفوي وعملي و 60 درجة تحريري نهائي ",
    ),
    (
        "مادة معمارية المعلومات؟",
        "أهداف المقرر: التعريف بمفهوم معمارية المعلومات، ونشأته ومراحل تطوره، وأجيال المعمارية، تعريف الطلاب بدور المعمارية في تصميم المواقع الإلكترونية من حيث المجالات الحدودية المرتبطة بها، وأسس ومعايير بنائها، وخطوات تصميم بناء معلوماتي، تعريف الطلاب بنماذج عملية المعمارية المعلومات. المهارات المكتسبة: استخدام الحاسب الآلي في تصميم المواقع وفقاً للمعمارية، استخدام التقنيات الحديثة في الاتصال والتواصل، اكتساب مهارة العمل التعاوني في بيئة العمل الجماعي و يحتوي المقرر على عدد وحدات دراسية 2 نظري - 2 عملي و توزيع درجات المقرر هي : 100 درجة 20 درجة تكليفات ونصفي 20 درجة شفوي وعملي و 60 درجة تحريري نهائي ",
    ),
    (
        "مادة الترتيب و الوصف الارشيفي؟",
        "التعريف بمفهوم الوصف الأرشيفي، إمداد الطلاب بآخر التطورات في مجال الوصف الأرشيفي، تمكين الطلاب من استخدام المعايير المتخصصة في مجال الوصف الأرشيفي، تمكين الطلاب من فهرسة المجموعات الأرشيفية، التعريف بأسس تصنيف الوثائق الجارية والأرشيفية، استخدام الحاسب الآلي وبرامجه في التعامل مع مواقع الأرشيفات الرقمية، استخدام التقنيات الحديثة في الاتصال والتواصل، اكتساب مهارة العمل التعاوني في بيئة العمل الجماعي و يحتوي المقرر على عدد وحدات دراسية 2 نظري - 2 عملي و توزيع درجات المقرر هي : 100 درجة 20 درجة تكليفات ونصفي 20 درجة شفوي وعملي و 60 درجة تحريري نهائي ",
    ),
    (
        "مادة سياسات المعلومات؟",
        "أهداف المقرر: تعريف الطالب على السياسات واللوائح التي تحكم علاقة المكتبة بالمؤسسة الأم وعلاقة العاملين بالمكتبة ببعضهم، تزويد الطلاب بقيمة التشريعات لضبط علاقة العاملين بالجمهور وسياسات الثواب والعقاب وسياسات الخدمات المختلفة. المهارات المكتسبة: اكتساب مهارة العمل مع فريق، القدرة على عرض الأفكار بطريقة سليمة، اكتساب القدرة على إدارة الوقت و يحتوي المقرر على عدد وحدات دراسية 3 نظري - 3 عملي و توزيع درجات المقرر هي : 100 درجة 20 درجة تكليفات ونصفي 20 درجة شفوي وعملي و 60 درجة تحريري نهائي ",
    ),
    (
        "مادة تطبيقات الحوسبه السحابيه في المكتبات؟",
        "أهداف المقرر: التعريف بمفهوم الحوسبة السحابية وخصائصها الأساسية، تعريف الطلاب بأنواع خدمات الحوسبة السحابية وتطبيقاتها بالمكتبات، إكساب الطلاب مهارات استخدام نظم معلومات الحوسبة السحابية. المهارات العامة: استخدام الحاسب الآلي وبرامجه في التعامل مع نظم الحوسبة السحابية، استخدام التقنيات الحديثة في الاتصال والتواصل، اكتساب مهارة العمل التعاوني في بيئة العمل الجماعي و يحتوي المقرر على عدد وحدات دراسية 2 نظري - 2 عملي و توزيع درجات المقرر هي : 100 درجة 20 درجة تكليفات ونصفي 20 درجة شفوي وعملي و 60 درجة تحريري نهائي ",
    ),
    (
        "مادة تطبيقات الويب الدلالي في المكتبات؟",
        "أهداف المقرر: التعريف بمفهوم الويب الدلالي ومراحل تطوره وأهميته، تعريف الطلاب بالعلاقة بين الويب الدلالي وتنظيم واسترجاع المعلومات، إكساب الطلاب مهارات استخدام محركات البحث الدلالية، التعريف بتطبيقات واستخدامات الويب الدلالي بالمكتبات. المهارات العامة: استخدام الحاسب الآلي وبرامجه في التعامل مع محركات البحث الدلالية، استخدام التقنيات الحديثة في الاتصال والتواصل، اكتساب مهارة العمل التعاوني في بيئة العمل الجماعي و يحتوي المقرر عى عدد وحدات دراسية 2 نظري - 2 عملي و توزيع درجات المقرر هي : 100 درجة 20 درجة تكليفات ونصفي 20 درجة شفوي وعملي و 60 درجة تحريري نهائي ",
    ),
    (
        "مادة المعوماتية الصحية؟",
        "أهداف المقرر: تعريف الطالب بنظم المعلومات الصحية ومكوناتها وأهميتها، وتزويد الطلاب بالمهارات التي تمكنه من معرفة مصادر المعلومات الصحية الموثوقة والمتاحة على الإنترنت. المهارات العامة: اكتساب مهارة العمل مع فريق، القدرة على عرض الأفكار بطريقة سليمة، واكتساب القدرة على إدارة الوقت و يحتوي المقرر على عدد وحدات دراسية 2 نظري - 2 عملي و توزيع درجات المقرر هي : 100 درجة 20 درجة تكليفات ونصفي 20 درجة شفوي وعملي و 60 درجة تحريري نهائي ",
    ),
    (
        "مادة بناء و ادارة المواقع و المكتبات؟",
        "أهداف المقرر: تعريف الطلاب بالقضايا المتعلقة بتخطيط وإدارة مواقع المكتبات، إكساب الطلاب القدرة على تقييم مواقع مؤسسات المعلومات وتحديد مدى جودتها، إكساب الطلاب المعرفة بالخدمات الواجب توافرها في مواقع مؤسسات المعلومات. المهارات العامة: استخدام الحاسب الآلي وبرامجه في تصميم المواقع، استخدام التقنيات الحديثة في الاتصال والتواصل، اكتساب مهارة العمل التعاوني في بيئة العمل الجماعي ويحتوي المقرر على عدد وحدات دراسية 2 نظري - 2 عملي و توزيع درجات المقرر هي : 100 درجة 20 درجة تكليفات ونصفي 20 درجة شفوي وعملي و 60 درجة تحريري نهائي ",
    ),
    (
        "مادة الارشفة الالكترونية؟",
        "أهداف المقرر: تعريف الطلاب بمفهوم الأرشفة الإلكترونية، إكساب الطلاب المعرفة بالدورة المستندية الإلكترونية، إكساب الطلاب المعرفة بإجراءات التحول من الأرشيف الورقي إلى الإلكتروني. المهارات العامة: استخدام الحاسب الآلي وبرامجه في تصميم المواقع، استخدام التقنيات الحديثة في الاتصال والتواصل، اكتساب مهارة العمل التعاوني في بيئة العمل الجماعي و يحتوي المقرر على عدد وحدات دراسية 2 نظري - 2 عملي و توزيع درجات المقرر هي : 100 درجة 20 درجة تكليفات ونصفي 20 درجة شفوي وعملي و 60 درجة تحريري نهائي ",
    ),
    (
        "مادة قياسات الويب؟",
        "أهداف المقرر: إكساب الطالب المعرفة بالمصطلحات الانجليزية في المكتبات والمعلومات، وتمكين الطالب من قراءة تفسير النصوص الانجليزية في المجال، والتعبير بالانجليزية عن موضوع التخصص. المهارات العامة: اكتساب مهارات الاستعداد لسوق العمل، واكتساب مهارات العمل الجماعي في المكتبات ومراكز المعلومات، وإكساب الطلاب القدرة على استخدام التكنولوجيا و يحتوي المقرر على عدد وحدات دراسية 3 عملي و توزيع درجات المقرر هي : 100 درجة 20 درجة تكليفات ونصفي 20 درجة شفوي وعملي و 60 درجة تحريري نهائي ",
    ),
    (
        "مادة نصوص متخصصة باللغة الانجليزية؟",
        "أهداف المقرر: إكساب الطالب المعرفة بالمصطلحات الانجليزية في المكتبات والمعلومات، تمكين الطالب من قراءة تفسير النصوص الانجليزية في المجال، التعبير بالانجليزية عن موضوع التخصص. المهارات العامة: اكتساب مهارات الاستعداد لسوق العمل، اكتساب مهارات العمل الجماعي في المكتبات ومراكز المعلومات، إكساب الطلاب القدرة على استخدام التكنولوجيا و يحتوي المقرر على عدد وحدات دراسية 3 عملي و توزيع درجات المقرر هي : 100 درجة 40 درجة تكليفات ونصفي و 60 درجة تحريري نهائي ",
    ),
    (
        "مادة ادارة المجموعات الرقمية؟",
        "أهداف المقرر: التعريف بالمفاهيم النظرية والأسس لإدارة بناء وتنمية المجموعات الرقمية، إكساب الطالب المعرفة بأسس وأدوات إدارة المجموعات الرقمية واختيارها وطرق بنائها، التعريف بأسس تقييم المجموعات الرقمية، تعريف الطالب بمفهوم التعاون في بناء المجموعات الرقمية بين المكتبات وتكتلات واتحادات شبكات المكتبات. المهارات العامة: استخدام الحاسب الآلي في البحث والاتصال، استخدام التقنيات الحديثة في الاتصال والتواصل، اكتساب مهارة العمل التعاوني في بيئة العمل الجماعي و يحتوي المقرر على عدد وحدات دراسية 3 عملي و توزيع درجات المقرر هي : 100 درجة 40 درجة تكليفات ونصفي و 60 درجة تحريري نهائي",
    ),
    (
        "مادة ادارة مشاريع تقنية المعلومات؟",
        "أهداف المقرر: التعريف بمفهوم المشروع وأهمية استخدام تقنيات المعلومات في المشاريع، إكساب الطلاب خصائص مدير المشروع الناجح، التعريف بمنهج إدارة المشاريع، تعريف الطلاب بمفهوم التخطيط للمشروع ومهامه وخطواته. المهارات العامة: استخدام الحاسب الآلي في التخطيط للمشروع، استخدام التقنيات الحديثة في الاتصال والتواصل، اكتساب مهارة العمل التعاوني في بيئة العمل الجماعي و يحتوي المقرر على عدد وحدات دراسية 2 نظي - 1 عملي و توزيع درجات المقرر هي : 100 درجة 40 درجة تكليفات و نصفي و 60 درجة تحريري نهائي",
    ),
    (
        "مادة الجودة الشامله في المكتبات؟",
        "أهداف المقرر: التعريف بمفهوم الجودة الشاملة بالمكتبات وأهدافها ومميزاتها وتطورها، تعريف الطلاب بمراحل تطبيق الجودة الشاملة بالمكتبات ومتطلباتها، إكساب الطلاب المعرفة بمعايير إدارة الجودة الشاملة، تعريف الطلاب أدوات قياس وتقييم جودة الخدمة في المكتبات. المهارات العامة: استخدام الحاسب الآلي وبرامجه في تقييم أداء المكتبات، استخدام التقنيات الحديثة في الاتصال والتواصل، اكتساب مهارة العمل التعاوني في بيئة العمل الجماعي و يحتوي المقرر على عدد وحدات دراسية 3 عملي و توزيع درجات المقرر هي : 100 درجة 40 درجة تكليفات ونصفي و 60 درجة تحريري نهائي ",
    ),
    (
        "مشروع التخرج؟",
        "أهداف المقرر: تعريف الطلاب بالمتطلبات الأساسية لتطوير وبناء مشروع في مجال خدمات المعلومات، إكساب الطلاب القدرة على تنفيذ مشروع رقمي في مجال المعلومات. المهارات العامة: استخدام الحاسب الآلي في تطبيق المشروع، استخدام التقنيات الحديثة في الاتصال والتواصل، اكتساب مهارة العمل التعاوني في بيئة العمل الجماعي و يحتوي المقرر على عدد وحدات دراسية 1 نظري - 4 عملي و توزيع درجات المقرر هي : 100 درجة  40 درجة متابعه لمراحل المشروع و 60 درجة عرض ومناقشة المشروع",
    ),
    (
        "التدريب الميداني؟",
        "أهداف المقرر: إكساب الطلاب والطالبات خبرة تطبيقية من خلال العمل في إحدى مؤسسات المعلومات والتعرف على واقع العمل في الميدان، تمكين الطلاب من اكتساب المهارات التطبيقية اللازمة ومزاولة العمل في هذه المؤسسات خلال فترة زمنية يحددها القسم مع جهات التدريب. المهارات العامة: استخدام الحاسب الآلي في التعامل مع المستفيدين، استخدام التقنيات الحديثة في الاتصال والتواصل، اكتساب مهارة العمل التعاوني في بيئة العمل الجماع و يحتوي المقرر على عدد وحدات دراسية 1 نظري - 10 عملي و توزيع درجات المقرر هي : 100 درجة  40 درجة متابعة المشرف و 40 درجة جهة التدريب و 20درجة تقرير التدريب",
    ),
    (
        "امتى امتحانات الميدتيرم؟",
        "تبدأ امتحانات الميدتيرم بداية من الاسبوع السابع حتى الاسبوع التاسع",
    ),
    (
        "لينك الجداول؟",
        "https://art.tanta.edu.eg/stu_study_tables.aspx",
    ),
    (
        "Tables Link?",
        "https://art.tanta.edu.eg/stu_study_tables.aspx",
    ),
    (
        "Hello",
        "Hello! How can I help you today? I can answer questions about the Information Technology and Libraries department.",
    ),
    (
        "Thank you.",
        "You're welcome! Is there anything else I can help you with regarding the Information Technology and Libraries department?",
    ),
    (
        "How are you?",
        "I'm doing well, thank you for asking! How can I help you today with the Information Technology and Libraries department?",
    ),
    (
        "What's the weather like?",
        "I'm sorry, I can only answer questions about the Information Technology and Libraries department.",
    ),
    (
        "Goodbye",
        "Goodbye! If you have any further questions about the Information Technology and Libraries department in the future, feel free to ask.",
    ),
    (
        "امتحان مادة التطبيقات الذكية في المكتبات",
        " كلية الآداب برنامج تقنية المعلومات والمكتبات الاختبار النهائي لمادة التطبيقات الذكية في المكتبات - المستوى الثالث الفصل الدراسي الأول - نموذج (1) - (2022-2023م) عدد الأسئلة 50 سؤال الدرجة النهائية للاختبار (50) درجة - درجة كل سؤال (1) درجة زمن الاختبار ساعتان — نموذج (1) (عدد الأسئلة 50 سؤالاً موضوعياً) أولاً: ظلل (✓) صح أو خطا (x) خطأ للعبارات من (1 - 25) في نموذج الإجابة 1. تستخدم لغة Assembly Language في الذكاء الاصطناعي (X) 2. تستخدم تقنية RFID في التخزين السحابي (X) 3. لغة Dart هي لغة كائنية التوجه OOP (✓) 4. تستخدم جملة while loop في الحلقات المحددة Definite (X) 5. لغة Dart لا تميز حالة الأحرف Case sensitive (X) 6. وسم Count هو نفسه الوسم COUNT أو count (X) 7. بطاقة RFID (Active Tags) تعمل بدون بطارية (X) 8. تستخدم Dart للهواتف، والويب، وتطبيقات سطح المكتب (✓) 9. تعتبر لغة HLL ضمن لغات الجيل الثالث 3rdIT (✓) 10. في لغة Dart الكلمة final يمكن تغيير قيمتها (X) 11. يستخدم Flutter لبناء تطبيقات الويب فقط (X) 12. في لغة Dart يتم إنهاء الجملة بفاصلة منقوطة (✓) 13. Dart لا تدعم استخدام الكلمة المفتاحية var كتعريف نوع متغير (X) 14. يتم استخدام الفاصلة المنقوطة (;) في نهاية الجملة في Dart (✓) 15. لا يمكن أن يقبل المتغير null في لغة Dart (X) 16. نوع البيانات String لا يستخدم لتمثيل النصوص (X) 17. المفتاح الأساسي Primary Key هو معرف فريد للسجل (✓) 18. نوع البيانات bool يعرف بقيمتي true أو false فقط (✓) 19. القيمة value = 2 ليست مساوية لتعبير value == 2 (✓) 20. تستخدم جملة break للخروج من الحلقة (✓) 21. تستخدم جملة switch لتنفيذ حالة واحدة فقط (X) 22. الرمز !! يستخدم لتمثيل العامل المنطقي OR (X) 23. لا يمكن استخدام لغة for loop مع الأنواع العددية (X) 24. تسمى الحلقة التكرارية التي لها عدد محدد من التكرارات باسم Definite (✓) 25. جملة continue تستخدم للخروج من الحلقة التكرارية (X) — ثانياً: اختر الإجابة الصحيحة للفقرات من (26 - 50) في نموذج الإجابة 26. الذاكرة التي يمكن فقط قراءة البيانات المخزنة بها يطلق عليها: (أ) الذاكرة المؤقتة (ب) الذاكرة الدائمة (✓) ROM (د) الذاكرة الثانوية 27. الطالب الذي يستخدم جهاز الحاسب الآلي ويقوم بترجمة البحوث وكتابة المشاريع الإلكترونية وتكوين قاعدة بيانات وتسجيل وحفظ وتوثيق الكتب إلكترونياً، فإنه يستخدم: (أ) QR-Code (ب) RFID (✓) Wi-Fi (د) NFC 28. يتم تمثيل الصور الرقمية داخل الأجهزة الإلكترونية عن طريق: (أ) QR-Code (ب) RFID (✓) Pixels (د) Wi-Fi 29. لغة برمجة تستخدم لتنفيذ الأوامر، والتحكم في مكونات الجهاز بشكل مباشر، وتعمل في بيئة DOS هي: (أ) Statements (ب) Compiler (✓) Assembler (د) Interpreter 30. لكتابة التعليقات داخل لغة Dart نستخدم: (أ) علامات الاستفهام (ب) علامات التعجب (✓) Comments (د) علامات الضرب 31. الرمز (//) يستخدم لكتابة: (أ) العمليات الحسابية (ب) المتغيرات (✓) التعليقات (د) الحلقات 32. من أنواع Collections في Dart: (أ) key-value (✓) Paired-values (ج) pairs (د) list 33. لغة برمجة تنتج عنها لغة منخفضة المستوى (Machine Code) وليس (HLL): (أ) Assembler (✓) Compiler (ج) Interpreter (د) Dart 34. عدد البتات التي يمكن تمثيلها على كمبيوتر 12.5 هو: (أ) 16 (ب) 8 (✓) 12.5 (د) 10 35. نوع البيانات في Dart الذي يمثل عدد صحيح هو: (أ) int (✓) double (ج) string (د) char 36. تُستخدم تقنية QR-Code في: (أ) تخزين البيانات (✓) مشاركة المعلومات (ج) تحسين الأداء (د) إدارة المشاريع 37. تُستخدم تقنية NFC بشكل أساسي في: (أ) الشحن اللاسلكي (ب) تخزين الملفات (✓) الدفع الإلكتروني (د) كتابة الأكواد 38. من لغات البرمجة التي تُترجم مباشرة إلى لغة الآلة: (أ) Java (✓) Assembly (ج) Python (د) Dart 39. تُستخدم واجهات المستخدم الرسومية (GUI) في: (أ) التعامل مع الأجهزة فقط (✓) تسهيل استخدام البرامج (ج) كتابة الأكواد (د) تحديد صلاحيات الدخول 40. تعتبر لغة Dart من اللغات: (أ) منخفضة المستوى (✓) متعددة الاستخدامات (ج) الخاصة بالشبكات (د) التعليمية فقط 41. تستخدم جملة if في البرمجة من أجل: (أ) تكرار الأوامر (✓) اتخاذ القرار (ج) تعريف المتغيرات (د) إدخال البيانات 42. في لغة Dart، النوع double يستخدم لـ: (أ) الأحرف (ب) السلاسل النصية (✓) الأرقام العشرية (د) القيم المنطقية 43. عند استخدام المتغيرات الثابتة نستخدم الكلمة: (أ) final (✓) const (ج) var (د) dynamic 44. تُستخدم الحلقات في البرمجة من أجل: (أ) التحقق من الشروط (ب) التخزين (✓) تكرار الأوامر (د) العرض فقط 45. Flutter يُستخدم لتطوير: (أ) تطبيقات الويب فقط (ب) البرامج المكتبية فقط (✓) التطبيقات متعددة المنصات (د) الألعاب فقط 46. من الأدوات المستخدمة في تطوير تطبيقات Flutter: (أ) Eclipse (✓) Android Studio (ج) WordPress (د) Joomla 47. Dart هي لغة: (أ) برمجة منخفضة المستوى (✓) حديثة ومفتوحة المصدر (ج) خاصة بقواعد البيانات (د) غير قابلة للتعديل 48. نوع المتغير الذي يستخدم لتخزين النصوص في Dart هو: (أ) int (ب) double (✓) String (د) bool 49. تُكتب التعليقات متعددة الأسطر في Dart باستخدام: (أ) // (ب) # (✓) /* */ (د) <> 50. يُستخدم الأمر continue في الحلقات من أجل: (أ) إنهاء الحلقة (ب) تجاهل الشرط (✓) تخطي التكرار الحالي (د) تعريف متغير جديد",
    ),
    (
        "امتحان مادة اساسيات برمجة الحاسوب",
        "امتحان نهاية الفصل الدراسي الأول للعام الجامعي: 2023/2022 المادة: أساسيات برمجة الحاسوب الفرقة: الثانية الدرجة: 50 درجة الزمن الامتحان: ساعتان — التاريخ: 2023/11/29 عدد الأسئلة: (نموذج 1) المادة: IS313 الفرقة: الثانية المدة: 2 ساعة — السؤال الأول: اختر الإجابة الصحيحة من بين الأقواس بوضع دائرة حولها: 1. تقنية تستخدم في معرفة وتتبع الأغراض باستخدام الموجات اللاسلكية ويمكننا مشاهدتها عند شراء منتج من المول وتظهر في الفاتورة: • (أ) RFID • (ب) QR-Code • (ج) Barcode • (د) Wi-Fi 2. ……….. هي القيم التي يتم تخزينها في الذاكرة لاستخدامها عند الحاجة. • (أ) Constant • (ب) Operator • (ج) Variable • (د) Loop (حلقة تكرارية) 3. في أحد مبادئ البرمجة ولها ثلاث خصائص رئيسية وهي التغليف Encapsulation، والوراثة Inheritance، وتعدد الأوجه Polymorphism. • (أ) Structured • (ب) Event-driven • (ج) Object Oriented (OOP) • (د) ليس مما سبق 4. لغة Dart تُصنف من: • (أ) اللغات منخفضة المستوى Low Level Language (LLL) • (ب) لغة الآلة Machine Language • (ج) لغة التجميع Assembly Language • (د) اللغات عالية المستوى High Level Language (HLL) 5. Dart هي لغة حساسة لحالة الحروف Case sensitive وبالتالي يختلف المتغير الذي اسمه SUM عن المتغير sum: • (أ) صواب • (ب) خطأ 6. يتخلص الأمر ………… الملاحظة في التكرار الحالي ويخرج خارج الحلقة مباشرة. • (أ) print • (ب) continue • (ج) if • (د) break",
    ),
    (
        "امتحان مادة المعلوماتية الصحية",
        "جامعة طنطا كلية الآداب برنامج نظم المعلومات والمكتبات المستوى الثالث نموذج (2) عدد الأسئلة: 50 درجة موزعة العام الجامعي: 2022/2023م زمن الامتحان: ساعة واحدة فقط درجة الامتحان: 50 درجة أولاً: ضع (✓) أمام العبارة الصحيحة و(✗) أمام العبارة الخطأ (1-25) 1. يمكن أن تسهم البيئة الذكية في تحسين متابعة المرضى من المنزل (✓) 2. من مميزات السجلات الصحية الإلكترونية أنها تسمح للأطباء بالوصول السريع للمعلومات (✓) 3. تهدف إدارة الأزمات والكوارث إلى التحكم فيها وتوجيهها (✓) 4. السجل الصحي الإلكتروني يصدر له بطاقة واحدة فقط (✗) 5. التكنولوجيا الحيوية تستخدم في معظم البلدان النامية (✗) 6. تساعد الصحة النفسية في تحقيق الرفاهية النفسية (✓) 7. تعتبر برامج الحماية الشخصية من برامج حماية بيئية (✗) 8. يعد السجل الصحي الإلكتروني بديلاً عن السجل الورقي (✓) 9. الحكومة المصرية أطلقت مبادرة صوتك مسموع عام 1995م (✗) 10. جهاز Kardia Mobile مخطط كهربائية للقلب (✓) 11. البيانات الأولية تجمع وتنقل وتخزن بيانات من المصادر الإلكترونية (✓) 12. رقم الطوارئ في مصر هو 16676 (✓) 13. يعمل معارف باللغتين العربية والإنجليزية فقط (✗) 14. يمكن الاعتماد على طائرات الدرون في نشر الزراعة (✓) 15. رمز الأمراض هو ترميز للأمراض وللنتائج فقط (✗) ثانياً: اختر الإجابة الصحيحة من بين الأقواس (26-50) 26. بلغت نسبة الوفيات بين مرضى كورونا في المستشفيات عام 2020 حوالي: (أ) %95 (ب) %60 (ج) %50 (د) %10 الإجابة: (ج) 27. تعتمد الحسابات الآلية في تخزين بيانات المستشفيات على: (أ) الكهرباء (ب) السجلات الورقية (ج) البيانات الضخمة (د) الأقراص المدمجة الإجابة: (ج) 28. تستخدم الأجهزة الذكية في: (أ) تخزين البيانات فقط (ب) تحليل البيانات فقط (ج) مجموعة متنوعة من التطبيقات (د) الاتصال الهاتفي فقط الإجابة: (ج) 29. ترتبط أكثر التطبيقات الذكية استخدامًا في مجال الرعاية الصحية بـ: (أ) التسويق (ب) الأغذية (ج) الأنظمة البيئية (د) الصحة العامة الإجابة: (د) 30. سلسلة الكتل تعتمد على: (أ) الذكاء الاصطناعي (ب) التخزين السحابي (ج) الإنترنت فقط (د) التشفير الإجابة: (د) 31. تهدف رعاية الصحية عن بعد إلى: (أ) التشخيص فقط (ب) تقديم العلاج فقط (ج) تقديم الرعاية الصحية في الأماكن النائية (د) متابعة المرضى الإجابة: (ج) 32. أول من عرف السجلات الصحية في مصر عام: (أ) 2019 (ب) 2018 (ج) 2020 (د) 2015 الإجابة: (ب) 33. يطلق على المرض المزمن المصاحب لمريض السكر اسم: (أ) ارتفاع ضغط الدم (ب) الذئبة الحمراء (ج) السمنة (د) الالتهاب الكبدي الإجابة: (ج) 34. البيانات الضخمة تشمل: (أ) النصوص فقط (ب) الأرقام فقط (ج) الصوت فقط (د) جميع ما سبق الإجابة: (د) 35. تنتج شركة AliveCor جهاز: (أ) tech tats (ب) Kardia (ج) Kardia Mobile (د) القلب الذكي الإجابة: (ج) 36. بدأ نظام الصحة الإلكتروني في الكويت عام: (أ) 1989 (ب) 1999 (ج) 2000 (د) 1998 الإجابة: (ب) 37. التكنولوجيا غيرت مستوى الصحة …….. للسماح بتبادل البيانات الصحية (أ) الشخصي (ب) المسلسل (ج) التشخيص (د) العالمي 38. الأطباء في بعض الأحيان يحتاجون لمساعدة لفرز معلومات المريض (أ) الطبية (ب) العلمية (ج) التربوية (د) الثقافية 39. الأطباء والممرضون والموظفون الإداريون في المستشفيات هم أمثلة على استخدامات …….. (أ) الاقتصادية (ب) السياسية (ج) الإدارية (د) الاجتماعية 40. من تقنيات دعم اتخاذ الحكم على مصداقية المعلومات الصحية (أ) المعلومات الصحية (ب) تكنولوجيا الرعاية الصحية (ج) المعلوماتية الصحية (د) المعرفة 41. بدأ العمل بمنظمة الصحة العالمية عام (أ) 1985 (ب) 1987 (ج) 1989 (د) 1990 42. هي تطبيقات التقنية الرقمية في الحقول الطبية (أ) الإنترنت (ب) الذكاء الاصطناعي (ج) الصحة الإلكترونية (د) تحليل البيانات 43. يتم التحكم في التداخلات في السلوك العام (أ) بالتكرار (ب) بالأزمة (ج) العادة (د) الحدث 44. التقييم المستمر للخدمات الصحية باستخدام البيانات والمعلومات يعرف بـ: (أ) النظام الصحي (ب) الرعاية الصحية (ج) إدارة المعلومات الصحية (د) الأطباء 45. يشمل على البيانات التي تمثل الأفراد في النظام الصحي (أ) السجلات الورقية (ب) المريض (ج) السجلات الصحية (د) الأدوية 46. عدد السنوات بين تشخيص المرض والطلب عن علاج تمثل (أ) الجسم (ب) الإدراك (ج) السلوك (د) ميول 47. نسبة الذين طبقوا البرنامج كانت: (أ) 17.5% (ب) 17.7% (ج) 7.4% (د) 41% 48. لا يمكن أن ينسى كوبر وغيره كيف كانت حالتهم (أ) عندما تشافوا (ب) عندما تعبوا (ج) عندما تحركوا (د) عندما دخلوا المستشفى 49. حزنت منظمة الصحة العالمية من (أ) الانتكارات الصحية (ب) وباء معلومات (ج) المواد البديلة (د) الأدوية 50. بدأ العمل بمنظمة الصحة العالمية عام (أ) 1954 (ب) 1948 (ج) 1934",
    ),
    (
        "امتحان لمادة المعلوماتية الصحية",
        "جامعة طنطا كلية الآداب برنامج نظم المعلومات والمكتبات الفرقة: الثالثة التاريخ: 2024/1/15 امتحان نهاية الفصل الدراسي الأول للعام الجامعي: 2024/2023 المادة: المعلوماتية الصحية زمن الامتحان: ساعتان الدرجة: 50 درجة نموذج (أ) (عدد الأسئلة - 25 سؤالاً موضوعياً) أولاً: ظلل (أ) صح أو (ب) خطأ للعبارات من (1 - 15) في نموذج الإجابة 1. يمكن للطبيب أن يوفر مرافق تدريب في المناطق البعيدة (أ) صح (ب) خطأ 2. هدفت خطة التنمية الصحية الكويتية إلى إذاعة برامج توعية بالتلفزيون لمدة 24 ساعة (أ) صح (ب) خطأ 3. من تحديات نظام الصحة المصري غياب آلية تداول الأدوية وصرفها (أ) صح (ب) خطأ 4. تهدف إدارة الأزمة والكوارث إلى التحكم في خططها وتوجيه مسارها (أ) صح (ب) خطأ 5. السجلات الشخصية يتم إنشاؤها من قبل المرضى (أ) صح (ب) خطأ 6. تساعد المحاكاة الحاسوبية في تكرار التجارب تحت أوضاع مختلفة (أ) صح (ب) خطأ 7. تساعد الرعاية الصحية في توقع تطور المرض (أ) صح (ب) خطأ 8. تشمل البيانات الصحية انتشار المرض لدى عائلة المريض (أ) صح (ب) خطأ 9. يؤدي التدخين إلى رفع تكاليف الرعاية الصحية (أ) صح (ب) خطأ 10. تساعد التكنولوجيا في عمل تكاملية ثانيًا: اختر الإجابة الصحيحة للفقرات من (16 - 25) من نموذج الإجابة: 16. من حق المريض الاطلاع على بياناته وهو ما يعرف بـ: (أ) الأمان (ب) الخصوصية (ج) الثقة 17. تستخدم الطائرات الصحية لتقديم خدمات طبية عن بعد في: (أ) الكويت (ب) مصر (ج) بريطانيا 18. يتم تصنيف الدكاترة في موقع فيزيتا حسب: (أ) الاسم (ب) التخصص (ج) تقييم المريض 19. يوجد في نظام الرعاية الصحية في سيناء بيانات: (أ) مليون مريض (ب) 2 (ج) 5 20. يكشف جهاز Kardia Mobile: (أ) السكر (ب) مخطط كهربية القلب (ج) الضغط 21. يمكن استخدام تقنية ………. في المحاسبة في دفع الفواتير بدلًا من بطاقة الائتمان: (أ) tech tats (ب) Kardia Mobile (ج) AliveCor ⸻ 22. عدد دول منظمة الصحة العالمية حوالي: (أ) 174 (ب) 184 (ج) 194 23. بدأت الخدمات الصحية في البيئة المصرية بـ: (أ) التغذية (ب) الأدوية (ج) إمضاء الغرب 24. في الطب عن بعد يكون النقل: (أ) متزامن (ب) لا متزامن (ج) أحيانًا متزامن وأحيانًا غير متزامن 25. من فرص العمل في تكنولوجيا المعلومات الصحية: (أ) تقل (ب) تزيد (ج) تساهم",
    ),
    (
        "امتحان ميدتيرم لمادة المعلوماتية الصحية",
        "جامعة طنطا كلية الآداب برنامج نظم المعلومات والمكتبات الفرقة: الثالثة التاريخ: 2024/1/15 امتحان نهاية الفصل الدراسي الأول للعام الجامعي: 2024/2023 المادة: المعلوماتية الصحية زمن الامتحان: ساعتان الدرجة: 50 درجة نموذج (أ) (عدد الأسئلة - 25 سؤالاً موضوعياً) أولاً: ظلل (أ) صح أو (ب) خطأ للعبارات من (1 - 15) في نموذج الإجابة 1. يمكن للطبيب أن يوفر مرافق تدريب في المناطق البعيدة (أ) صح (ب) خطأ 2. هدفت خطة التنمية الصحية الكويتية إلى إذاعة برامج توعية بالتلفزيون لمدة 24 ساعة (أ) صح (ب) خطأ 3. من تحديات نظام الصحة المصري غياب آلية تداول الأدوية وصرفها (أ) صح (ب) خطأ 4. تهدف إدارة الأزمة والكوارث إلى التحكم في خططها وتوجيه مسارها (أ) صح (ب) خطأ 5. السجلات الشخصية يتم إنشاؤها من قبل المرضى (أ) صح (ب) خطأ 6. تساعد المحاكاة الحاسوبية في تكرار التجارب تحت أوضاع مختلفة (أ) صح (ب) خطأ 7. تساعد الرعاية الصحية في توقع تطور المرض (أ) صح (ب) خطأ 8. تشمل البيانات الصحية انتشار المرض لدى عائلة المريض (أ) صح (ب) خطأ 9. يؤدي التدخين إلى رفع تكاليف الرعاية الصحية (أ) صح (ب) خطأ 10. تساعد التكنولوجيا في عمل تكاملية ثانيًا: اختر الإجابة الصحيحة للفقرات من (16 - 25) من نموذج الإجابة: 16. من حق المريض الاطلاع على بياناته وهو ما يعرف بـ: (أ) الأمان (ب) الخصوصية (ج) الثقة 17. تستخدم الطائرات الصحية لتقديم خدمات طبية عن بعد في: (أ) الكويت (ب) مصر (ج) بريطانيا 18. يتم تصنيف الدكاترة في موقع فيزيتا حسب: (أ) الاسم (ب) التخصص (ج) تقييم المريض 19. يوجد في نظام الرعاية الصحية في سيناء بيانات: (أ) مليون مريض (ب) 2 (ج) 5 20. يكشف جهاز Kardia Mobile: (أ) السكر (ب) مخطط كهربية القلب (ج) الضغط 21. يمكن استخدام تقنية ………. في المحاسبة في دفع الفواتير بدلًا من بطاقة الائتمان: (أ) tech tats (ب) Kardia Mobile (ج) AliveCor ⸻ 22. عدد دول منظمة الصحة العالمية حوالي: (أ) 174 (ب) 184 (ج) 194 23. بدأت الخدمات الصحية في البيئة المصرية بـ: (أ) التغذية (ب) الأدوية (ج) إمضاء الغرب 24. في الطب عن بعد يكون النقل: (أ) متزامن (ب) لا متزامن (ج) أحيانًا متزامن وأحيانًا غير متزامن 25. من فرص العمل في تكنولوجيا المعلومات الصحية: (أ) تقل (ب) تزيد (ج) تساهم",
    ),
    (
        "امتحان لمادة الميتاداتا",
        "الامتحان النهائي للفصل الدراسي الأول 2022/2023 مقرر: الميتاداتا الدرجة الكلية للامتحان: 50 درجة أجب عن الأسئلة بتظليل رمز الإجابة الصحيحة في نموذج (50 درجة) 1. تعتبر هذه الفئة من البيانات قبل معالجتها، يتم استخدامها كمدخلات. (البيانات الأولية) 2. تساعد البيانات في سلوك الشركات تجاه عملائها. (المساعدة في اتخاذ القرار) 3. البيانات التي يتم توليدها من أكثر من مصدر. (البيانات الضخمة) 4. كمية البيانات التي يتم توليدها في الثانية. (200 ج، 60 ب، 1000 أ) 5. البيانات التي تصف البيانات الأخرى. (بيانات وصفية) 6. عند الرغبة في التحكم بمحرك تسويق الصفحات يتم استخدام: (Request-rate أ، User-agent ب، Visit-time ج، Request) 7. عند الرغبة في التحكم بمحرك البحث يتم استخدام: (Crawl-delay أ، User-agent ب، Disallow ج) 8. المعلومات التي يتم تحويلها من بياناتنا إلى: (المعرفة) 9. يتم حفظ الروابط داخل محرك البحث داخل: (قاعدة البيانات) 10. تتعامل محركات البحث مع صفحات الويب حسب: (النصوص، الصور، الفيديو، الكيانات) 11. البيانات التي يتم توليدها من المستخدم. (البيانات) 12. البيانات المترابطة هي بيانات: (منظمة) 29. ترجمة حرفية لمصطلح البيانات: أ. البيانات ب. المعطيات ج. ما وراء البيانات د. بيانات البيانات 30. محرّك نقل من الحروف الإنجليزية إلى الحروف العربية: أ. البيانات ب. البيانات الرقمية ج. التعريب د. ترميز 31. تنقسم البيانات إلى طريقة الإدخال إلى بيانات أبجدية وبيانات: أ. آلية ب. رقمية ج. نصية د. مشفرة 32. الفاصلة بين الكلمات المفتاحية تستخدم: أ. المسافة ب. الفاصلة ج. الفاصلة المنقوطة د. الشرطة 33. عند إدراج ملاحظات في ملف الروبوتس نستخدم علامة: أ. / ب. # ج. * د. : 34. الدلالة على وصف أكثر لما يصف الصفحة، يعرض جوجل على الوصف الدور الأول: أ. العنوان ب. الكلمات المفتاحية ج. الوصف د. حفظها 35. الوصف لا يتجاوز عدد كلمات من 150–200 تقريباً: أ. العنوان ب. الكلمات المفتاحية ج. النص د. الوصف 36. هذا النوع لا يوجه إلى: أ. صفحات الموقع ب. محركات البحث ج. title د. noarchive 37. عند إعداد صفحة خاصة في الصفحة نستخدم: أ. noarchive ب. nofollow ج. noindex د. جميع ما سبق 38. لعرض صورة ثابتة فقط للفيديو أو عدم عرض معاينة للفيديو نستخدم: أ. max-video-preview ب. max-image-preview ج. None د. 0.1 ⸻ من 40 إلى 50: ظلل (أ) إذا كانت التراكيب صحيحة و(ب) إذا كانت التراكيب خاطئة: 40. <meta http-equiv = 'publisher' content = 'حذام غريب للنشر والتوزيع'> 41. <meta name = 'revisit-after' content = '60 days'> 42. <meta name = 'robot' content = 'nofollow'> 43. <meta name = 'expires' content = 'unavailable_after: 2024-09-21'> 44. <meta name = 'robots' content = 'noimageindex'> 45. <meta name = 'viewport' content = 'width = device-width, initial-scale = 5'> 46. <meta http-equiv = 'og: type' content = 'website'/> 47. <meta name = 'date' content = '2021'> 48. <title> الواجهة البيانية للتطبيقات ودورها في تحسين خدمات المعلومات الرقمية </title> 49. <meta http-equiv = 'language' content = 'eng'> 50. <meta name = 'robots' content = 'max-image-preview:0'>",
    ),
    (
        "امتحان ميدتيرم لمادة التكشيف الالية",
        "السؤال الأول: ضع علامة (✓) أمام العبارة الصواب، وعلامة (✗) أمام العبارة الخطأ: 1. يتم تصنيف كل مدخل كيفية فقط بعد ترتيبها هجائيًا. (✗) 2. تستخدم الإجراءات الفنية الآلية في تحليل المحتوى الموضوعي في اللغة الطبيعية. (✗) 3. من خلال تقنيات الاستخلاص الآلي يتم بها الإجراءات المعتمدة على الحاسبات فقط في تحليل محتويات فهرس المعلومات. (✗) 4. يستفاد التلخيص والانتقاء باحتياجات المستفيدين. (✓) 5. تتخذ تكشيفات المعلومات المختلفة يدخل ما تحت أكثر من صيغة. (✗) ⸻ السؤال الثاني: اختر الإجابة الصحيحة في كل مما يلي: 1. يساعد ….. في الإحاطة بكيفية الموضوع نفسه ويتناول بالعرض معلومات معينة. أ. التلخيص والانتقاء ب. الفحص الوجاهي والاطلاع عليه ج. التعبير عن الموضوع بصيغة واحدة د. اللغة الطبيعية الإجابة: ب 2. في مرحلة …. يتم التعبير عن الموضوع بصيغة واحدة. أ. الاستخلاص ب. الانتقاء ج. التحليل د. اللغة الطبيعية الإجابة: ج 3. في مرحلة …. يتم اختيار الرابط المناسب من لغة التصنيف. أ. اللغة الطبيعية ب. التلخيص ج. الانتقاء د. التحليل الإجابة: د 4. يتم التعبير عن الموضوع بصيغة …. أ. التحليل ب. الانتقاء ج. الاستخلاص د. اللغة الطبيعية",
    ),
    (
        "امتحان مادة برمجة الويب",
        "1. الـ Tag المسؤول عن محتوى الصفحة في HTML هو: 2. الـ Tag المسؤول عن عنوان الصفحة في HTML هو: 3. الخاصية (Attribute) التي تُستخدم مع Tag <img> لبيان مصدر الصورة هي: 4. تُستخدم Tag <a> من أجل: 5. يتم استخدام Tag <td> من أجل: 6. يتم استخدام Tag <tr> من أجل: 7. Tag المستخدمة لإنشاء نموذج إدخال (form) هي: 8. الخاصية المستخدمة مع <form> لإرسال البيانات هي: 9. الكلمة المفتاحية لإنشاء التأثير المتحرك في HTML هي: 10. تعتبر من لغات البرمجة التي تكتب داخل كود HTML: 11. الـ Attribute المسمى alink في Tag <body> يُستخدم لتحديد: 12. من أجل دمج عدد خلايا أفقياً في الجدول يتم استخدام Attribute المسمى: 13. من أجل دمج عدد خلايا عمودياً في الجدول يتم استخدام Attribute المسمى: 14. لعرض صندوق نصي لقراءة المستخدم نستخدم في Javascript الدالة: 15. لعرض صندوق يحتوي على زر OK فقط نستخدم في Javascript الدالة: 16. لحفظ الملف الذي يحتوي على كود Javascript يتم امتداده: 17. لعرض صورة في صفحة HTML يمكن استخدام Attribute المسمى: 18. لتغيير لون خلفية صفحة الـ HTML نستخدم الخاصية 19. يمكن أن يحل محل الـ Tag <TH> في إدخال الصف الأول من الجدول: أ. <TR> ب. <TH> ج. <TD> د. <TC> 20. يتم استخدام الـ Tag <a> للربط مع جهاز أو عنوان بريد إلكتروني باستخدام الـ Attribute: أ. mailto ب. href ج. top د. Bottom 21. يتم استخدام الوسم <Script> في لغة javascript لإدخال الكود داخل: أ. <Text> ب. <Script> ج. <Code> د. <Head> 22. لإظهار النص في لغة javascript يمكن استخدام الأمر: أ. document.write() ب. head.write() ج. Page.write() د. text.write() 23. لحفظ البيانات في الصفحة باستخدام لغة javascript يتم استخدام: أ. تخزين الصور ب. تخزين البيانات ج. تحميل الصور د. حفظ البيانات 24. للحصول على معلومة معينة من المستخدم يمكن استخدام الدالة: أ. Prompt() ب. Confirm() ج. Alert() د. جميع ما سبق 25. لإظهار مربع تأكيد وإقرار من قبل المستخدم يتم استخدام: أ. Prompt() ب. Confirm() ج. Alert() د. script 26. لإظهار رسالة إعلامية للمستخدم يتم استخدام: أ. Prompt() ب. Confirm() ج. Alert() د. جميع ما سبق 27. في حالة رغبة المستخدم في إدخال معلومة معينة يتم استخدام: أ. Prompt() ب. Confirm() ج. Alert() د. جميع ما سبق 28. لإظهار صندوق نص خارج الصفحة يتم استخدام: أ. Prompt() ب. Confirm() ج. Alert() د. جميع ما سبق 29. في حالة تكرار تنفيذ كود معين فقط في حالة تحقق شرط معين يتم استخدام: أ. If...else if... ب. For ج. If د. Else 30. في حالة تنفيذ كود مؤكد آخر في حالة عدم تحقق نفس الشرط يتم استخدام: أ. If...else if... ب. If...else ج. If statement د. Else 31. في حالة رغبة في تنفيذ كود مرة واحدة على الأقل فيتم استخدام: أ. Do...While ب. If statement ج. While د. جميع ما سبق 32. في حالة ذكر معين أكثر من مرة يرغبون بإعادة كتابة هذا الكود يتم استخدام: أ. Do...While ب. Variables ج. If statement د. While 33. إذا كانت القيمة Y = 12، وY=20، فيتم طباعة القيمة: (يوجد كود في الصورة يوضح ذلك) 34. في حالة وضع قيمة X = 3، يكون الخرج يساوي: أ. 5 ب. Large ج. Small د. 3 35. في حالة وضع قيمة X = 2، يكون الخرج يساوي: أ. 22 ب. 21 ج. 20 د. 19 36. في حالة وضع قيمة X = 21، يكون الخرج يساوي: أ. 22 ب. 21 ج. 20 د. 19",
    ),
    (
        "امتحان لمادة رقمنة مصادر المعلومات",
        "السؤال الأول: (ضع (✓) للإجابة الصحيحة و (✗) للإجابة الخاطئة): 1. توجد دائمًا حلول بديلة لعملية الرقمنة داخل مؤسسات المعلومات. 2. تعتمد الرقمنة على الإعداد من الموارد والخبرات البشرية الموجودة داخل المكتبة. 3. تختار المكتبة واحد من خمسة أماكن لإتمام عملية رقمنة مصادرها. 4. عدم الاهتمام بالمعايير المتفق عليها في عمليات الرقمنة يؤدي إلى فقد حقوق وبيانات مسؤولي الرقمنة. 5. الإمكانات تكون أول مصادر الرقمنة من قبل المكتبة. 6. من عوامل تحديد جودة المصادر الرقمية هي إعداد عملية الرقمنة. 7. تعتمد عملية الرقمنة على تقييم احتياجات المستفيدين. 8. يمكن أن تتم عملية الرقمنة من خلال أقراص الليزر. 9. لا تختلف فكرة الرقمنة بالنسبة للمكتبات التي تملك كوادر بشرية مؤهلة. 10. يتم التحكيم في المكان والزمان والمواد ضمن مكان مناسب. ⸻ السؤال الثاني: (اختر الإجابة الصحيحة من بين البدائل التالية): 11. تتم Out sourcing في الاعتماد على الموارد والخبرات: • (أ) البشرية داخل المكتبة • (ب) خارج المكتبة • (ج) من داخل المكتبة وخارجها 12. من العوامل التي تتحكم في عمليات الرقمنة على مستوى المكتبات: • (أ) دراسات الجدوى 25. يمكن تحديد الوصول لمصادر المعلومات المرصودة خارجياً من خلال: (أ) شبكة داخلية و خارجية (ب) البحث على شبكة الانترنت (ج) الشبكات المحلية و الخرائط المطبقة (د) جميع ما سبق 26. القيام برسم المصدر البصرى لمصادر المعلومات يكون بهدف: (أ) إيضاح الصور (ب) المسح الدولى (ج) إيضاح الصور المحمولة و تجهيز مصادر المعلومات (د) جميع ما سبق 27. توافر العمال و الأجهزة و البرامج من حيث مكان مصدر: (أ) الأسس التي يتم بناءً عليها (ب) التجارب و الخبرات السابقة في (ج) الكوادر المهنية و الخبرة اللازمة لـ 28. لتحديد الإمكانيات و الفوائد التى ستجنيها المحكية من عملية الرقمنة في المرحلة: (أ) الثانية للرقمنة (ب) ليست من المراحل و لكنها من الأساليب (ج) الأولى للرقمنة 29. يتم التحقق من … المحقق عليه في تنفيذ الرقمنة: (أ) المطابقة و الشكل (ب) الشكل و المطابقة و الجدول الزمني (ج) المطابقة و الجدول الزمني 30. التكنولوجيا الرقمية جعلت لها دور قوى تجاه الأوطان: (أ) البيانات الجغرافية (ب) أجهزة الحاسوب و مراكز المعلومات (ج) الأنظمة الساحلية",
    ),
    (
        "امتحان ميدتيرم مادة رقمنة مصادر المعلومات",
        "اختر الإجابة الصحيحة لكلٍّ من الأسئلة الآتية: 1. من شروط اختيار مصادر المعلومات: • (أ) توفر المعلومات • (ب) عرض المعلومات • (ج) دقة المعلومات • (د) جميع ما سبق ✓ 2. من مصادر المعلومات الرسمية: • (أ) سجلات الدولة ✓ • (ب) الأخبار • (ج) الروايات • (د) المجلات 3. المصادر شبه الرسمية تهتم بـ: • (أ) الحالة العامة • (ب) الحالة الخاصة • (ج) الأخبار اليومية • (د) السياسة الخارجية ✓ 4. يجب أن تكون وسائط التخزين مناسبة لـ: • (أ) حجم المصدر • (ب) تكلفة المصدر • (ج) حجم المصدر، التكلفة، والسعة ✓ • (د) السعة فقط 5. النسخة الأم هي: • (أ) المادة متاحة على قرص دقيق • (ب) تتعرض دائما ليس لاتجاه • (ج) تحفظ دائما على الحاسب • (د) تنسخ منها نسخ طبق الأصل ✓ 6. من مصادر المعلومات الأساسية: • (أ) تحليل البيانات ✓ • (ب) المصادر البديلة • (ج) المستعملة • (د) النسخة 7. من صيغ كتابة المعلومات المرفقة: • (أ) html • (ب) pdf • (ج) html,gif,teep,pdf ✓ • (د) html فقط 8. عند الأرشفة خارج المكتبة يرعى: • (أ) حفظ الأصول • (ب) وضع جدول زمني ✓ • (ج) أرشفة الحاسب • (د) إدارة المستندات",
    ),
    (
        "امتحان مادة نظم المعلومات المتخصصة",
        "1. من أهم أسباب فشل أنظمة المعلومات: (أ) تحديث البيانات (ب) وجود دعم كافٍ (ج) تسريع عمليات خاطئة (د) التوافق مع النظام 2. من عناصر الحاسب لا يشمل: (أ) البرمجيات (ب) الأجهزة (ج) كهرباء ميكانيكي (د) مشغِّل 3. من سمات البيانات: (أ) اللغة (ب) الدقة (ج) التوقيت (د) وحدة الذاكرة 4. تعتبر المعلومة: (أ) بيانات خام (ب) ناتج معالجة البيانات (ج) معرفة (د) عوامل داخلية 5. نوع التصنيف (classification) للمحاسبين حسب: (أ) النوع (Type) (ب) الثمن (Cost) (ج) بلد المنشأ (د) مكونات الكمبيوتر 6. من مكونات الحاسب: (أ) وحدة المعالجة المركزية (ب) وحدة ذاكرة ثابتة (ج) طابعة (د) شاشة 7. وحدة الذاكرة الرئيسية بالحاسب تشمل: (أ) الذاكرة الثابتة فقط (ROM) (ب) الهارد ديسك (ج) الفلاشات (د) القرص المضغوط 8. من أدوات إدخال البيانات إلى جهاز الكمبيوتر: (أ) الطابعة (Printer) (ب) درجة الحرارة (ج) لوحة المفاتيح (د) شاشة عرض 9. من أمثلة نظم المعلومات: (أ) تسجيل الطلاب (ب) تسجيل الطلبات (ج) حجز الفنادق (د) كل ما سبق 10. من العوامل الداخلية لنجاح نظام المعلومات: (أ) هيكلية العمل (ب) العملاء (ج) شبكات العاملين (د) نظم التخطيط اكتب علامة (✔) أو (X) في ورقة الإجابة أمام العبارات التالية: 26. ليس من أمثلة تطبيقات نظم المعلومات نظام الفهرس الإلكتروني 27. من أمثلة مصادر البيانات: الإنترنت، البريد الإلكتروني 28. من أدوات جمع المعلومات الاستبانة والمقابلة 29. البيانات هي نتائج عمليات المعالجة التي تجرى على المدخلات 30. النظام هو مجموعة مكونات لا ترتبط ببعضها البعض لتحقيق هدف معين 31. لا يتضمن تقرير البحث (العنوان – اللغة – التوقيت – الموضوع) 32. من خصائص نظم المعلومات: معالجة البيانات وتوثيق العمليات والمحاكاة 33. المعلومة Informative هي علم منظمة وزمنية الصدور وتنتج من معالجة البيانات الآلية 34. من العوامل الداخلية لتطوير نظم المعلومات: نقص التمويل – تكنولوجيا المعلومات 35. من التحديات التي تواجه نظم المعلومات نقص المهارات الفنية المتخصصة والماهرة 36. يتم تصنيف (classification) الحاسبات حسب (نظرية – رقمية – مختلفة) 37. يتكون جهاز الكمبيوتر من هارد وير و سوفت وير 38. وحدة الذاكرة الرئيسية بالحاسب لا تشمل ذاكرة الدخول العشوائي (RAM) 39. من أمثلة وحدات الإدخال المستخدمة في نظم المعلومات لوحة المفاتيح (Keyboard) 40. ليس من فوائد نظم المعلومات حفظ البيانات 41. نظم المعلومات الإدارية تمثل نظام متكامل لكل من العنصر البشري 42. نظم المعلومات الإدارية لا تخدم بجميع المجالات الإدارية 43. نظم المعلومات الإدارية ليست من أنواع نظم المعلومات المرتبطة بالطلب 44. نظم المعلومات الإدارية تهدف إلى تحقيق مخرجات دقيقة 45. نظم المعلومات الإدارية ليس لها علاقة بعملية اتخاذ القرار 46. نظم المعلومات لها علاقة بالجودة الشاملة 47. لا تشمل أهمية نظم المعلومات الإدارية زيادة المهارات البشرية 48. تشمل أهمية نظم المعلومات الإدارية تنمية القدرات الإدارية 49. نظم المعلومات ليس لها دور في تحقيق المزايا التنافسية 50. من فوائد شبكات الحاسب الحصول على المعلومات (Access to information)",
    ),
    (
        "امتحان ميدتيرم لمادة الترتيب و الوصف الارشيفي",
        "السؤال الأول (10 درجات): أ‌- عرف المصطلحات الآتية: المعلومات - محور المعلومات ب‌- وضح طرق ربط البيانات بالكائنات الرقمية. ⸻ السؤال الثاني (10 درجات): • قم بإعداد تسجيله ببليوجرافية باستخدام خطة الوصف الأرشيفي المرمز EAD للبيانات الآتية: مجموعة أرشيفية بعنوان الحرب العالمية الثانية: العنوان مكتوب بخط مائل • محفوظة بواسطة إدارة الوثائق والسجلات بالأمم المتحدة بنيويورك الولايات المتحدة الأمريكية، وباللغة الإنجليزية ومتاحة للعاملين بمنظمة الأمم المتحدة. • من إعداد إدارة الأمم المتحدة لجرائم الحرب للفترة من 1939 – 1945. • تغطي المجموعة 2.5 خط طولي. • تتزود المجموعة بصور وأفلام لهجر اليهود في الولايات المتحدة الأمريكية.",
    ),
    (
        "امتحان مادة الترتيب و الوصف الارشيفي",
        "جامعة طنطا - كلية الآداب - برنامج تقنية المكتبات والمعلومات الاختبار النهائي لمقرر الوصف الأرشيفي - المستوى الثالث الفصل الدراسي الثاني (2023-2024) - نموذج (ب) عدد الأسئلة: 25 سؤالًا - الدرجة الكلية للاختبار: 25 درجة - درجة كل سؤال جزئيًا (1 درجة) - زمن الاختبار ساعتان أولًا: ضع (صح) أو (خطأ) أمام العبارات من (1 – 12) في نموذج الإجابة 1. تفتقر خطة EAD إلى وجود عناصر الربط التي تجمع بين الملفات ذات العلاقة بالمجموعة الأرشيفية الموصوفة. 2. يتم إنشاء البيانات في التسجيلات الببليوجرافية لمصادر الرقمية المرتبطة بالمادة فقط. 3. تعتمد خطة EAD على SGML التي تمتاز بالقابلية للتوسع. 4. يعد عنصر الترتيب من العناصر الأساسية في خطة EAD. 5. الإعداد المسبق للبيانات يعني إنشاء بياناتنا في مثل هذا الكيان الإلكتروني محل الوصف. 6. تعتمد استمارات الوصف على الفصول غير مرتبة في سياق هرمي. 7. من مزايا خطة EAD أنها تتيح لنا حرية بناء المشروع الرقمي مستقبلاً لتجاهله البنية الهرمية. 8. تتيح المراسلات المتعددة المرتبطة ببياناتنا تصنيفًا زمنيًا ومكانيًا. 9. يعد عنصر filedesc من العناصر المرجعية في خطة الوصف الأرشيفي. ١. عنصر يتعامل مع مع محدد يُعرف: أ. eadheader ب. filedesc ج. extptr د. (linktype, title, actuate, show) ٢. أحد العناصر الإجبارية في جميع العناصر التي تتعرف بالمعلومات الأساسية في خطة EAD: أ. did ب. dao ج. ib د. level ٣. عدد العناصر الغير متكررة في خطة الوصف الأرشيفي الرمزي: أ. ٧٢ عنصر ب. ٦١ عنصر ج. ١٦٤ د. ١٩٦ ٤. عندنا يكون المحدد type=“inclusive” يكون مستوى الوصف: أ. item ب. collection ج. file د. series ٥. محدد يستخدم لتحديد الطريقة التي يظهر بها المصدر عند الربط link من خلال عدة قيم: أ. href ب. show ج. render د. file ٦. قيمة محدد ترميز اللغة في خطة الوصف الأرشيفي الرمزي: أ. iso639-2b ب. iso8601 ج. iso15511 د. show",
    ),
    (
        "امتحان مادة تطبيقات الويب الدلالي",
        "الأولى: ⸻ السؤال الأول: ضع علامة صح أمام العبارة الصحيحة، وعلامة خطأ أمام العبارة الخاطئة، لا الإجابة الصحيحة بـ (√) والإجابة الخاطئة بـ (X): 1. in DTD elements appears One or more → ___ 2. لا يمكن تعريف العناصر في XML schema → ___ 3. تعريف العنصر في DTD → ___ المثال السابق يحتوي على ___ • Document Type Definition → ___ • root في XML يسمى garden → ___ • garden element يحتوي على صفر أو أكثر من عنصر plants → ___ • plants element يحتوي على attribute يسمى Category وله قيمة → ___ 5. XML هي لغة تمثيل البيانات → ___ 6. HTML لغة لتمثيل محتويات الصفحات → ___ 7. Root Node تفتح إلى XML → ___ 8. في جملة هي جملة صحيحة في XML → ___ 9. XML لا تسمح بوجود أكثر من عنصر رئيسي في الوثيقة الواحدة → ___ 10. في الجملة التالية: <title><author>Ahmed Hany</title></author> → ___ 11. من الممكن أن تحتوي Element lectures على عنصرين (name, phone) → ___ 12. من الممكن أن تحتوي ELEMENT lectures (name, phone) على عنصرين → ___ 13. إذا كانت هناك ELEMENT lectures (name, phone) من الممكن أن تكون phone name → ___ 14. rdf:Bag يستخدم لوصف قائمة غير مرتبة من القيم (Values) → ___ 15. rdf:Alt يستخدم لوصف قائمة بديلة الخاصية (Property) → ___ 16. XML Schema تستخدم لوصف محتويات صفحة XML مثل DTD → ___ 17. XML Schema لا تنتهي بــ .xml → ___ 18. يمكن كتابة DTD file أو XML schema file في ملفات منفصلة والإشارة إليها في ملفات الـ XML → ___ 19. OWL هي لغة توصيف وتهدف إلى تعريف المفاهيم والعلاقات بينها في مجال المعرفة والمعلومات → ___ 20. يمكن استخدام العنصر <header> في المنطقة الرأسية في صفحة HTML → ___ 21. يمكن استخدام العنصر <nav> في المنطقة الخاصة بروابط التنقل الرئيسية في صفحة HTML → ___ 22. يمكن استخدام العنصر <section> لتعريف الأقسام المختلفة في صفحة HTML → ___ 23. العنصر <section> في HTML يستخدم لتجميع الكتل النصية المختلفة → ___ 24. OWL تهدف إلى تمثيل البيانات المنطقية وتحقق الاستدلال المنطقي → ___ 21. يمكن كتابة XML schema file أو DTD file في ملفات منفصلة والإشارة إليها في ملفات الـ XML. 22. OWL أداة موجهة، وتُعد من لغات توصيف المفاهيم والاختلافات بين المفردات في النماذج. 23. عنصر <header> يستخدم لتعريف ترويسة الصفحة، بينما عنصر <nav> يستخدم للتنقل داخل الموقع. 24. عنصر <footer> يستخدم لتعريف تذييل الصفحة، ويظهر في أسفل الصفحة فقط في HTML. 25. يستخدم RDF لوصف الموارد والعلاقات بينها في الإنترنت الدلالي. 26. عنصر <article> يستخدم لتحديد محتوى مستقل يمكن إعادة استخدامه أو توزيعه. 27. عنصر <section> يستخدم لتجميع المحتوى في أقسام منطقية داخل صفحة HTML. 28. OWL تستخدم لتمثيل المفاهيم والطبقات وتدعم الاستدلال الآلي. 29. مخطط RDF (RDF Schema) يستخدم لتوصيف وتحديد بنية المصادر والطبقات في النموذج للبحث الدلالي. 30. يمكن لمخطط RDF تحديد الطبقات (Classes)، الخصائص (Properties)، والعلاقات (Relationships) بين الموارد. 31. يتم تخزين البيانات في ملفات RDF بسهولة ويمكن استيرادها في أنظمة مختلفة مثل WordPress. 32. يتم استخدام عناصر التعليق (comment tags) في XML لإضافة تعليقات وملاحظات داخل الملفات. 33. يعد XML أداة لنقل البيانات وليس لصنع محركات البحث في Semantic Web. 34. لا يمكن لعنصر XML أن يحتوي عنوان URL فقط. 35. يمكن استخدام RDF لتحديد الخصائص والقيم المميزة للعنصر الموجود داخل عنصر Description 38. إن الـ root element للمثال بالأعلى هو note. 39. الـ note element يحتوي بداخله فقط على ثلاث عناصر elements. 40. لا يستخدم RDF أكثر من مورد (Resource) واحد فقط. 41. يمكن وصف الـ Super-classes أو sub-Classes بطريق RDF لمحركات البحث. 42. يمكن وصف super-class على أنه sub-class باستخدام rdfs:subClassOf. 43. rdfs:Class rdf:ID=“Person” يستخدم لوصف Class Person 44. الـ Namespace في المثال السابق هو RDF. 45. يحتوي RDF Example على Resource واحد فقط. 46. RDF يستطيع أن يصف الـ Class، Sub-Class، و Property. 47. RDF تم تصميمه ليفهم من قبل أجهزة الكمبيوتر. 48. الـ RDF هو وصف لتخصصات لبيع المنتجات مثل الأسعار وتفاصيل المنتجات. 49. يستخدم النموذج RDF في وصف الـ Resource، Property و Value. 50. من الممكن أن نحول XML tags المحفوظة إلى Attributes أو XML nested Tags.",
    ),
    (
        "امتحان مادة سياسة المعلومات",
        "1. ينبغي أن تتضمن سياسة استخدام شبكة الإنترنت نسب للمالك الأصلي. 2. من أهداف السياسة المعلوماتية تحقيق بيئة معلوماتية فعّالة. 3. يرى البعض أن السياسة المعلوماتية جزء من الاتصالات المؤسسية. 4. لابد من استثمار المعلومات أثناء إعداد السياسة المعلوماتية. 5. تشمل خدمات المعلومات المساعدة في اتخاذ القرار. 6. تعد نظم المعلومات أحد مصادر المعلومات للمؤسسة. 7. من أمثلة البيانات التي تُجمع من بيئة المؤسسة: الاتجاهات الاقتصادية. 8. من العوامل المؤثرة في بناء سياسة معلوماتية فعّالة: ظهور الإنترنت في أواخر 1990م. 9. تساهم العوامل الاجتماعية في بناء سياسة المعلومات. 10. من المتطلبات التقنية لاستخدام الإنترنت في المؤسسة: توفر شبكة داخلية. 11. ينبغي أن تتضمن سياسة استخدام الإنترنت على القيود ورسوم الاستخدام. 12. من عناصر نجاح السياسة المعلوماتية: رضا المستفيدين. 13. يمكن قياس نجاح استخدام شبكات التواصل الاجتماعي من خلال التطبيقات التحليلية. 14. يحق للمؤسسة حجب بعض المواقع عن بعض المستخدمين من استخدام الإنترنت. 15. من العناصر الأساسية والهامة في سياسة المعلومات: حماية الخصوصية. 16. عبارة عن دليل عام أو خطوط عريضة من أهداف السياسة المعلوماتية: أ- الإدارة بالمصادر الحكومية ب- التنسيق ج- العناصر البشرية د- إنشاء قواعد المعلومات ⸻ السؤال 26: من عناصر إنشاء السياسة الوطنية للمعلومات: أ- التنسيق ب- بث المعلومات ج- السرية د- إنشاء قواعد المعلومات ⸻ السؤال 27: يُقاس تقدم المسؤول في الوقت الراهن بما يمتلكه من: أ- رؤية واضحة ب- معلومات ج- موارد بشرية د- خطط مستقبلية ⸻ السؤال 28: من أهم المطلوبات في السياسة المعلوماتية: أ- التنسيق الاجتماعي ب- الخصوصية ج- الارتفاع بمستوى الإنتاجية د- أمن المعلومات ⸻ السؤال 29: أمن المعلومات يوفر… الدائمة للقدرة على اكتشاف الأشخاص الذين حاولوا الوصول إلى البيانات: أ- السرية ب- المراقبة ج- الإتاحة د- التحليل ⸻ السؤال 30: من العناصر الواجب توافرها في سياسة استخدام شبكة الإنترنت: أ- مدة الخدمة ب- مواعيد الخدمة ج- آداب عامة د- سرعة الشبكة",
    ),
    (
        "امتحان مادة تسويق خدمات المعلومات",
        "أولاً: ظلل (أ) صح أو (ب) خطأ للعبارات من (1 - 25) في نموذج الإجابة 1. يعتبر الاسم والوصف والعنوان من أهم بيانات صفحة منصة فيسبوك. 2. يوجد (8) أهداف إعلانية للإعلانات على منصة الفيسبوك. 3. من الأدلة البيانية كالمؤشر على الإنفاق أحد عناصر المزيج التسويقي 7Ps. 4. يتميز التسويق الرقمي بالانتشار الجغرافي الواسع. 5. تُعد الشبكة الإعلانية Display Network أحد أنواع الحملات الإعلانية في جوجل أدز. 6. يمكن ربط صفحات فيسبوك بحساب إنستجرام مخصص. 7. توحد مميزات sales في التعريف بالمنتج أو الخدمة والوصول لأكبر عدد من الجمهور. 8. يعد تحديد نوع الحملة أول خطوة لإنشاء حملة إعلانية على فيسبوك. 9. يتم النطاق الجغرافي حسب النطاقات التالية: يجتهد منشئ المحتوى في اختلافه. 10. يتطلب التسويق الرقمي اللقاء المباشر بين البائع والعميل. 11. STP هو عبارة عن تحليل الهيكل التسويقي المناسب لنموذج الأعمال B2B. 12. يختلف التسويق التقليدي عن الرقمي في الموارد والأسس. 13. توجد اختلاف بين الأهداف وأنواع الحملات الإعلانية على منصة فيسبوك. 14. يعتبر الإعلان الواحد أساسي والآخر مساعد في تصميم الحملات الإعلانية. ثانيًا: اختر الإجابة الصحيحة للفقرات من (33 - 50) في نموذج الإجابة 33. من مميزات التسويق الرقمي: أ) التفاعل الفوري مع الجمهور ب) الإعلانات المكلفة ج) استهداف غير دقيق د) التأخير في النتائج 34. من أدوات التحليل الرباعي SWOT: أ) القوة – الضعف – الفرص – التهديدات ب) التسعير – الترويج – المكان – المنتج ج) السوق – المنتج – الفئة د) لا شيء مما سبق 35. من عناصر المزيج التسويقي الحديث 7Ps: أ) السعر – المكان – المنتج – العرض ب) السعر – المكان – التوزيع – البيئة ج) السعر – المنتج – الأشخاص – العملية د) لا شيء مما سبق 36. تُستخدم إعلانات Lead generation في: أ) زيادة عدد الزيارات للموقع ب) جمع معلومات العملاء المحتملين ج) نشر محتوى توعوي د) عرض المنتجات فقط 37. تُعد أداة Google Trends مفيدة في: أ) تحديد الكلمات المفتاحية الشائعة ب) تصميم الصفحات ج) رفع ترتيب الموقع د) إنشاء مقاطع الفيديو 38. المحتوى التسويقي الذي يهدف إلى بناء علاقة طويلة الأجل مع العملاء هو: أ) محتوى تعليمي ب) محتوى ترفيهي ج) محتوى تحويلي د) محتوى توعوي 39. من خصائص Buyer Persona: أ) شخصية خيالية تمثل العميل المثالي ب) منتج مستهدف ج) أداة تحليل المنافسين د) خطة تسويق 40. تُعد أداة Facebook Pixel مفيدة لـ: أ) تصميم الصور ب) تتبع وتحليل سلوك الزوار ج) تحسين سرعة الموقع د) رفع الفيديوهات 41. من أنواع المحتوى التسويقي المرئي: أ) المقالات ب) الفيديوهات ج) التدوينات د) الملفات الصوتية 42. يستخدم نموذج AIDA في: أ) تحليل السوق ب) مراحل جذب العميل ج) تصميم المنتج د) كتابة التقارير 43. العنصر الذي يعبر عن طريقة تقديم المنتج هو: أ) السعر ب) الأشخاص ج) الترويج د) العرض 44. في التسويق عبر المؤثرين، يُقصد بالمؤثر: أ) الشخص الذي يملك قاعدة جماهيرية ويتفاعل معها ب) مدير الشركة ج) موظف التسويق د) صاحب المنتج 45. المقصود بـ Call to Action: أ) جملة تحث العميل على اتخاذ إجراء ب) تصميم الإعلان ج) الفئة المستهدفة د) تحليل البيانات 46. التسويق بالمحتوى يساعد في: أ) زيادة الوعي بالعلامة التجارية ب) رفع التكاليف ج) تقليل جودة الخدمة د) تجاهل الجمهور 47. من أدوات تصميم الإعلانات: أ) Canva ب) Excel ج) Word د) Outlook 48. العنصر الذي يشير إلى مكان تواجد المنتج هو: أ) السعر ب) التوزيع ج) العرض د) العميل 49. يُفضل تحديد الجمهور المستهدف بناءً على: أ) العمر – الاهتمامات – السلوك ب) جودة المنتج ج) ميزانية الإعلان فقط د) شهرة العلامة التجارية 50. من أشهر المنصات للإعلانات المدفوعة: أ) فيسبوك – جوجل ب) واتساب – زووم ج) تويتر – إكسل د) إنستجرام – وور",
    ),
    (
        "امتحان مادة معمارية المعلومات",
        "مقرر: معمارية المعلومات برنامج تقنية المعلومات والاتصالات – المستوى الثالث الدرجة الكلية للامتحان: 50 درجة السؤال الأول: (50 درجة) اختر الإجابة الصحيحة، وضعها في نموذج الإجابة: 1. لغة برمجة تستخدم بتصميم مواقع الويب – مرئية (ج. جافا فن ورسوم). 2. لغة برمجة كائنية التوجه ظهرت في الفترة (2005 - 1976): (ب. 1991). 3. من أسماء الملفات التي تدل على أنها ملفات بلغة بايثون: (ب. ‎.py). 4. أكثر اللغات استخداماً في التعامل مع البيانات الضخمة والمتنوعة: (أ. Python). 5. الكلمة المفتاحية التي نبدأ بها التعليق في لغة بايثون: (ج. #). 6. لمعرفة كلمات المساعدة في لغة بايثون نستخدم: (ب. help(‘keywords’)). 7. الدالة التي تعيد القيمة الافتراضية للمفتاح: (ج. setdefault()). 8. لتحويل النص إلى حروف صغيرة نستخدم: (أ. ‎.lower()). 9. لحساب عدد مرات ظهور عنصر معين في القائمة نستخدم: (ج. count()). 10. لاستبدال كلمة معينة بكلمة أخرى نستخدم الدالة: (ب. replace()). 11. لتحويل النص إلى حروف كبيرة نستخدم: (أ. ‎.upper()). 12. لمعرفة نوع القيمة نستخدم: (ب. type()). 13. لمعرفة عدد عناصر القائمة نستخدم: (ج. len()). 14. لتحديد نوع الخط ⸻ 27. نوع من النقل يطلق عليه: النقل الفرعي. أ. الأساسي ب. المحلي ج. البحث 28. سرعة تحميل الصفحة تعد من معايير: أ. الإنحياز ب. قابلية الوصول ج. النظام 29. لا ينبغي أن يزيد عدد التحويلات في الـ URL عن: أ. 10 تحويلات ب. 50 تحويل ج. 100 تحويل 30. برنامج متخصص في قياس قابلية الوصول: أ. sitecheck ب. nibbler ج. ally ضع في ورقة الإجابة “✓” إذا كانت العبارة صحيحة و “✗” إذا كانت العبارة خاطئة 31. يتم التعبير عن جمل بسيطة مشابهة للجمل في اللغة الإنجليزية. 32. تتضمن لغة البرمجة HTML قواعد لتخزين وقراءة الملفات وتحليلها. 33. تستخدم لغة HTML لتصميم البيانات وتصميم تطبيقات الموبايل وتطبيقات سطح المكتب. 34. تشمل البيانات الوصفية الشبكات الاجتماعية وحقوق الطبع. 35. تستخدم البيانات الوصفية لتحديد اللون عند زيارة الرابط link بالبرنامج الإلكتروني. 36. تستخدم البيانات الوصفية لبناء المواقع الإلكترونية والإنترنت فقط. 37. يتم استخدام الخريطة المرتبطة بالموقع من أجل صفحات التنقل. 38. تعد خريطة HTML Site map مخصصة لمحركات البحث ولزحف محركات البحث. 39. يهدف الحد من استخدام النص النقي بالصفحة الإلكترونية. 40. يمكن للمستخدم تغيير لون النص والخلفية لزيادة سرعة القراءة. 41. يمكن استخدام العلامات في الـ URL. 42. تستخدم HTTP كبروتوكول محلي ووسيط للمحادثة بين كمبيوتر المستخدم والخادم عبر الإنترنت. 43. الذي كان أول الأسس “لمعمارية المعلومات” هو المهندس المعماري جورج فان روميو. اختر الكود التالي واختر الإجابة الصحيحة للأسئلة من 44 - 50: x = Amr 44. أمر: print(x.islower()) أ. True ب. False ج. amr_ 45. أمر: print(x.swapcase()) أ. aMR ب. AMR. ج. amR_ 46. أمر: print(r in x) أ. 1 ب. 0 ج. False 47. أمر: print(x.upper()) أ. A ب. Amr. ج. AMR 48. أمر: print(x[0]) أ. r ب. A ج. Amr. 49. أمر: print(x.replace(r, any)) أ. Amany ب. Amr. ج. True",
    ),
    (
        "امتحان  مادة اللغة الانجليزية المتخصصة",
        "Choose the correct answer from A), B) or C): 1. His handwriting is ……………………. I cannot read it. C) illegible 2. The children were ……………………. by the game. C) tired 3. Ants have made no progress at all while ………. man has evolved rapidly. C) – (أي بدون أداة تعريف) 4. Some criminals were sent to ……………………. prison for five years. C) – 5. He could not find ……………………. book on the subject. C) any 6. Shakespeare was ……………………. outstanding English poet. B) an 7. In some countries ……………………. carpentry is not an occupation for a girl. C) – 8. …………………. university will be started in this town next year. C) A 9. He bought ……………………. iron and pressed a pair of trousers. C) some 10. She was wearing ……………………. silver bracelet. C) a 11. The shirt he is wearing today is made of ………. silk, but he prefers cotton ones. C) – 12. ………. Arabic spoken in Algeria is not the same Arabic that is spoken in Iraq. C) The 13. He was unable to give us ……………………. advice. C) any 14. ………. Oxygen is essential for life. A) The 22. He showed ………. enthusiasm for his new job. A) an B) many C) Ø (nothing) 23. In some cases, ………. to decide if an organism is a plant or an animal. A) difficult it B) it is difficult C) the difficulty 24. ………. Arabic spoken in Algeria is not the same Arabic that is spoken in Iraq. A) An B) The C) Ø 25. The Humanities concern themselves with the study of ………. A) physical and biological sciences. B) human beings and their culture C) mathematics & computer 26. ………. is a woman who is now divorced. A) wife B) pre-wife C) ex-wife 27. In ………. English we often say ‘Hi’, not ‘Good morning’. A) form B) informal C) formal 28. American actress and director Margret Webster ………. for her production of Shakespearean plays. A) who became famous B) becoming famous C) became famous 29. He has been given a scholarship by the British Council and will go to ………. United Kingdom. A) a B) an C) the 30. The earlier everybody arrives, ………. sooner we can start. A) the B) an C) Ø 31. ………. English language has been influenced by Latin. A) A B) an C) the 32. The children were ………. by the game. A) tiring B) tired C) tire 33. ………. were taken to hospital. A) wounding B) wounded C) wounds 34. To make up one’s mind is to ………. A) decide B) wait C) leave 35. My uncle arrived by ………. train last night. A) a B) the C) many 36. This handwriting is impossible to read. It is ………. A) illegal B) illegible C) illegitimate 37. ………. trees we planted last year have nearly all died. A) A B) The C) An 38. This part of the restaurant is ………. A) non-smoking B) non-smoker C) unsmoking 39. Shopkeepers have to work ………. longer hours than teachers. A) stimulating B) stimulated C) stimulator",
    ),
    (
        "امتحان ميدتيرم لمادة تطبيقات النظم الخبيرة",
        "Course Title: AI and Expert Systems | Level: 3 | Date: 31 - 3 - 2024 | Midterm Exam – 2nd Term 2023/2024 | Total Assessment Marks: 20 | Choose the correct answer among the choices (only one answer for each question): 1. Artificial intelligence is best described as: d. All of the above ✔ | 2. The two most fundamental concerns of AI researchers are: b. Intelligence and Knowledge ✔ | 3. In Turing test, If the interrogator can not distinguish the machine from the human then: a. The machine is not intelligent ✔ | 4. ______ involves knowing how to do something – for example How to install a window: d. Structural knowledge ✔ | 5. Which one of the following is an intelligent behavior? d. All of the above ✔ | 6. Is a science of translating actual knowledge into a format that can be used by the computer? b. Knowledge Representation ✔ | 7. In knowledge type, if you want to know about heart attack, please read this book is example of: a. Declarative knowledge ✔ | 8. Authors think AI falls into ______ main approaches: c. 4 ✔ | 9. In the following semantic Network, which sentence is true? a. Animals are bets and can walk ✔ | 10. In the following semantic Network, which sentence is not true? d. A dog is a bet and is red ✔ | 11. In a two-player games, the static evaluation function is defined as: b. f(n) = win positions – lose positions ✔ | 12. If we identify the goodness of the board configuration to give a move for X, then the evaluation function for node B is: c. 3 ✔ | 13. The evaluation function for node C is: a. 2 ✔ | 14. The search algorithm which is similar to the minimax search, but removes the branches that don’t affect the final output is known as: c. Alpha-beta pruning ✔ | 15. In AI game search problems, a move is classified as not beneficial if: b. Alpha ≥ beta ✔ | 16. Frames are representation technique that evolved from: a. Semantic networks ✔ | 17. Which value is assigned to alpha and beta in the alpha-beta pruning? b. Alpha = min & Beta = min ✔ | 18. In the following graph the value of the top MAX node will be: a. 4 ✔ | 19. What can be inferred from the following ‘Semantic Network’ of family relationships? a. Maha is a sister of Omar ✔ | 20. In the following architecture of AI knowledge cycle the blank number A is: b. Knowledge Representation ✔",
    ),
    (
        "امتحان مادة الارشيفات المتخصصة",
        "امتحان الفصل الدراسي الأول 2023/2024 | المادة: الإرشيفات المتخصصة | كود المادة: IS419 | الدرجة: 60 درجة | التاريخ: 2024/1/14 | اختر الإجابة الصحيحة (2.5 لكل سؤال): 1. ما النوع الصحيح لتخزين القيمة 3.14 في C#؟ د) decimal | 2. ما النوع الصحيح لتعريف متغير نصي (String) في C#؟ أ) string myString; | 3. ما الفرق بين Console.Write() و Console.WriteLine() في C#؟ أ) Console.WriteLine() يقوم بطباعة دوماً فاصلة جديدة بعد النص، بينما Console.Write() لا يقوم بذلك | 4. في C#، كيف يمكنك استخدام if statement لفحص ما إذا كانت قيمة متغير أكبر من 10؟ ج) if (x > 10) / الكود هنا / | 5. ما هو التعبير الصحيح للتحقق من أن قيمة متغير تتراوح بين 18 و30 في C#؟ أ) if (age >= 18 && age < 30) /* الكود هنا / | 6. في C#، ما الفرق بين for و while في هيكل التكرار؟ أ) for يُستخدم لتكرار مع عدد محدد من المرات، بينما while يُستخدم للتكرار حتى تحقيق شرط معين | 7. ما هي الكلمة الرئيسية التي تُستخدم في C# لتعريف وتعيين قيمة للمتغيرات؟ ج) var | 8. كيف يمكن إنشاء دالة (method) في C#؟ ب) void myFunction() { / الكود هنا / } | 9. ما فائدة استخدام الكلمة الرئيسية static عند إعلان دالة في C#؟ أ) تجعل الدالة قابلة للوصول من أي مكان في البرنامج | 10. في C#، كيف يمكن إعلان وتعيين قيمة لمتغير ثابت؟ أ) const int myConstant = 10; | 11. ما هي دالة Console.ReadLine() تقوم بفعله؟ ب) تقوم بقراءة سطر من المستخدم عبر واجهة السطر الأمامي | 12. في C#، كيف يمكنك استخدام foreach للتكرار عبر عناصر مصفوفة؟ ب) foreach (var item in myArray) { / الكود هنا */ }",
    ),
    (
        "امتحان مادة ادارة المجموعات الرقمية",
        "الصفحة الأولى: 1. ما هو الفرع الرئيسي الذي يُستخدم لتمثيل الأعداد الصحيحة في لغة الجافا؟ أ) int | 2. في المقارنة بين equals() و == في الجافا، ما العبارة الصحيحة؟ أ) == يقارن المرجعية، بينما equals() يقارن المحتوى | 4. في المثال التالي، كيف يمكن إنشاء كائن من الفئة Person التي تحتوي على متغيرات name و age؟ ب) Person p = new Person(name, age); | 5. ما هو الفرع الذي يتم استخدامه لتمثيل الأعداد العشرية في لغة الجافا؟ ج) double | 7. في لغة الجافا، كيف يمكن تعريف طريقة (method) تأخذ معاملات؟ ب) int methodName(int x, int y) {...} | لغة الجافا؟ أ) الكائن هو نسخة من الكلاس | 10. ما هي الفائدة من استخدام الكلمة المفتاحية static عند تعريف طريقة (method) في الجافا؟ ب) تشير إلى أن الطريقة تنتمي إلى الكلاس بدلاً من الكائن | 11. في لغة الجافا، ما الذي يمثله الرمز && في عبارة شرطية؟ ج) AND | 12. ما هي الكلمة الرئيسية التي تُستخدم لإنشاء كائن جديد في الجافا؟ الإجابة: new",
    ),
    (
        "امتحان مادة النشر الالكتروني",
        "1. مرحلة الإنتاج هي المرحلة ……. من مراحل تصنيع النشر الإلكتروني. • (أ) الأولى • (ب) الثانية • (ج) الثالثة • (د) الرابعة | 2. النشر ……. هو أحد الطرق لتقديم النشر الإلكتروني. • (أ) التقليدي • (ب) المكتبي • (ج) الإلكتروني • (د) الذاتي | 3. من أهم مميزات النشر الإلكتروني ما يلي: • (أ) انخفاض التكاليف • (ب) زيادة عدد الصفحات • (ج) ارتفاع ثمن الكتاب • (د) صعوبة الحصول عليه | 4. يبدأ ظهور النشر الإلكتروني في مرحلة ……. • (أ) التأليف • (ب) الإنتاج • (ج) التسويق والتوزيع • (د) جميع ما سبق | 5. داخل تصنيع النشر الإلكتروني، المرحلة ……. • (أ) الثانية • (ب) الثالثة • (ج) الرابعة • (د) الخامسة | 6. النشر الإلكتروني الموازي هو أحد أنواع النشر • (أ) مصدر النشر • (ب) علاقة بالنصوص المطبوعة • (ج) النشر الإلكتروني • (د) علاقته بالطباعة التقليدية | 7. من مميزات الطباعة عند الطلب طباعته: • (أ) العلمية • (ب) المحلية • (ج) الأدبية • (د) النادرة | 8. يمكن تسويق في أي مكان ……. • (أ) المكتبي • (ب) الإلكتروني • (ج) المطبعي • (د) المحلي | 9. يقدم برنامج flip pdf professional تحويل ملفات ……. إلى كتب إلكترونية بتقليب الصفحات: • (أ) word • (ب) pdf • (ج) html • (د) جميع ما سبق | 10. في النشر ……. يحصل المؤلف على مقابل مادي • (أ) الذاتي • (ب) 80% من إيرادات الكتاب • (ج) المكتبي • (د) التقليدي | 11. ……. يعد من أهم مميزات النشر الإلكتروني • (أ) التشويق • (ب) التشعبية • (ج) التفاعلية • (د) الطابع الفني | 12. مكان إدراج المادة العلمية والمعلومات هي مرحلة ……. • (أ) الإنتاج • (ب) التأليف • (ج) التصميم • (د) التوزيع | 13. من عيوب النشر الإلكتروني في الوقت الحالي • (أ) المميزات • (ب) السهولة • (ج) التفاعلية • (د) الصعوبات | 14. عبر برامج التصميم الحديثة يتم معالجة عناصر النشر الإلكتروني بالنسبة ……. • (أ) للصور والرسوم • (ب) للبيانات • (ج) للنصوص • (د) للفيديوهات | 15. من الضروري مراعاة ……. في مرحلة جمع المعلومات الإلكترونية • (أ) العشوائية • (ب) التنسيق • (ج) التفاعلية • (د) المصداقية | 16. يمكن الاستفادة من ……. في نشر غلافة الكتب • (أ) الملفات الشخصية • (ب) المجموعات • (ج) الألبومات والصور • (د) pages | 17. من مسؤوليات أجهزة الطباعة …….، أنها تقتصر مراحل النشر في خطوة واحدة • (أ) الحديثة • (ب) الورقية • (ج) الإلكترونية • (د) الذاتية | 18. يمكن الاستفادة من ……. في التعريف بالكتب على صفحات ومجموعات أعضاء الشبكات الاجتماعية • (أ) الملفات الشخصية • (ب) المجموعات • (ج) الألبومات والصور • (د) pages | 19. في برنامج kotobee يمكن تصدير الكتاب إلى كتبي • (أ) المكتبي • (ب) السحابي • (ج) التطبيقات المصغرة • (د) القارئ | 20. النشر الإلكتروني: عملية النشر تتم مباشرة أو من خلال شبكات الاتصال ……. • (أ) السمعية • (ب) البصرية • (ج) الأرضية • (د) الإلكترونية | 21. من أهم عناصر برنامج kotobee إضافة العلامة المائية للكتاب. • (صح / خطأ) | 22. النشر الإلكتروني يطلق على الإبداع الإلكتروني لجانب المؤلف دون وساطة من جانب الناشر. • (صح / خطأ) | 23. من سمات النشر الإلكتروني: صعوبة تحديد وتطبيق حقوق الملكية الفكرية. • (صح / خطأ) | 24. من الحاجات للموزعين من أهم مميزات النشر الإلكتروني بالنسبة للمستخدم. • (صح / خطأ) | 25. النشر الذاتي هو مصطلح يطلق على الإبداع الإلكتروني لجانب المؤلف دون وساطة من جانب الناشر. • (صح / خطأ)",
    ),
    (
        "امتحان مادة ادارة الشبكات",
        "جامعة طنطا - كلية الآداب - برنامج تقنية المعلومات اختبار نهاية الفصل في مادة (إدارة شبكات) - الفرقة الثانية مكثف - ترم 1 - الفصل الدراسي الأول يناير 2024 (عدد الأسئلة 30 سؤالاً موضوعياً (إجمالي الدرجات 60، درجتان لكل سؤال)) ظلل الإجابة الصحيحة في نموذج الإجابة. 1. مخاطر IT تشمل: أ) عدم كفاءة التشغيل ب) نقص الميزانية ج) كل ما سبق | 2. التعافي التشغيلي والاسترجاع في حالة الكوارث أ) جزء من إدارة IT ب) خطأ | 3. عملية الدعم الفني لا تتضمن تقييم مخاطر IT أ) صح ب) خطأ | 4. من أهداف إدارة المخاطر: أ) الحرائق المالية ب) تقليل الأضرار ج) الحماية من الفيروسات | 5. لا يمكن تحديد التسامح في إدارة المخاطر أ) صح ب) خطأ | 6. تقييم إجراءات الحد من المخاطر أ) ضروري ب) غير ضروري | 7. ليس ضرورياً وضع خطة للحد من تأثير مخاطر تكنولوجيا المعلومات أ) صح ب) خطأ | 8. معايير وأطر إدارة تكنولوجيا المعلومات تستخدم أ) عند التوقف الإدارة وحوكمة تكنولوجيا المعلومات ب) أدوات التدقيق والمراجعة المتخصصة ج) قابلة لقياس مدى تقدم المؤسسات لأهدافها | 9. مخاطر تكنولوجيا المعلومات لأهدافها: أ) يتم تصنيفها ب) لا يتم تصنيفها ج) خطأ | 10. تتم المعايير من جانب المؤسسات نفسها مثل: أ) تخطيط وتنفيذ تكنولوجيا المعلومات ب) تقييم وتطوير تكنولوجيا المعلومات ج) كل ما سبق | 11. مخاطر التشغيل: أ) تعطل الأجهزة والبرامج ب) الوصول غير المصرح به ج) كل ذلك صحيح | 12. من معايير هيكلة تكنولوجيا المعلومات المحلية: أ) معيار مكتبة البنية الأساسية لتكنولوجيا المعلومات ب) معيار تكنولوجيا المعلومات لإدارة الخدمات ج) معيار الآيزو IEC20000 | 13. معيار إدارة تكنولوجيا المعلومات تعني: أ) أنها تدار وفقاً، والتعامل مع كمصدر ب) خطأ | 14. معيار كوبت لتكنولوجيا المعلومات COBIT: أ) يتم تطبيقه في بعض من النشاطات ب) يتم تطبيقه بالكامل ج) معيار غير نوعي | 15. لا يوجد فرق بين حوكمة وإدارة تكنولوجيا المعلومات: أ) صح ب) خطأ | 16. معيار إدارة تكنولوجيا المعلومات يحتوي أو يتطلب على عدة تكاليف: أ) صح ب) خطأ | 17. يمكن تحديد عدد مسؤولي الدعم الفني من خصائص: أ) معيار عددي ب) معيار نوعي ج) معيار غير نوعي | 18. تعتبر الموظفين مهارات وخبرات عالية، تدخل ضمن: أ) معيار عددي ب) معيار نوعي ج) كل ما سبق | 19. تشمل أدوات القياس، البيانات، الوقت، تكون: أ) معيار عددي ب) معيار نوعي ج) معيار غير نوعي | 20. تعتبر الأجهزة والبرمجيات مكلفة جداً: أ) كفاءة الأداء ب) تكلفة IT ج) معيار عددي | 21. تعني حوكمة تكنولوجيا المعلومات أن تكون مركزية: أ) صح ب) خطأ | 22. هي من بيانات رسمي بقواعد عمل IT: أ) أهداف تكنولوجيا المعلومات ب) سياسة تكنولوجيا المعلومات | 23. الموظفين والمستخدمين: أ) الموظفين ب) للمستخدمين ج) لكل من هما | 24. من عناصر إعداد سياسة IT: أ) العمليات والخدمات ب) الإجراءات ج) الأسلوب وموضوع الصياغة | 25. من عناصر إعداد سياسة تكنولوجيا المعلومات: أ) القبول النفسي للسياسة ب) أهداف تكنولوجيا المعلومات ج) المرونة | 26. من عناصر إعداد سياسة تكنولوجيا المعلومات: أ) القبول الإيجابي ب) أهداف تكنولوجيا المعلومات ج) المرونة | 27. من عناصر إعداد سياسة تكنولوجيا المعلومات: أ) القبول الإيجابي ب) بساطة ووضوح الصياغة ج) تحديد متطلبات الصياغة | 28. تشتمل الحلول على مشاكل: أ) الأجهزة والبرامج ب) الشبكة ج) كل ما سبق | 29. العلاقة بين البرامج والسياسات تُفضل أن تبدأ أهداف إدارة وحوكمة IT: أ) صح ب) خطأ | 30. يسمح عدد الأجهزة باستخدام الموظفين لتكنولوجيا المعلومات في أوقات العمل والراحة يسمى: أ) الكلفة العددية ب) الكلفة النوعية ج) حوكمة IT",
    ),
    (
        "امتحان مادة شبكات الحاسوب",
        "الامتحان النهائي لمادة شبكات الحاسوب – المرحلة الأولى للعام الدراسي (2022 – 2023) عدد الأسئلة 50 سؤال – درجة كل سؤال 2 درجة – درجة الاختبار الكلية 100 نموذج (1) زمن الاختبار ساعتان نموذج (1) أولاً: ظلل (أ) صح أو (ب) خطأ للعبارات (1 - 25) في نموذج الإجابة 1. من أهداف شبكات الحاسوب مشاركة البيانات والموارد. (أ) 2. التوصيل على التوالي لا تتأثر الشبكة بحدوث تصادم في نفس الوقت بسبب ضعف احتمال تصادم Collision. (ب) 3. تعمل Gigabit Ethernet بسرعة 1000 ميغابت/ثانية. (أ) 4. يعمل المكرر Repeater في الطبقة الثانية من نموذج OSI. (ب) 5. تعد تقنية الإرسال Broadcast من أنواع التصادم Collision. (ب) 6. عنوان MAC Address يتم تعيينه للإرسال من طبقة Data Link Layer. (أ) 7. تعد Routing من وظائف طبقة الشبكة. (أ) 8. بنية Star تعد أكثر بنى الشبكة استخداماً في الوقت الحاضر. (أ) 9. Bandwidth هو العامل المؤثر في أداء الشبكة. (أ) 10. يستخدم الكيبل المستقيم (Straight Through) لربط جهاز كمبيوتر بجهاز موزع الشبكة (Hub أو Switch). (أ) 11. طول عنوان IPv4 هو 32 بت. (أ) 12. بروتوكول TCP اعتمادي لأنه يضمن وصول البيانات إلى المستقبل. (أ) 13. الترتيب التسلسلي لنموذج OSI يبدأ من الطبقات العليا إلى السفلى. (ب) 14. الدور الرئيسي للمكرر Repeater هو جهاز يقوم بتضخيم أو إعادة توليد الإشارة الضعيفة أو التالفة. (أ) 15. عدد المنافذ المستخدمة التي يتم توصيلها عبر Hub يكون من 12 منفذ هو ……… 16. طبقة العرض في نموذج OSI تهتم بكيفية تقديم وعرض البيانات بشكل يمكن استيعابه من المستقبل. (أ) 17. الطريقة الشائعة هي بالتسليم من تطبيق إلى Application to Application. (أ) 18. المصطلح الذي يتم اختصاره ل IPv4 هو International Programming V4. (ب) 19. القيمه في IP Subnet Mask 255.0.0.0 تمثل …………… 20. Bandwidth هو الحد الأقصى من البيانات التي يمكن إرسالها عبر الاتصال في وقت معين. (أ) 21. بروتوكول TCP هو من نوع Connection-Oriented. (أ) 22. الطبقة المسؤولة عن التوجيه Routing في نموذج OSI هي طبقة الشبكة. (أ) 23. البروتوكول هو مجموعة من القواعد التي تتحكم بكيفية الاتصال. (أ) 24. يعمل المبدل Switch في الطبقة الثانية في نموذج OSI. (أ) 25. طبقة النقل في نموذج OSI هي المسؤولة عن توصيل البيانات. (أ) ثانياً: اختر الإجابة الصحيحة للفقرة من (26 - 50) في نموذج الإجابة 26. الترتيب المنطقي أو الهيكلية لشبكة يدعى: (أ) التوجيه Routing (ب) الطوبولوجي Topology (ج) الشبكات Networking 27. من أشهر أنواع البروتوكولات في طبقة النقل: (أ) HTTP (ب) SMTP (ج) TCP 28. مجموعة من القواعد التي تحدد كيفية تبادل البيانات: (أ) البروتوكولات Protocols (ب) القوانين Rules (ج) المعايير Standards 29. أي مما يلي هو عنوان IPv4 صحيح؟ (أ) 192.168.10.101 (ب) 267.202.30.1.65 (ج) 300.142.215.66 30. يتبع المبدل Switch في نموذج OSI: (أ) الطبقة الفيزيائية (ب) الطبقة الثانية (ج) الطبقة السابعة 31. أي من أنواع الطوبولوجيا التالية يتم فيها توصيل جميع الأجهزة على كابل مشترك؟ (أ) Ring (ب) Bus (ج) Star 32. جهاز يتم وضعه عند نقطة الاتصال بين الشبكات ويقوم بمنع أو سماح مرور البيانات: (أ) Firewall (ب) Router (ج) Hub 33. أي من العناوين التالية يتبع الفئة C؟ (أ) 192.168.10.10 (ب) 121.140.12.28 (ج) 132.110.12.5 34. أصغر وحدة لقياس البيانات هي: (أ) Frames (ب) Bits (ج) Packets 35. يمكن أن يتم إرسال البيانات للإرسال عبر ……………… (أ) البث الإذاعي (ب) كل من المذكورين (ج) التوصيل النقطي 36. بروتوكول HTTP يعمل على الطبقة: (أ) الفيزيائية (ب) النقل (ج) التطبيق 37. عدد المنافذ التي يتم توصيلها عبر Switch يكون من 16 منفذ هو ………… 38. ما هو نوع كابل يستخدم لنقل البيانات لمسافات طويلة؟ (أ) 10Base-FL (ب) 10Base2 (ج) 10Base-T 39. سرعة الإيثرنت السريع Fast Ethernet لنقل البيانات تعمل بمعدل: (أ) ميغابت/ثانية (ب) 100 (ج) 1000 40. عنوان IP يكون من بايت يحتوي على ………… (أ) عنوان الشبكة فقط (ب) عنوان المضيف فقط (ج) عنوان الشبكة وعنوان المضيف 41. هل النطاق الترددي Bandwidth هو الفرق بين الترددات العالية والمنخفضة؟ (أ) كل ما سبق (ب) الإشارة فقط 42. أي جزء من أجزاء إطار الإيثرنت Ethernet Frame يحتوي على عنوان المرسل والمستلم؟ (أ) Preamble (ب) Address (ج) FCS 43. يتم إرسال البيانات المرسلة عبر الشبكة في ………… ويتم تقسيمها في طبقة النقل: (أ) البتات Bits (ب) الطبقة الفيزيائية (ج) الحزم Packets 44. الشبكة التي تغطي مدينة كاملة وتصل المكاتب والدور في أنحاء المدينة هي: (أ) LAN (ب) WAN (ج) MAN 45. من أشهر بروتوكولات طبقة النقل المستخدمة: (أ) HTTP, UDP (ب) FTP, TCP (ج) UDP, TCP 46. ما هو اختصار WAN؟ (أ) World Area Network (ب) Wide Area Network (ج) Web Area Network 47. ما هو الإصدار المستخدم في الأسلاك النحاسية؟ (أ) 10Base5 (ب) 10Base-T (ج) 100Base-TX 48. ما هو أشهر بروتوكول يستخدم في الشبكات الداخلية LAN؟ (أ) Token Ring (ب) Ethernet (ج) لا شيء مما سبق 49. في وسائط النقل التي توفر أعلى سرعة لنقل البيانات؟ (أ) الكابل المحوري (ب) كابل الزوج الملتوي (ج) كابل الألياف الضوئية 50. كل جهاز متصل بشبكة إنترنت له عنوان غير متكرر على شكل: (أ) اسم (ب) عنوان خاص (ج) 32 بت",
    ),
    (
        "امتحان مادة المصادر المرجعية الرقمية",
        "عدد الأسئلة: 50 سؤالًا، ولكل سؤال درجة واحدة (درجة واحدة لكل سؤال) نموذج الإجابة - الإجابة الصحيحة لكل سؤال مما يلي: 1. تحليل مقالات الدوريات، وتجمع لها تحت عناوين موضوعية … (ج) الكشافات الببليوغرافية 2. تُعد المستخلصات … (ب) تلخيصًا للمحتويات 3. معلومات أولية عن موضوع ما، يُجزء إزاء ما … (ب) مقابل للمادة 4. تُرجع الباحث إلى وعاء المعلومات الأصلي الذي وردت فيه المادة … (أ) المراجع المباشرة 5. المصادر المرجعية غير المباشرة … (ب) الأذن في المراجع غير المباشرة 6. يُسهل تحليل المعلومات بالإضافة والدقة في … (أ) المراجع المباشرة 7. أهم الأدلة التي تقدم معلومات عن الجمعيات … (ج) الأدلة 8. تُعد من الأدلة التعليمية والثقافية … (ب) الأدلة التعليمية والثقافية 9. يُرجع إليها للحصول على معلومات عن جامعة ما … (أ) الأدلة للجمعيات المهنية 10. تقدم أدلة الجمعيات المهنية معلومات عن … (ج) النقابات 11. يستفاد منها للحصول على معلومات عن جمعية وهيئة … (ب) الأدلة للخدمات العامة 12. تُعد الكتب السنوية بتقديم معلومات … (ب) حديثة ومرتبطة 13. تُعد الكتب السنوية على هيئة … (ج) إجابات مباشرة عن أسئلة محددة 14. من توثيق معلومات المصادر المرجعية الرقمية عن عناصر … (ب) كتب الحقائق 15. تقدم الكتب الحقائق معلومات عن … (د) القوانين والقرارات 16. تُعد الأدلة … (أ) كتب الحقائق الأدبية 17. تساعد الكتب الإرشادية في معرفة … (ج) إنجاز نشاط معين 18. يُعد من أنواع المعاجم … (ج) الشخصيات البارزة 19. تُقدم معلومات عن الأفراد والعلم والمعلم الجغرافي … (ب) معاجم التراجم 20. معنى كلمة بيانات ووعاء معلومات … (ب) موقع دولة ما 21. يُمكن التعرف على موقع جبل ما … (أ) الأطالس 22. تُعد الأطالس من أنواع … (ج) الكشافات 23. يُعد من خلالها التعرف على تراجم لشؤون شخص ما … (ب) معاجم التراجم 24. في العين، والألم، والمشكلات الصحية … (ب) المراجع المباشرة 25. المرجع الذي توجه المستفيد لمصادر المعلومات التي تتناول على سبيل المثال … (أ) المراجع المباشرة 26. من المراجع المطبوعة … (ج) المراجع غير المباشرة 27. تُعد من المراجع التي تُصنف على معلومات مرتبة بطريقة ما، وتُعد … (ب) المراجع غير المباشرة طبيعه الاستخدام المتميزة للمصادر المرجعية تعني (أ) القراءة الكاملة (ب) الاستشارة السريعة (ج) التنظيم من خصائص المصادر المرجعية (أ) القراءة الكاملة (ب) التركيز والاختصار (ج) التعقيد تحصر مصادر المعلومات المتاحة على الإنترنت (أ) الببليوغرافيات (ب) المراجع الرقمية (ج) الويبجرافيات تتميز المراجع الرقمية عن نظيرتها المطبوعة في (أ) إمكانيات البحث والاسترجاع (ب) طبيعة المعلومات (ج) الأنواع يميز المراجع الرقمية (أ) بطء الاسترجاع (ب) فردية الاستخدام (ج) جماعية الاستخدام تخلو المراجع القديمة عند استخدامها عن القيود (أ) المكانية (ب) الزمنية (ج) المكانية والزمانية المراجع التي تقدم للمستفيد ما يحتاج إليه من معلومات بشكل فوري (أ) المراجع المباشرة (ب) المراجع المطبوعة (ج) المراجع غير المباشرة من نماذج المراجع غير المباشرة (أ) الأدلة (ب) المعاجم اللغوية (ج) الببليوغرافيات يسهل قياس معدل الاستخدام في حالة (أ) المراجع المباشرة (ب) المراجع الرقمية (ج) المراجع غير المباشرة ترتفع القدرة الاستيعابية للمعلومات في حالة (أ) المراجع المباشرة (ب) المراجع الرقمية (ج) المراجع غير المباشرة تنعدم إمكانية الربط بين مداخل البحث والاسترجاع في (أ) المراجع المباشرة (ب) المراجع المطبوعة (ج) المراجع الرقمية يتم اللجوء لدوائر المعارف التماساً للمعلومات (أ) وافية (ب) تفصيلية (ج) أولية نوع من المراجع يهتم بتقديم خلفية عامة عن موضوع ما (أ) الأطالس (ب) دوائر المعارف (ج) المعاجم اللغوية تعطي معنى لفظ ما ومرادفه ومقابله في لغة أخرى أو بعض مما سبق (أ) المعاجم اللغوية (ب) المعاجم الاصطلاحية (ج) الأدلة تختص المعاجم الاصطلاحية بتقديم معلومات عن (أ) الأشخاص البارزين (ب) المصطلحات (ج) الهيئات",
    ),
    (
        "امتحان مادة تجهيز ومعالجة المعلومات",
        "كلية الآداب – قسم المكتبات والوثائق والمعلومات - البرنامج المميز لتكنولوجيا المعلومات والمكتبات - جامعة طنطا - اسم المقرر: تجهيز ومعالجة المعلومات - كود المقرر: IS123 - زمن الامتحان: ساعتين - عدد الصفحات: 2 - تاريخ: 2023/6/7 - امتحان نهاية الفصل الدراسي الثاني 2023/2022 - السؤال الأول: (اختر الإجابة الصحيحة) (30 درجة): 1. تستخدم الحاسبات لمعرفة أكبر كمية من البيانات، فإن الوحدة المسئولة عن إنجاز ذلك هي: أ. الذاكرة ب. وحدة الحساب والمنطق ج. وحدة التحكم د. وحدة التخزين - 2. من وحدات إدخال المعلومات إلى الحاسب الآلي: أ. الطابعة ب. الفأرة ج. السماعات د. الشاشة - 3. وحدة واحدة فقط من بين الآتي يمكن استخدامها لإخراج البيانات من الحاسب: أ. لوحة المفاتيح ب. الفأرة ج. الشاشة د. الماسح الضوئي - 4. من وسائل إدخال البيانات من جهاز الحاسب الآلي: أ. السماعات ب. الشاشة ج. الماسح الضوئي د. الطابعة - 5. عند كتابة الأوامر للحاسب بلغة يفهمها، فإن المستخدم يعتمد على: أ. لغة البرمجة ب. الذاكرة ج. الفرص المحلي د. لغة الآلة - 6. تحتفظ ذاكرة القراءة فقط بالمعلومات: أ. لا يمكن تعديلها ب. تظل موجودة في حالة انقطاع التيار ج. يمكن التعديل عليها د. جميع ما سبق - 7. عند إدخال البيانات، فإن المستخدم يعتمد على: أ. لوحة المفاتيح ب. المسارات ج. الفأرة د. ليس أيا مما سبق - 8. نظام يقوم على قاعدة بيانات بالموقع لتحديث البيانات عن الفرص المتاحة: أ. النظام الذكي ب. النظام الثاني ج. نظام الملفات د. نظام المعالجة - 9. نظام المعلومات ………. من نظم المعلومات، وهدفه يتمثل في معرفة كيفية تطبيق النظام في الواقع: أ. الذكية ب. المعالجة ج. التحليل د. التنفيذ - 10. ………. هي المرحلة الأولى في دورة حياة نظام المعلومات، ويهدف فيها معرفة كيفية تطبيق النظام في الواقع: أ. التحليل ب. التصميم ج. التنفيذ د. التخطيط - 11. عند تصميم نظم المعلومات يتم الاعتماد على: أ. التخطيط ب. التنفيذ ج. التحليل د. التصميم - 12. يقوم مخطط البيانات في نظم المعلومات على: أ. التصميم ب. التخطيط ج. التنفيذ د. التحليل - 13. عبارة عن نظام معلومات يعتمد على خبرة الإنسان، ويتم ذلك من خلال استنتاج خبرات سابقة، واستنباط قرارات جديدة بناء على مواقف وأحداث: أ. نظم معالجة البيانات ب. النظم الخبيرة ج. نظم اتخاذ القرار د. نظم الدعم الإداري - 14. من خصائص نظم المعلومات الإدارية أنها تعتمد على: أ. السرعة ب. السهولة ج. نظم اتخاذ القرار د. نظم المعلومات الإدارية - السؤال الثاني: اختر من البدائل المناسبة: 16. تعتبر ………. من مكونات قاعدة البيانات العلائقية: أ. الجداول ب. العلاقات ج. الحقول د. جميع ما سبق - مخطط ER مرفق مع نموذج يخص مركز طبي: 17. سجل التنويم = 18. مريض = 19. طبيب = 20. تخصص = - السؤال الثالث: صحح الخطأ إن وجد (ظلِّل “أ” إذا صواب أو “ب” إذا خطأ): 21. يتم إدخال الأوامر إلى الحاسب من خلال أجهزة الإخراج - 22. تعد الطابعة من أجهزة الإدخال - 23. يحتوي نظام الملفات على أكثر من نوع من تنسيق المعلومات - 24. لا يمكن استعادة الملفات التي تم حذفها من قاعدة البيانات - 25. نظام الملفات أقل كفاءة من قواعد البيانات - 26. يعتبر Microsoft Access نظاماً من قواعد البيانات - 27. يتم استخدام نموذج الكيانات والعلاقات (Entity-Relationship) في أثناء مرحلة تصميم المفاهيم - 28. يتم تمثيل الكيان في نموذج الكيانات والعلاقات عن طريق استخدام شكل بيضاوي - 29. يتم تمثيل العلاقة في نموذج الكيانات والعلاقات عن طريق استخدام معين - 30. يمكن أن يحتوي الجدول على أكثر من مفتاح رئيسي (Primary Key) - 31. يمكن أن تحتوي كل خلية على أكثر من قيمة في وقت واحد - 32. تأخذ القيم الفارغة (Null) أكثر من قيمة - 33. الرقم الثنائي (101010) يعادل الرقم 53 بالنظام العشري - 34. الرقم (543) بالنظام العشري يعادل الرقم (1000011111) بالنظام الثنائي - 35. الرقم (1110111) بالنظام الثنائي يعادل الرقم (119) بالنظام العشري - 36. الرقم (1010111) بالنظام الثنائي يعادل الرقم 215 بالنظام العشري",
    ),
    (
        "امتحان مادة مصادر المعلومات الرقمية",
        "جامعة طنطا – كلية الآداب برنامج تقنية المعلومات والمكتبات الامتحان النهائي دور يناير 2023 مقرر مصادر المعلومات الرقمية المستوى الأول نموذج (2) الدرجة الكلية 50 عدد الأسئلة: 50 سؤالاً - ظلل الإجابة الصحيحة للأسئلة الآتية بورقة الإجابة: 1. أحد وسائط تخزين النصوص: أ. الجويبات ب. المجلات ج. الويكيات 2. سلسلة من أجهزة القراءة أتاحتها شركة أمازون عام 2007: . NOOK ب. kindle ج. (PRS-T3) 3. قالب يعرض التفاصيل الخاصة بالصورة وتنسيقات الخط: أ. Djvu ب. PDF ج. (Plain text) 4. من صيغ الملفات لعرض الكتب بصيغة: أ. HTML ب. PDF ج. Djvu 5. أصغر عنصر مكون للصورة أو لفتات الإدخال: أ. Pixel ب. voxel ج. bit 6. وسيط تخزين ضوئي من حيث النوع، أطلق في نوفمبر 2019: أ. CD ب. Silica ج. HD 7. الجهاز المركزي التالي هو عبارة عن لوحة التحكم الموجودة ضمن لوحة الأوامر: أ. الإحصائية ب. البيولوجية ج. النسبية 8. الكيلوبايت تساوي 1024: أ. ميجابايت ب. بيت ج. بايت 9. قاموس متخصص في مصطلحات الحاسب: أ. TechTerms ب. AllAcronyms ج. Edusearch 10. مصادر تشتهر باستخدام قواعد البيانات في تحقيق الرؤية: أ. المجلات ب. الويكيات ج. الجرائد التجارية 11. من أمثلة وسائط التخزين غير التقليدية: أ. Silica ب. SSD ج. HD 12. نوع صحيح من أجهزة التخزين: أ. BD-R ب. HD ج. CD-RW 13. قابل للتنزيل بالسماح باستخدام الدورات التي تنشرها مجانًا وتعرض بالمجان: أ. الأبيض ب. الأخضر ج. الأزرق 14. الجهاز المركزي التالي هو عبارة عن لوحة التحكم الموجودة ضمن لوحة الأوامر والوقتات: أ. الوظيفة ب. المهام ج. النتيجة 15. يمكن إعادة كتابة المعلومات وتخزينها على: أ. الذاكرة المؤقتة ب. الذاكرة الوسيطة ج. الذاكرة الابتدائية 16. وسيط تخزين بـ 74 دقيقة للتخزين: أ. أقراص الفيديو ب. أقراص الليزر ج. أقراص الكومبيكت 17. يدل عليه مضاعف السعة التخزينية للإبداع: أ. القرص المضغوط ب. القرص المدمج ج. القرص السبع 18. أقل وسيط تخزين من حيث السعة التخزينية: أ. القرص المضغوط ب. القرص السبع ج. القرص المرن 19. عنصر الصورة وهو على شكل نقطة أو مستطيل صغير: أ. البت ب. البوكسل ج. البكسل 20. وسط تخزين يحظى بالدعم والتطوير من قبل أكثر من 170 شركة عالمية: أ. BD ب. CD ج. HD-DVD 21. تساوي 1024 تيرابايت: أ. الجيجابايت ب. البيانات ج. الحجبات 22. تسمى وحدة التخزين في الحاسب الآلي: أ. البت ب. البايت ج. الكيلوبايت 23. قرص صلب يتميز بتحمل عالي لدرجات الحرارة والاهتزاز: أ. HD ب. BD ج. SSD 24. مكون أساسي بالحاسب الآلي يستخدم في تخزين البيانات وتثبيت البرامج: أ. المعالج ب. الصلب ج. البصين 25. وسيط تخزين تصل سعته التخزينية إلى 360 تيرابايت: أ. DVD ب. SSD ج. Memory Crystal 26. يمثل موقع Egypt yellow …………..: أ. قاموس ب. موسوعة ج. دليل بالشركات 27. يعني Virtual book: أ. الإلكتروني ب. الافتراضي ج. القابل للتحميل 28. وثيقة رقمية نص كتابي، يمكن قراءته على الشاشة: أ. الوظيفة ب. الكتاب الإلكتروني ج. المدونات 29. المصطلح الذي يطلق على الكتاب الإلكتروني التفاعلي: أ. E-book ب. Online book ج. Web book 30. المصطلح الذي يطلق على الكتاب الإلكتروني الذي توفره شركة مايكروسوفت: أ. E-book ب. Online book ج. Web book 31. يتم نسخ البيانات بشكل احتياطي خلال دقائق: أ. القرص المضغوط ب. القرص الصلب ج. القرص المرن 32. يتمتع القرص الصلب بسرعة التخزين ولكن سعة التخزين أكبر: أ. القرص المضغوط ب. القرص المرن ج. القرص الصلب 33. من عناصر الصورة وهو على شكل نقطة أو مستطيل صغير: أ. البت ب. البكسل ج. الكيلو بايت 34. وسط تخزين يصل سعته التخزينية لـ 750 جيجابايت: أ. BD ب. Floppy Disk ج. CD 35. من أشكال الكتب الإلكترونية الطبعة الورقية: أ. القراءة على CD ب. مجانية ج. القراءة فقط 36. أحد أنواع المدونات ذات الصبغة غير الصحفية: أ. blogger ب. word press ج. userland 37. تتميز كل مدونة بمظهر مختلف وأسلوب مختلف: أ. التصميمات ب. التطبيقات ج. الارتباطات 38. من المدونات التي تحتوي على روابط لصفحات أخرى: أ. القارئات ب. التفاعلية ج. الارتباطية 39. يمكن من خلال كل وسائط التخزين نقل الملفات: أ. SSD ب. USB ج. CD 40. الطالبات والمساحات الصوتية تستخدم ناقل USB من نوع: أ. A ب. B ج. Micro 41. أجهزة الموبايل والكاميرا الرقمية تستخدم ناقل USB من نوع: أ. A ب. B ج. Micro 42. يطلق على الجيل القادم للأقراص المدمجة: أ. BD ب. HDDVD ج. CD 43. من عيوب المدونات عدم دقة المعلومات الواردة بها: أ. العبارة صحيحة ب. العبارة خاطئة 44. يتم DVD أكبر في السعة التخزينية من قرص CD: أ. العبارة صحيحة ب. العبارة خاطئة 45. الكتاب الإلكتروني غير مناسب لذوي الاحتياجات الخاصة: أ. العبارة صحيحة ب. العبارة خاطئة 46. يتميز الحاسب SSD باختيار بسرعة الاستجابة وتغير وعناية بسيطة الشكل: أ. العبارة صحيحة ب. العبارة خاطئة 47. يتم تصنيف مصادر المعلومات إلى مصادر مباشرة يمكن التعامل معها مباشرة: أ. العبارة صحيحة ب. العبارة خاطئة 48. المصادر الواعية هي التي تعمل على الحفاظ على البيئة: أ. العبارة صحيحة ب. العبارة خاطئة 49. وسائط الاتصال أحد أشكال وسائل الحصول على مصادر المعلومات الإلكترونية: أ. العبارة صحيحة ب. العبارة خاطئة 50. الاشتراك في شبكات عالمية من أحد أشكال وسائل الحصول على مصادر المعلومات الإلكترونية: أ. العبارة صحيحة ب. العبارة خاطئة",
    ),
    (
        "امتحان مادة اخلاقيات المعلومات",
        "نموذج (٢) اختر الإجابة الصحيحة للفقرات من (١ - ٣٠): 1. كل سلوك غير مشروع أو غير أخلاقي يتعلق بالمعاملة الآلية للبيانات: • (ج) أخلاقيات مهنة المعلومات 2. من القيم والمبادئ التي تحكم النشاط المعلوماتي في مؤسسات المعلومات: • (ب) أخلاقيات المعلومات 3. بعض الدوريات تصدر بأرقام دولية للكتب أو الدوريات المطبوعة، ومن أمثلتها: • (ب) ISSN 4. ألفاظ مرتبطة بالمهن: • (ج) أخلاقيات المهنة 5. من البرامج التي تطلق عليها القراصنة: • (أ) فيروسات الحاسب 6. تنتمي حقوق المؤلف والحقوق المجاورة إلى فئة: • (ب) حقوق الملكية الفكرية 7. يُوصف جدار الحماية بأنه: • (أ) أداة عازلة 8. يُقصد بالقرصنة: • (أ) اختراق غير مشروع للأنظمة والبيانات 9. يطلق على الجهة التي تقوم بنقل الإنترنت إلى المنازل والمؤسسات: • (ج) مزود خدمة الإنترنت 10. حق المؤلف الذي يتيح للغير الاستفادة من العمل الفكري وفق شروط معينة: • (ب) الترخيص 11. تمثل الخصوصية الرقمية أحد أشكال: • (ج) الخصوصية الإلكترونية 12. أحد أخطر أنواع الجرائم الإلكترونية: • (ب) سرقة الهوية 13. يطلق على أعلى المبادئ المكونة للسلوك في ذلك الذي تكون فكرته الفصلية: • (ج) القيم 14. يمكن الوقاية من خطر الفيروسات الإلكترونية من خلال: • (ج) برامج الحماية المناسبة 15. يُعد البعد عن تغليب البرامج والتطبيقات: • (ب) التوازن المعلوماتي 16. يُعد النسخ أو التقليد غير مصرح به للمبرمجين: • (أ) انتهاك لحقوق المؤلف 17. مجموعة الأرقام أو الحروف أو الكلمات القابلة للمعالجة آليًا: • (أ) البيانات 18. خصوصية المنطقة المحصورة وسرية المراسلات الخاصة والبريد الإلكتروني: • (ب) الخصوصية الإلكترونية 19. من صور المواد الرقمية من طرق حماية الملكية الفكرية: • (ب) البصمة 20. المبدأ الذي يوفر للمستخدم بشأن استخدام البيانات فيما يتجاوز قدرته جمعها الذاتي: • (ج) مبدأ الإتاحة 21. تتقلص الفجوة الرقمية بين الدول عندما: • (ب) تتساوى نسب الوصول إلى الإنترنت 22. برامج متخصصة في سرقة البيانات الحساسة وتدمير أنظمة الحاسب: • (ب) الفيروسات 23. ترجع الأخلاقيات المختلفة لعوامل… • (ب) اختلاف القيم الثقافية 24. من أخلاقيات المعلومات: • (أ) إنتاج المعلومات 25. في الأخلاق الواجبة توافرها عند أداء مهنة ما: • (ب) أخلاقيات المهنة 26. برامج متخصصة في تصميمها لإحداث ضرر كبير لأنظمة الحاسب: • (ب) الفيروسات 27. من الملكية الفكرية الصناعية: • (ب) الملكية الفكرية الصناعية 28. من مظاهر التقدم التكنولوجي المتاحة أمام الأفراد: • (ج) الانترنت 29. من صور الاعتداء على حقوق المؤلف: • (ب) عدم توثيق المصدر 30. يُقصد بتنظيم المعلومات:",
    ),
    (
        "لينك صفحة الفيسبوك",
        "https://www.facebook.com/share/1CphTHh5kV/?mibextid=wwXIfr",
    ),
    (
        "امتحان مادة مرافق المعلومات",
        "عدد الأسئلة 30 سؤالاً موضوعياً (من اختيار من متعدد) (إجمالي الدرجات 60 درجة، لكل سؤال درجتان) ظلل الإجابة الصحيحة للفقرات من (1 - 30) في نموذج الإجابة 1. مصدر للمعلومات يتطلب الإشراف الأكاديمي: (ب) الرسائل الجامعية 2. هي عبارة عن قواعد خاصة بفرز الكتب في المكتبات وتصنيفها وترتيبها واسترجاعها: (ج) التصنيفات 3. كانت وظيفة المكتبات في الماضي: (ج) الحفاظ على الكتب 4. يمكن الحصول على معلومات سريعة وموجزة عن موضوع معين عن طريق: (ب) الموسوعات 5. من الأسباب التي أدت إلى ظهور مراكز مصادر التعلم بمرافق المعلومات المدرسية: (ب) الإنجاز المعرفي 6. من مصادر التعلم: (ج) الصور الفوتوغرافية 7. من أمثلة المكتبات المتخصصة: (أ) مكتبات الكليات 8. يتكون الكتاب من عدة أجزاء منها: (ب) الصور 9. يتكون الكتاب من عدة أجزاء منها: (ج) السيرة الذاتية للمؤلف 10. يمكننا المعرفة المصورة من العديد من المصادر مثل: (ج) أب معاً 11. ظهرت نتيجة توسع الجامعات وتعدد التخصصات: (ج) كليات الأقسام 12. مطبوع غير دوري ويشمل على (49) صفحة فأكثر: (ب) الكتب 13. البوابة الرئيسية الأولى لبنك المعرفة هي: (ج) بوابة إنتاج المعلومات 14. يوجد بوابة إلكترونية: (ب) سبع مكتبات متخصصة ⸻ الصفحة الثانية: 15. من أهداف المكتبات الجامعية: (ب) التثقيف 16. من أمثلة منصات القراءة التفاعلية: (ب) منصة اقرأ بالعربية 17. تنقسم الدوريات وفقاً لتتابع الصدور إلى: (ج) تجارية 18. هي الخدمة التي تهتم بتوجيه المعلومات الحديثة إلى المستفيدين: (ب) الخدمة الجارية 19. تطمح المكتبات العامة في المقام الأول إلى: (أ) التثقيف 20. من خصائص مراكز مصادر التعلم: (أ) تعدد الوسائط 21. من مميزات منصات القراءة التفاعلية: (أ) معالجة الصور 22. من خصائص المكتبات المتخصصة: (ج) العدد الكبير من المستفيدين 23. يطلق على مركز مصادر التعلم: (أ) المكتبة المدرسية 24. مؤسسة علمية ثقافية تربوية اجتماعية هي: (ب) المكتبة العامة 25. هي رفوف إلكترونية بها العديد من مصادر المعلومات: (ج) منصات القراءة التفاعلية 26. يمكن الإنشاء بمنصات القراءة التفاعلية عن طريق: (ب) ولي الأمر 27. مصادر المعلومات متاحة عن طريق الاتصال المباشر: (ج) الأخبار 28. هي المكتبة التي توجد داخل وزارة أو مؤسسة وتخدم موظفي تلك المؤسسة: (ب) المكتبة المتخصصة 29. من مميزات الكتب الإلكترونية: (أ) إمكانية دمج الصوت والصورة جنباً إلى جنب مع النص 30. هي الخدمة التي تهتم بتقديم المعلومات الحديثة لكافة المستفيدين فور تصدرها: (ب) البث الانتقائي للمعلومات",
    ),
    (
        "امتحان مادة مقدمة في تقنية المعلومات",
        "جامعة طنطا – كلية الآداب برنامج شعبة المعلومات والمكتبات اختبار نهاية الفصل الدراسي (2022–2023) – المستوى الأول – الفصل الدراسي الثاني لمادة: تقنيات البحث في قواعد المعلومات عدد الأسئلة الكلية للاختبار 50 درجة – مدة الاختبار ساعة واحدة نموذج (1) (عدد الأسئلة 50 سؤالًا موضوعيًا، درجة كل سؤال: درجة واحدة) ظل الإجابة الصحيحة في نموذج الإجابة 1. كتابة الكلمات بلون أبيض على خلفية بيضاء تعرف لدى محرك البحث بالأسلوب: أ. الإبداع ب. الحشو ج. الحظر د. الاختزال 2. Google Social Search من محركات بحث: أ. الصور ب. الفيديو ج. الشبكات المسموعة د. الشبكات الاجتماعية 3. برنامج ترجمة الواجهة الخلفية لمحركات البحث: أ. الفهرس ب. المتصفح ج. محرك البحث د. معالج الاستفسار 4. يستخدم الباحث العلامات المنطقية (AND – OR – NOT) بهدف: أ. تحديد الكلمات ب. التوسع في الاستعلام ج. تضييق الاستعلام د. المعالجة المنطقية 5. من المفاهيم التي تدل على وجود كمية كبيرة من البيانات يصعب معالجتها: أ. البيانات الضخمة ب. البيانات النوعية ج. البيانات الكمية د. الفهرسة 6. من الكلمات التي تفيد في البحث عن مواقع تحتوي على المصطلح في العنوان: أ. inurl ب. intitle ج. filetype د. site 7. من علامات التنسيق التي نستخدمها لتحديد النص الغامق: أ. <mark> ب. <strong> ج. <i> د. <q> 8. من علامات التنسيق التي نستخدمها لتظليل النص: أ. <mark> ب. <strong> ج. <i> د. <q> 9. من علامات التنسيق التي نستخدمها لإنشاء قائمة تعريفية: أ. <ol> ب. <ul> ج. <dl> د. <details> 10. من علامات التنسيق التي نستخدمها لإنشاء قائمة غير مرتبة: أ. <ol> ب. <ul> ج. <dl> د. <details> 11. من علامات التنسيق التي نستخدمها لإدراج عناصر قابلة للفتح والغلق: أ. <ol> ب. <ul> ج. <dl> د. <details> 12. ……… من محركات بحث الملفات النصية: أ. Free Sound ب. Mazwai ج. PDF Drive د. none 13. المواقع التي لا يمكن الوصول إليها من خلال محركات البحث: أ. العميق ب. السطحي ج. المظلم د. الخفي 14. الويب الأصغر حجماً والأقل استخداماً من حيث المحتوى هو: أ. السطحي ب. العميق ج. المظلم د. الخفي 15. من محركات بحث الصور المتقدمة: أ. gettyimages ب. medlineplus ج. Mazwai د. none 16. من محركات بحث المعلومات الطبية: أ. gettyimages ب. medlineplus ج. Mazwai د. none 17. جودة المحتوى ضمن الموقع يعد من تقنيات استجابة النتائج: أ. البيضاء ب. السوداء ج. الخضراء د. none 18. الصفحة النصية لا بد أن تكون بحجمها: أ. 10 ميجابايت ب. 10 كيلوبايت ج. 3 ميجابايت د. 5 ميجابايت 19. النص المصمم في شكل ملف يسمى: أ. كود ب. كود نصي ج. كود برمجي د. none 20. نوع البيانات والمحتوى المقدم عبر محركات البحث هو: أ. نص ب. صوت ج. صورة د. جميع ما سبق 21. يرتكز الاستناد على محرك التخصص الموضوعي في مسار: أ. الإكمال التلقائي ب. التكرار ج. الحشو د. الحظر 22. الويب العميق يطلق عليه أيضاً: أ. العميق ب. المغلق ج. المفتوح د. السطحي 23. مجموعة الكلمات والمواضيع التي تعبر عن محتوى الموقع تسمى: أ. المحتوى ب. الإكمال التلقائي ج. الكلمات المفتاحية د. التكرار 24. يعد برنامج المفهرس الحد الأساسي لـ: أ. الحشو ب. الدليل ج. محرك البحث د. تهيئة المواقع 25. استخدام الأساليب المشروعة والقانونية لتحسين ترتيب المواقع في محركات البحث من استراتيجيات التهيئة: أ. السوداء ب. الخضراء ج. البيضاء د. none 26. لإظهار علامات التحكم في الفيديو نستخدم: أ. poster ب. width ج. controls د. none 27. لإدراج صورة بالموقع نستخدم العلامة: أ. <img> ب. <a> ج. <p> د. <ol> 28. لإدراج الروابط الداخلية والخارجية بالموقع نستخدم: أ. <ins> ب. <a> ج. <p> د. <ol> 29. لإدراج فقرة بالموقع نستخدم العلامة: أ. <ins> ب. <a> ج. <p> د. <ol> 30. لإضافة سطر جديد نستخدم العلامة: أ. <hr> ب. <br> ج. <p> د. <ol> ظل العبارة بالإجابة “أ” إذا كانت العبارة صحيحة، و”ب” إذا كانت العبارة خاطئة 31. قسم محركات البحث على أساس التخصص الموضوعي إلى عامة ومتخصصة 32. تعتبر محركات بحث الصور والفيديو من محركات البحث النوعية 33. تعتمد لغة HTML على الجداول فقط 34. تزداد أهمية العوامل الخارجية لتقييم المواقع 35. المحركات المتخصصة تبحث وتستخرج مواقع في مجال موضوعي خاص 36. كلما زاد التكرار زادت أهمية الكلمة المفتاحية في نتائج البحث 37. من تقنيات التهيئة البيضاء استخدام النصوص غير مرئية 38. بالنسبة لمحركات البحث تكون الكلمة ذات أهمية إذا كانت تكراراً في العنوان 39. يعتبر الاستفسار من العناصر المؤثرة في نتائج محركات البحث 40. كلما ازداد عدد الروابط الخارجية زادت مكانة الموقع وبالتالي ترتيبه 41. يوجد في لغة HTML 6 أنواع من العناوين 42. من أهم إمكانيات الإبداع في محركات البحث إدراج صور الموقع 43. محدد النص البديل يعد من معايير ترتيب النتائج في محركات البحث 44. محركات الشهرة لا تعد من محركات البحث 45. يرتبط الحجز غير المعتمد بالبحث الراجعي 46. تقنية الإكمال التلقائي تقوم بإكمال السواق الذي بدأه المستخدم 47. برنامج المفهرس يقوم بالاحصاد أو الروبوت 48. الامتحان الذي لا توجد له تم يدخله ولا تكن له علامة غام هي نتيجة فارغة 49. الامتحان الذي لا يوجد له تم يدخله ولا تكن له علامة غام هي نتيجة فارغة 50. ملف استبعاد الزواحف من العوامل التي تعوق أداء الزواحف",
    ),
    (
        "امتحان مادةالانترنت في المكتبات",
        "جامعة طنطا – كلية الآداب برنامج تقنية المعلومات والمكتبات اختبار نهاية الفصل الدراسي الأول – يناير 2023 – نموذج (1) المستوى الأول عدد الأسئلة: 50 سؤالاً موضوعيًا (اختيار من متعدد) (إجمالي الدرجات = 50 درجة، كل سؤال = درجة واحدة) ظلل الإجابة الصحيحة فقط في نموذج الإجابة نموذج (1) 1. من عنوان موقع جامعة طنطا: أ. نوع الموقع ب. اسم الدومين ج. رابط الانتقال د. نوع الامتداد 2. تعتبر المعلومات الرقمية من: أ. أساليب الحماية المادية ب. أساليب الحماية الإلكترونية ج. المعلومات التقليدية د. معلومات صوتية 3. التداول في web3 يختلف عن التداول في: أ. web1 ب. web2 ج. web4 د. web5 4. المكتبة الرقمية مصممة لتخزين الأدوات عبر الشبكة من خلال: أ. موقع ويب ب. مستعرض ج. برنامج د. أداة 5. برنامج من خلاله تستطيع الإبحار الإلكتروني وتصفح الصفحات: أ. WIKi ب. Google chrome ج. YouTube د. Outlook 6. التهديدات التي لا يمكن التحكم بها أو منعها: أ. التهديدات الداخلية ب. التهديدات البيئية ج. التهديدات البشرية د. الفيروسات 7. مصطلح يطلق على تصنيف المواقع من فئة خفية بالإنترنت: أ. الويب السطحي ب. الويب العميق ج. الويب المظلم د. الويب الشفاف 8. مواقع مع الجيل الثاني للويب لا تسمح بمشاركة النصوص، بل تسمح بمشاركة الصور والفيديو: أ. الويكي ب. المدونات ج. مواقع الشبكات الاجتماعية د. الويب 3 9. فيروس الحاسوب الذي يعمل على إدخال الملفات أو غلق الملفات: أ. التروجان ب. الدودة ج. حصان طروادة د. المخترق 10. من آليات حماية الحاسب عند حفظ الملفات: أ. كلمة السر ب. الجدار الناري ج. التشفير د. النسخ الاحتياطي 11. عمليات الاتصالات بين أكثر من طرف تعتمد على: أ. المعالجة ب. التشفير ج. التحويل د. الضغط 12. إصابة الحاسب بفيروس ناتجة عن: أ. استخدام برامج غير مرخصة ب. استخدام برامج التصفح ج. البرامج الأصلية د. النسخ الأصلية 13. لربط جهازين أو أكثر يمكن الحصول على: أ. الشبكة اللاسلكية ب. الفيروس ج. الفاكس د. الويب 14. من الشبكات التي تسمح بإجراء المحادثات الفورية: أ. MySpace ب. Facebook ج. تويتر د. جوجل 15. الحواسيب المحمولة تحتاج إلى: أ. معالج ب. لوحة أم ج. مزود طاقة د. بطارية 16. يقتصر الاتصال بالإنترنت عن طريق الهاتف على: أ. الاتصال السلكي ب. الاتصال اللاسلكي ج. الاتصال المباشر د. البلوتوث 17. فيروس قطاع التشغيل يصيب: أ. البرامج ب. الملفات ج. القرص د. الذاكرة 18. خلال فتح مصاب بإصابة فيروسيه يتم: أ. مسح البيانات ب. مسح القرص ج. مسح الملفات د. حذف النظام 19. تكمن محتويات موقع الويب في: أ. الصفحة الرئيسية ب. الصفحة الشخصية ج. الصفحة البديلة د. الصفحة الفرعية 20. تهدف برامج تصفح الإنترنت إلى: أ. تقليل حجم النص ب. تسهيل قراءة النص ج. تحديد المواقع د. تصغير الصورة 21. برامج قارئ الأخبار News Reader يُطلق عليها أيضًا: أ. RSS ب. Google Drive ج. Google Books د. Word 22. عند إضافة خدمة RSS تظهر في قائمة: أ. الصفحة ب. البرامج ج. الاشتراكات د. المتصفحات 23. تدوينة أو تعليق يتم نشره بالاشتراك في: أ. المدونات ب. الويكي ج. RSS د. الفيسبوك 24. يظهر هذا الرمز في حالة إذا كان الموقع أو الصفحة خاصة وغير متاحة للجميع: أ. ERROR 403 ب. ERROR 401 ج. ERROR 407 د. x 404 25. تقيس أهمية المعلومات من وجهة نظر المستخدمين فتقوم على: أ. المصداقية ب. السرية ج. الإتاحة د. الإفادة 26. تتميز بسهولة إنشاء صفحات HTML جديدة وبطريقة بسيطة مع القدرة على الاسترجاع من صفحة أخرى من خلال: أ. الشبكات الاجتماعية ب. المدونات ج. مواقع الويكي د. مواقع الجيل الثاني 27. برنامج يُركب على خادم موقع ولا يسمح للمستخدمين: أ. أعضاء فريق عمل أو أعضاء موقع ب. باستخدامه في التعليم ج. باستخدامه في المكتبات د. المدونات المتخصصة 28. هي نوع من الحاسبات ولكنها تعمل مثل الحاسب اللوحي: أ. منطوق النص ب. القارئ الصوتي ج. القارئ البصري د. القارئ الإلكتروني 29. القدرة على التعديل ومزامنة الأنظمة والمصالح من خلال: أ. التشفير ب. التوثيق ج. النسخ الاحتياطي د. الويكي 30. المداخل المخزنة في قائمة النتائج والتاريخ تندرج على شكل: أ. URL ب. links ج. RSS د. صفحات 31. لاحقة الموقع إذا كانت مؤسسة حكومية فهي: أ. Net ب. Org ج. Int د. Gov 32. الجهاز الذي يتبع المؤسسة غير ربحية فهو يحمل الامتداد: أ. Org ب. Int ج. Net د. Edu 33. الجهاز Servers عبارة عن مجموعة من: أ. الحواسيب ب. البرامج ج. قواعد البيانات د. الشبكات 34. تضمين معلومات في صفحات الويب لا يمكن الحصول عليها إلا من خلال: أ. الصفحات ب. الروابط التشعبية ج. الويب العميق د. الإنترنت 35. روابط موجودة من المواقع المختلفة توصل المستخدم لصفحات الويب هي: أ. Hyper text ب. Hyper lines ج. الروابط الداخلية د. الروابط التشعبية 36. بعض المعلومات التي تعرضت غير مؤمنة مثل الاختراق غير المصرح فهي تحتاج إلى الاطلاع عليها عبر: أ. التشفير ب. البصمة ج. الحماية د. السرية 37. يعتبر جهاز الحاسب يقوم بنقل المعلومات من حاسبات أخرى يسمى: أ. خادم ب. عميل ج. متصفح د. سيرفر 38. بروتوكول يسمح بنقل البيانات وتبادلها بين الحاسبات: أ. http ب. الويب ج. الشبكة د. السيرفر 39. تظهر رسالة ERROR403 عند غلق الموقع أو الملف أو الخادم من قبل: أ. المستخدم ب. الموقع ج. الشركة د. السيرفر 40. تظهر رسالة ERROR406 عندما تكون الصفحة خاصة أو غير متاحة للجميع: أ. العبارة خاطئة ب. العبارة صحيحة 41. اتفاقيات أمنية يتفق عليها مزود الخدمة مع الشبكة لتشفير البيانات والمعلومات عند استخدامات الإنترنت: أ. بروتوكولات الاتصال ب. صفحة الويب ج. الشبكة د. موقع الإنترنت 42. مجموعة من البرامج والمكونات: أ. الأجهزة المادية / والبرمجيات ب. النسخ الاحتياطي ج. البصمة الإلكترونية د. النسخ الإلكترونية 43. الاختصار (Mil) يعني أن الموقع تابع لمؤسسة عسكرية: أ. العبارة خاطئة ب. العبارة صحيحة 44. نوع كلمات المرور من أساليب الحماية التقنية: أ. أساليب الحماية المادية ب. أساليب الحماية التقنية ج. أساليب الحماية الإدارية د. أساليب الحماية الإلكترونية 45. يظهر هذا الرمز في حالة إذا لم يتم العثور على الموقع أو الملف: أ. ERROR 401 ب. ERROR 404 ج. ERROR 407 د. ERROR 406 46. من أنواع الحماية: أ. أساليب الحماية المادية ب. أساليب الحماية الإدارية ج. أساليب الحماية التقنية د. جميع ما سبق 47. من أهم أنواع الفقد: أ. الفقد العرضي ب. الفقد المتعمد ج. الفقد الذاتي د. الفقد الخارجي 48. تثبيت برامج مضادة للفيروسات من أساليب: أ. الحماية المادية ب. الحماية الإدارية ج. الحماية التقنية د. الحماية البيئية 49. تهدف وضع سياسات وتعليمات أمن المعلومات من: أ. أساليب الحماية التقنية ب. أساليب الحماية المادية ج. أساليب الحماية الإدارية د. أساليب الحماية البيئية 50. مشروع موسوعة ويكيبيديا بدأ: أ. 2000 ب. 2002 ج. 2001 د. 2003",
    ),
]


# Sessions database setup
def get_sessions_db_connection():
    if not os.path.exists("sessions.db"):
        conn = sqlite3.connect("sessions.db")
        cursor = conn.cursor()
        cursor.execute(
            """
        CREATE TABLE sessions (
            id TEXT PRIMARY KEY,
            questions_asked INTEGER DEFAULT 0,
            last_question_time TIMESTAMP DEFAULT CURRENT_TIMESTAMP
        )
        """
        )
        conn.commit()
        conn.close()

    return sqlite3.connect("sessions.db")


# Setup conversations database
def get_conversations_db_connection():
    if not os.path.exists("conversations.db"):
        conn = sqlite3.connect("conversations.db")
        cursor = conn.cursor()

        # Create conversations table
        cursor.execute(
            """
            CREATE TABLE conversations (
                id INTEGER PRIMARY KEY AUTOINCREMENT,
                user_id INTEGER,
                title TEXT NOT NULL,
                created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
                updated_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
                FOREIGN KEY (user_id) REFERENCES users(id)
            )
            """
        )

        # Create messages table
        cursor.execute(
            """
            CREATE TABLE messages (
                id INTEGER PRIMARY KEY AUTOINCREMENT,
                conversation_id INTEGER NOT NULL,
                sender TEXT NOT NULL,
                content TEXT NOT NULL,
                created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
                FOREIGN KEY (conversation_id) REFERENCES conversations(id)
            )
            """
        )

        conn.commit()
        conn.close()

    return sqlite3.connect("conversations.db")


# Rate limiting functions
def check_rate_limit(session_id):
    """Check if the session has exceeded the question limit"""
    conn = get_sessions_db_connection()
    cursor = conn.cursor()

    try:
        cursor.execute(
            "SELECT questions_asked FROM sessions WHERE id = ?", (session_id,)
        )
        result = cursor.fetchone()

        if not result:
            cursor.execute(
                "INSERT INTO sessions (id, questions_asked) VALUES (?, 0)",
                (session_id,),
            )
            conn.commit()
            return True

        questions_asked = result[0]

        if questions_asked >= 3:
            return False

        cursor.execute(
            "UPDATE sessions SET questions_asked = questions_asked + 1 WHERE id = ?",
            (session_id,),
        )
        conn.commit()
        return True

    finally:
        conn.close()


def reset_rate_limit(session_id):
    """Reset the question limit for a session"""
    conn = get_sessions_db_connection()
    cursor = conn.cursor()
    try:
        cursor.execute(
            "UPDATE sessions SET questions_asked = 0 WHERE id = ?", (session_id,)
        )
        conn.commit()
    finally:
        conn.close()


def find_best_match(prompt, threshold=75):

    clean_prompt = re.sub(r"[^\w\s؟?.،,:;!]", "", prompt.lower().strip())

    matches = []

    basic_match, basic_score = process.extractOne(
        clean_prompt, [q[0].lower() for q in PREDEFINED_QA], scorer=fuzz.ratio
    )
    matches.append((basic_match, basic_score, "ratio"))

    token_match, token_score = process.extractOne(
        clean_prompt,
        [q[0].lower() for q in PREDEFINED_QA],
        scorer=fuzz.token_sort_ratio,
    )
    matches.append((token_match, token_score, "token_sort"))

    set_match, set_score = process.extractOne(
        clean_prompt, [q[0].lower() for q in PREDEFINED_QA], scorer=fuzz.token_set_ratio
    )
    matches.append((token_match, set_score, "token_set"))

    partial_match, partial_score = process.extractOne(
        clean_prompt, [q[0].lower() for q in PREDEFINED_QA], scorer=fuzz.partial_ratio
    )
    matches.append((partial_match, partial_score, "partial"))

    best_match_info = max(matches, key=lambda x: x[1])
    best_match, best_score, algorithm = best_match_info

    if best_score >= threshold:
        # Find the index of the matching question
        for i, (question, answer) in enumerate(PREDEFINED_QA):
            if question.lower() == best_match:
                return answer, best_score, algorithm

    return None, best_score, algorithm


def get_gemini_response(prompt):
    try:
        if not GEMINI_API_KEY:
            print("Gemini API key not found")
            return None

        # Try to find a match in predefined Q&A using enhanced fuzzy matching
        match_result, score, algorithm = find_best_match(prompt)

        if match_result:
            print(f"Found match with score {score} using {algorithm} algorithm")
            return match_result

        # If no good match is found, fall back to the Gemini API
        # Create a more structured context for the model
        context = (
            "You are a helpful assistant for the Faculty of Arts at Tanta University. "
        )
        context += "Your focus is on answering questions about the Information Technology and Libraries department. "
        context += "If you don't know the answer, suggest the student visit the department's website or Facebook page. "
        context += "Keep answers concise and relevant to academic matters."

        # Prepare the prompt with context and examples
        full_prompt = f"{context}\n\nUser Question: {prompt}\n\n"
        full_prompt += "Here are some examples of questions and their answers to help you understand the context:\n\n"

        # Add a subset of examples for context (not all to avoid token limits)
        key_examples = PREDEFINED_QA[:5]  # Using first 5 examples for context
        for question, answer in key_examples:
            full_prompt += f"Q: {question}\nA: {answer}\n\n"

        url = "https://generativelanguage.googleapis.com/v1beta/models/gemini-2.0-flash:generateContent"
        headers = {
            "Content-Type": "application/json",
        }
        params = {"key": GEMINI_API_KEY}
        data = {
            "contents": [{"parts": [{"text": full_prompt}]}],
            "generationConfig": {
                "temperature": 0.7,
                "topK": 40,
                "topP": 0.95,
                "maxOutputTokens": 1024,
            },
        }

        response = requests.post(url, headers=headers, params=params, json=data)

        if response.status_code == 200:
            result = response.json()
            if "candidates" in result and len(result["candidates"]) > 0:
                return result["candidates"][0]["content"]["parts"][0]["text"]
            else:
                print("No candidates in Gemini response")
                return None
        else:
            print(f"Gemini API error: {response.status_code}, {response.text}")
            return None
    except Exception as e:
        print(f"Error calling Gemini API: {e}")
        return None


def get_user_id_from_token(auth_header):
    """Extract user ID from the authorization header"""
    if not auth_header or not auth_header.startswith("Bearer "):
        return None

    token = auth_header.split(" ")[1]
    try:
        payload = jwt.decode(token, JWT_SECRET, algorithms=["HS256"])
        return payload.get("user_id")
    except jwt.ExpiredSignatureError:
        return None
    except jwt.InvalidTokenError:
        return None


@app.route("/api/signup", methods=["POST"])
def signup():
    data = request.json
    username = data.get("username")
    email = data.get("email")
    password = data.get("password")

    hashed_password = bcrypt.hashpw(password.encode("utf-8"), bcrypt.gensalt())

    conn = get_db_connection()
    cursor = conn.cursor()

    try:
        cursor.execute(
            "SELECT * FROM users WHERE username = ? OR email = ?", (username, email)
        )
        existing_user = cursor.fetchone()

        if existing_user:
            return jsonify({"error": "Username or email already exists"}), 400

        cursor.execute(
            "INSERT INTO users (username, email, password) VALUES (?, ?, ?)",
            (username, email, hashed_password),
        )
        conn.commit()

        return jsonify({"message": "User created successfully"})
    except Exception as e:
        conn.rollback()
        return jsonify({"error": str(e)}), 500
    finally:
        conn.close()


@app.route("/api/login", methods=["POST"])
def login():
    data = request.json
    email = data.get("email")
    password = data.get("password")

    conn = get_db_connection()
    cursor = conn.cursor()

    try:
        cursor.execute("SELECT * FROM users WHERE email = ?", (email,))
        user = cursor.fetchone()

        if not user or not bcrypt.checkpw(password.encode("utf-8"), user[3]):
            return jsonify({"error": "Invalid email or password"}), 401

        token = jwt.encode(
            {
                "user_id": user[0],
                "username": user[1],
                "email": user[2],
                "exp": datetime.now(UTC) + timedelta(days=1),
            },
            JWT_SECRET,
            algorithm="HS256",
        )

        session_id = request.headers.get("Session-ID")
        if session_id:
            reset_rate_limit(session_id)

        return jsonify(
            {
                "token": token,
                "user": {"id": user[0], "username": user[1], "email": user[2]},
            }
        )
    except Exception as e:
        return jsonify({"error": str(e)}), 500
    finally:
        conn.close()


@app.route("/api/request-reset", methods=["POST", "OPTIONS"])
def request_reset():
    if request.method == "OPTIONS":
        # CORS preflight response
        return jsonify({}), 200

    data = request.json
    email = data.get("email")

    conn = get_db_connection()
    cursor = conn.cursor()

    try:
        # Check if the user exists
        cursor.execute("SELECT * FROM users WHERE email = ?", (email,))
        user = cursor.fetchone()

        if not user:
            return jsonify({"error": "Email not found"}), 404

        # Generate a reset code and store it in memory
        reset_code = generate_reset_code()
        reset_codes[email] = reset_code

        # Email content
        reset_html = f"""
        <html>
            <body>
                <h1>Password Reset</h1>
                <p>Your password reset code is: <strong>{reset_code}</strong></p>
                <p>Enter this code on the reset password page to create a new password.</p>
            </body>
        </html>
        """

        send_email(email, "FOA CHAT AI - Password Reset", reset_html)

        return jsonify({"message": "Reset code sent to email"})
    except Exception as e:
        return jsonify({"error": str(e)}), 500
    finally:
        conn.close()
        # In-memory store for reset codes


EMAIL_ADDRESS = os.getenv("EMAIL_ADDRESS")
EMAIL_PASSWORD = os.getenv("EMAIL_PASSWORD")


def send_email(to_email, subject, html_content):
    try:
        msg = MIMEMultipart()
        msg["From"] = EMAIL_ADDRESS
        msg["To"] = to_email
        msg["Subject"] = subject

        msg.attach(MIMEText(html_content, "html"))

        server = smtplib.SMTP("smtp.gmail.com", 587)
        server.starttls()
        server.login(EMAIL_ADDRESS, EMAIL_PASSWORD)
        server.send_message(msg)
        server.quit()

        print(f"[DEBUG] Email sent to {to_email} with subject '{subject}'")
        return True
    except Exception as e:
        print(f"[DEBUG] Email sending failed: {e}")
        return False


reset_codes = {}


# Generate a 6-character alphanumeric reset code
def generate_reset_code():
    import random
    import string

    code = "".join(random.choices(string.ascii_uppercase + string.digits, k=6))
    print(f"[DEBUG] Generated reset code: {code}")  # Debug output to terminal
    return code


@app.route("/api/reset-password", methods=["POST", "OPTIONS"])
def reset_password():
    if request.method == "OPTIONS":
        return jsonify({}), 200  # CORS preflight response

    data = request.json
    token = data.get("token")
    new_password = data.get("new_password")

    conn = sqlite3.connect("users.db")
    cursor = conn.cursor()
    cursor.execute("SELECT * FROM users WHERE reset_token = ?", (token,))
    user = cursor.fetchone()

    if user:
        hashed_password = bcrypt.hashpw(new_password.encode("utf-8"), bcrypt.gensalt())
        cursor.execute(
            "UPDATE users SET password = ?, reset_token = NULL WHERE reset_token = ?",
            (hashed_password, token),
        )
        conn.commit()
        conn.close()
        print(f"[DEBUG] Password reset successful for token: {token}")
        return jsonify({"message": "Password reset successful"})
    else:
        conn.close()
        print(f"[DEBUG] Invalid or expired token: {token}")
        return jsonify({"message": "Invalid or expired token"}), 400


@app.route("/api/chat/response", methods=["POST"])
def get_chat_response():
    """Handle chat response generation using enhanced matching and Gemini API"""
    try:
        data = request.json
        question = data.get("question", "").strip()
        conversation_id = data.get("conversation_id")
        session_id = request.headers.get("Session-ID")
        auth_header = request.headers.get("Authorization")

        if not session_id:
            return jsonify({"error": "Session ID required"}), 400

        # Check authorization and rate limits
        user_id = get_user_id_from_token(auth_header)
        if not user_id:
            if not check_rate_limit(session_id):
                return (
                    jsonify(
                        {"error": "Question limit reached. Please login to continue."}
                    ),
                    403,
                )

        # Log the incoming question for debugging
        print(f"Received question: {question}")

        inputtocheck = question
        arabic_chars = [
            char
            for char in inputtocheck
            if "\u0600" <= char <= "\u06ff"
            or "\u0750" <= char <= "\u077f"
            or "\u08a0" <= char <= "\u08ff"
        ]
        langtype = len(arabic_chars) > len(inputtocheck) / 2
        if langtype:
            print("The input text is in Arabic.")
            inputlangtype = "ar"
            matched_answer, score, algorithm = find_best_match(question)
        else:
            print("The input text is in another language.")

            inputlangtype = "en"
            matched_answer, score, algorithm = find_best_match(
                convert_to_arabic(question)
            )

        # First try to find a direct match using enhanced fuzzy matching

        if matched_answer:
            print(f"Found direct match with score {score} using {algorithm}")
            if inputlangtype == "en":
                response_text = translate_into_english(matched_answer)
                if not response_text:
                    raise ValueError("Translation back to English failed.")
            else:
                response_text = matched_answer
        # If no direct match, try Gemini API
        elif GEMINI_API_KEY:
            gemini_response = get_gemini_response(question)
            if gemini_response:
                response_text = gemini_response
            else:
                response_text = "I apologize, but I couldn't generate a response at this time. Please try again later."
        else:
            response_text = "I don't have information about that yet. Please try asking something else."

        # Save the conversation if a conversation ID is provided
        if conversation_id:
            conn = get_conversations_db_connection()
            cursor = conn.cursor()
            try:
                # Save user message
                cursor.execute(
                    "INSERT INTO messages (conversation_id, sender, content) VALUES (?, ?, ?)",
                    (conversation_id, "user", question),
                )

                # Save bot response
                cursor.execute(
                    "INSERT INTO messages (conversation_id, sender, content) VALUES (?, ?, ?)",
                    (conversation_id, "bot", response_text),
                )

                # Update conversation timestamp
                cursor.execute(
                    "UPDATE conversations SET updated_at = CURRENT_TIMESTAMP WHERE id = ?",
                    (conversation_id,),
                )

                conn.commit()
            except Exception as e:
                print(f"Error saving messages: {e}")
                conn.rollback()
            finally:
                conn.close()

        return jsonify({"response": response_text})
    except Exception as e:
        print(f"Error in get_chat_response: {e}")
        return jsonify({"error": "An error occurred processing your request"}), 500


@app.route("/api/conversations", methods=["GET"])
def get_conversations():
    """Get all conversations for the current user"""
    auth_header = request.headers.get("Authorization")
    user_id = get_user_id_from_token(auth_header)

    if not user_id:
        return jsonify({"error": "Unauthorized"}), 401

    conn = get_conversations_db_connection()
    cursor = conn.cursor()

    try:
        cursor.execute(
            """
            SELECT id, title, created_at, updated_at
            FROM conversations
            WHERE user_id = ?
            ORDER BY updated_at DESC
            """,
            (user_id,),
        )

        conversations = []
        for row in cursor.fetchall():
            conversations.append(
                {
                    "id": row[0],
                    "title": row[1],
                    "created_at": row[2],
                    "updated_at": row[3],
                }
            )

        return jsonify({"conversations": conversations})
    except Exception as e:
        print(f"Error getting conversations: {e}")
        return jsonify({"error": "An error occurred retrieving conversations"}), 500
    finally:
        conn.close()


@app.route("/api/conversations", methods=["POST"])
def create_conversation():
    """Create a new conversation"""
    auth_header = request.headers.get("Authorization")
    user_id = get_user_id_from_token(auth_header)

    if not user_id:
        return jsonify({"error": "Unauthorized"}), 401

    data = request.json
    title = data.get("title", "New Conversation")

    conn = get_conversations_db_connection()
    cursor = conn.cursor()

    try:
        cursor.execute(
            "INSERT INTO conversations (user_id, title) VALUES (?, ?)", (user_id, title)
        )
        conn.commit()

        new_conversation_id = cursor.lastrowid

        # Add initial bot greeting message
        cursor.execute(
            "INSERT INTO messages (conversation_id, sender, content) VALUES (?, ?, ?)",
            (
                new_conversation_id,
                "bot",
                "Hello! I'm your FOA Chat AI assistant. How can I help you today?",
            ),
        )
        conn.commit()

        return jsonify(
            {
                "id": new_conversation_id,
                "title": title,
                "created_at": datetime.now().isoformat(),
                "updated_at": datetime.now().isoformat(),
            }
        )
    except Exception as e:
        conn.rollback()
        print(f"Error creating conversation: {e}")
        return jsonify({"error": "An error occurred creating the conversation"}), 500
    finally:
        conn.close()


@app.route("/api/conversations/<int:conversation_id>", methods=["GET"])
def get_conversation_messages(conversation_id):
    """Get all messages for a specific conversation"""
    auth_header = request.headers.get("Authorization")
    user_id = get_user_id_from_token(auth_header)

    # For non-authenticated users, we'll check if the session has access to this conversation
    session_id = request.headers.get("Session-ID")

    conn = get_conversations_db_connection()
    cursor = conn.cursor()

    try:
        # Check if the conversation belongs to the user (if authenticated)
        if user_id:
            cursor.execute(
                "SELECT id FROM conversations WHERE id = ? AND user_id = ?",
                (conversation_id, user_id),
            )
            if not cursor.fetchone():
                return jsonify({"error": "Conversation not found"}), 404

        cursor.execute(
            """
            SELECT id, sender, content, created_at
            FROM messages
            WHERE conversation_id = ?
            ORDER BY created_at ASC
            """,
            (conversation_id,),
        )

        messages = []
        for row in cursor.fetchall():
            messages.append(
                {"id": row[0], "sender": row[1], "text": row[2], "created_at": row[3]}
            )

        return jsonify({"messages": messages})
    except Exception as e:
        print(f"Error getting messages: {e}")
        return jsonify({"error": "An error occurred retrieving messages"}), 500
    finally:
        conn.close()


@app.route("/api/conversations/<int:conversation_id>", methods=["PUT"])
def update_conversation(conversation_id):
    """Update a conversation (title)"""
    auth_header = request.headers.get("Authorization")
    user_id = get_user_id_from_token(auth_header)

    if not user_id:
        return jsonify({"error": "Unauthorized"}), 401

    data = request.json
    title = data.get("title")

    if not title:
        return jsonify({"error": "Title is required"}), 400

    conn = get_conversations_db_connection()
    cursor = conn.cursor()

    try:
        # Check if the conversation belongs to the user
        cursor.execute(
            "SELECT id FROM conversations WHERE id = ? AND user_id = ?",
            (conversation_id, user_id),
        )
        if not cursor.fetchone():
            return jsonify({"error": "Conversation not found"}), 404

        cursor.execute(
            "UPDATE conversations SET title = ?, updated_at = CURRENT_TIMESTAMP WHERE id = ?",
            (title, conversation_id),
        )
        conn.commit()

        return jsonify({"message": "Conversation updated successfully"})
    except Exception as e:
        conn.rollback()
        print(f"Error updating conversation: {e}")
        return jsonify({"error": "An error occurred updating the conversation"}), 500
    finally:
        conn.close()


@app.route("/api/conversations/<int:conversation_id>", methods=["DELETE"])
def delete_conversation(conversation_id):
    """Delete a conversation"""
    auth_header = request.headers.get("Authorization")
    user_id = get_user_id_from_token(auth_header)

    if not user_id:
        return jsonify({"error": "Unauthorized"}), 401

    conn = get_conversations_db_connection()
    cursor = conn.cursor()

    try:
        # Check if the conversation belongs to the user
        cursor.execute(
            "SELECT id FROM conversations WHERE id = ? AND user_id = ?",
            (conversation_id, user_id),
        )
        if not cursor.fetchone():
            return jsonify({"error": "Conversation not found"}), 404

        # Delete all messages first
        cursor.execute(
            "DELETE FROM messages WHERE conversation_id = ?", (conversation_id,)
        )

        # Then delete the conversation
        cursor.execute("DELETE FROM conversations WHERE id = ?", (conversation_id,))
        conn.commit()

        return jsonify({"message": "Conversation deleted successfully"})
    except Exception as e:
        conn.rollback()
        print(f"Error deleting conversation: {e}")
        return jsonify({"error": "An error occurred deleting the conversation"}), 500
    finally:
        conn.close()


# Database setup
def get_db_connection():
    if not os.path.exists("users.db"):
        conn = sqlite3.connect("users.db")
        cursor = conn.cursor()
        cursor.execute(
            """
        CREATE TABLE users (
            id INTEGER PRIMARY KEY AUTOINCREMENT,
            username TEXT UNIQUE NOT NULL,
            email TEXT UNIQUE NOT NULL,
            password TEXT NOT NULL
        )
        """
        )
        conn.commit()
        conn.close()

    return sqlite3.connect("users.db")


if __name__ == "__main__":
    app.run(debug=True, port=5000)
